{"data":[
["CSCI 5809","Computer Animation","waitlisted","Develops a firm understanding of the general principles of computer animation. Lectures cover the creation of models, materials, textures, surfaces, and lighting. Path and key frame animation, particle dynamics, and rendering are introduced. Students are assigned a number of animation tutorials to carry out. Same as CSCI 4809 and ATLS 4809/5809. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.",0,0,["lecture","WeFr 5:30PM - 6:45PM",0,0,"Roger King","3"]],
["CSCI 2820","Linear Algebra with Computer Science Applications","waitlisted","Introduces the fundamentals of linear algebra in the context of computer science applications.  Includes vector spaces, matrices, linear systems, and eigenvalues.  Includes the basics of floating point computation and numerical linear algebra. Requisites: Requires prerequisite courses of CSCI 2270 and APPM 1360 or MATH 2300 (all minimum grade C-).",0,0,["lecture","MoWeFr 2:00PM - 2:50PM",0,0,"Xiao-Chuan Cai","3"]],
["CSCI 2824","Discrete Structures","open","Covers foundational materials for computer science that is often assumed in advanced courses. Topics include set theory, Boolean algebra, functions and relations, graphs, propositional and predicate calculus, proofs, mathematical induction, recurrence relations, combinatorics, discrete probability. Focuses on examples based on diverse applications of computer science. Requisites: Requires prerequisite or corequisite course of CSCI 2270 and a prerequisite course of MATH 1300 or MATH 1310 or APPM 1350 or APPM 1345 (minimum grade C-).",3,0,["lecture","MoWeFr 9:00AM - 9:50AM",3,0,"Christian Ketelsen","3"]],
["CSCI 5608","Software Project Management","open","Presents topics and techniques critical to the management of software product development, including estimating, planning, quality, tracking, reporting, team organization, people management, and legal issues. Gives special attention to problems unique to software projects. Recommended prereqs., ECEN 4583, CSCI 5548 and 4318, or equivalent industrial experience. Same as ECEN 5603 and EMEN 5031. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.",17,0,["lecture","Mo 6:00PM - 8:30PM",3,0,"Margaret MacMillan","3"],["lecture","TBA",0,0,"Margaret MacMillan","3"],["lecture","Mo 6:00PM - 8:30PM",17,0,"Vasanthan Dasan","3"],["lecture","TBA",3,0,"Vasanthan Dasan","3"]],
["CSCI 5854","Theoretical Foundations for Cyber-Physical Systems","open","None",6,0,["lecture","TuTh 5:00PM - 6:15PM",6,0,"Sriram Sankaranarayanan","3"]],
["CSCI 5817","Database Systems","open","Provides an advanced treatment of basic database concepts. Recommended prereqs., CSCI 3287 and 3753. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.",25,0,["lecture","TuTh 11:00AM - 12:15PM",21,0,"Frank Miller","3"],["lecture","TBA",25,0,"Frank Miller","3"]],
["CSCI 5254","Convex Optimization and Its Applications","open","Discuss basic convex analysis (convex sets, functions and optimization problems), optimization theory (linear, quadratic, semidefinite and geometric programming; optimality conditions and duality theory), some optimization algorithms (descent methods and interior-point methods), basic applications (in signal processing, control, communications, networks, statistics, machine learning, circuit design and mechanical engineering, etc.), and some advanced topics (distributed decomposition, exact convex relaxation, parsimonious recovery). Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.",21,0,["lecture","TuTh 2:00PM - 3:15PM",21,0,"Lijun Chen","3"]],
["CSCI 5250","Computer Science: the Canon","waitlisted","Explores the \"great works\" of computer science through intensive reading and discussion. Readings include works by Babbage, Turing, Von Neumann, Goedel, Shannon and Minsky, among others. CSCI 5250 does not count toward breadth requirement for Computer Science MS/ME degree. Same as CSCI 4250. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.",0,0,["seminar","We 5:00PM - 7:30PM",0,0,"Michael Eisenberg","3"]],
["CSCI 4302","Advanced Robotics","open","Exposes students to current research topics in the field of robotics and provides hands-on experience in solving a grand challenge program. Same as CSCI 5302. Requisites: Requires prerequisite course of CSCI 3302 (minimum grade C-).",2,0,["lecture","TuTh 8:00AM - 9:15AM",2,0,"Christoffer Heckman","3"]],
["CSCI 3002","HCC Foundations/User-Centered Design and Development 1","waitlisted","Introduces the practice and research of human-centered computing, including the evolution of human-computer interaction to its forms today and the techniques of user-centered design. The course will survey topics that include social computing; tangible computing; mobility; and more. It will cover computing in society at large with respect to domains such as health, education, assistive technology, emergency response, and environment. Requisites: Restricted to students with 27-180 credits (Sophomores, Juniors or Seniors) only.",0,0,["lecture","TuTh 12:30PM - 1:45PM",0,0,"Pei Hsiu Yeh","3"]],
["CSCI 2270","Computer Science 2: Data Structures","open","Studies data abstractions (e.g., stacks, queues, lists, trees) and their representation techniques (e.g., linking, arrays). Introduces concepts used in algorithm design and analysis including criteria for selecting data structures to fit their applications. Requisites: Requires prerequisite courses of CSCI 1300 or CSCI 1310 or CSCI 1320 or ECEN 1030 or ECEN 1310 and APPM 1345 or APPM 1350 or MATH 1300 or MATH 1310 (all minimum grade C-).",29,0,["lecture","MoWeFr 3:00PM - 3:50PM",16,0,"Rhonda Hoenigman","4"],["lecture","MoWeFr 3:00PM - 3:50PM",92,0,"Linda Jacobson","4"],["recitation","Tu 8:00AM - 9:15AM",1,0,"Camilla Lambrocco","4"],["recitation","Tu 9:30AM - 10:45AM",0,0,"Radhen Patel","4"],["recitation","Tu 11:00AM - 12:15PM",0,0,"Radhen Patel","4"],["recitation","Tu 12:30PM - 1:45PM",0,0,"Camilla Lambrocco","4"],["recitation","Tu 2:00PM - 3:15PM",2,0,"Sunil Baliganahalli Narayana Murthy","4"],["recitation","Tu 3:30PM - 4:45PM",0,0,"Sunil Baliganahalli Narayana Murthy","4"],["recitation","Tu 5:00PM - 6:15PM",3,0,"Avinash Ratnavel Maharaj Ratnavel","4"],["recitation","Th 8:00AM - 9:15AM",1,0,"Aayush Grover","4"],["recitation","Th 9:30AM - 10:45AM",1,0,"Aayush Grover","4"],["recitation","Th 11:00AM - 12:15PM",2,0,"Mridula Natrajan","4"],["recitation","Th 12:30PM - 1:45PM",0,0,"Yang Li","4"],["recitation","Th 2:00PM - 3:15PM",0,0,"Yang Li","4"],["recitation","Th 3:30PM - 4:45PM",1,0,"Chaitra Ramachandra","4"],["recitation","Th 5:00PM - 6:15PM",2,0,"Chaitra Ramachandra","4"],["recitation","Fr 11:00AM - 12:15PM",0,0,"Radhen Patel","4"],["recitation","Fr 12:30PM - 1:45PM",1,0,"Avinash Ratnavel Maharaj Ratnavel","4"],["recitation","Fr 11:00AM - 12:15PM",0,0,"Ishita Srivastava","4"],["recitation","Fr 12:30PM - 1:45PM",2,0,"Ishita Srivastava","4"],["recitation","Tu 8:00AM - 9:15AM",22,0,"Amber Womack","4"],["recitation","Th 8:00AM - 9:15AM",29,0,"Mridula Natrajan","4"],["recitation","Tu 2:00PM - 3:15PM",6,0,"Amber Womack","4"],["recitation","Th 2:00PM - 3:15PM",13,0,"Mridula Natrajan","4"]],
["CSCI 6402","Issues and Methods in Cognitive Science","waitlisted","Interdisciplinary introduction to cognitive science, examining ideas from cognitive psychology, philosophy, education, and linguistics via computational modeling and psychological experimentation. Includes philosophy of mind; learning; categorization; vision and mental imagery; consciousness; problem solving; decision making, and game-theory; language processing; connectionism. Department enforced prereqs., graduate standing or at least one course at the 3000-level or higher in Computer Science, Linguistics, Philosophy or Psychology. No background in Computer Science will be presumed. Same as EDUC 6504, LING 6200, PHIL 6310, and PSYC 6200. Requisites: Restricted to graduate students only.",0,0,["lecture","TuTh 11:00AM - 12:15PM",0,0,"Albert Kim","3"]],
["CSCI 4502","Data Mining","open","Introduces basic data mining concepts and techniques for discovering interesting patterns hidden in large-scale data sets, focusing on issues relating to effectiveness and efficiency. Topics covered include data preprocessing, data warehouse, association, classification, clustering, and mining specific data types such as time-series, social networks, multimedia, and Web data.  Same as CSCI 5502. Requisites: Requires prerequisite course of CSCI 2270 (minimum grade C-).",24,0,["lecture","MoWeFr 9:00AM - 9:50AM",24,0,"Elizabeth Boese","3"]],
["CSCI 3104","Algorithms","open","Covers advanced data structures, computational geometry, cryptography, dynamic programming, greedy algorithms, divide-and-conquer, graph algorithms (e.g., depth-first search), network algorithms (e.g., shortest paths), approximation algorithms. Requisites: Requires prerequisite courses of CSCI 2270 and APPM 1360 or MATH 2300 and one of the following:  CSCI 2824, ECEN 2703, APPM 3170 or MATH 2001 (all minimum grade C-).",1,0,["lecture","TuTh 12:30PM - 1:45PM",1,0,"Aaron Clauset","4"],["recitation","Fr 9:00AM - 9:50AM",0,0,"Nora Connor","4"],["recitation","Fr 10:00AM - 10:50AM",0,0,"Nehal Kamat","4"],["recitation","Fr 11:00AM - 11:50AM",0,0,"Ram Das Diwakaran","4"],["recitation","Fr 12:00PM - 12:50PM",1,0,"Ram Das Diwakaran","4"],["recitation","Fr 1:00PM - 1:50PM",0,0,"Nehal Kamat","4"],["recitation","Fr 2:00PM - 2:50PM",0,0,"Santhanakrishnan Ramani","4"],["recitation","Fr 3:00PM - 3:50PM",0,0,"Wanshan Yang","4"]],
["CSCI 3656","Numerical Computation","open","Covers development, computer implementation, and analysis of numerical methods for applied mathematical problems. Topics include floating point arithmetic, numerical solution of linear systems of equations, root finding, numerical interpolation,differentiation, and integration. Requisites: Requires prerequisite courses of CSCI 1300 or CSCI 1310 or CSCI 1320 and APPM 1350 or MATH 1300 and APPM 1360 or MATH 2300 and MATH 3130 or APPM 3310 or CSCI 2820 (all minimum grade C-).",2,0,["lecture","TuTh 2:00PM - 3:15PM",2,0,"Elizabeth Bradley","3"],["lecture","TBA",1,0,"Elizabeth Bradley","3"]],
["CSCI 5239","Advanced Computer Graphics","open","Studies design, analysis and implementation of advanced computer graphics techniques. Topics include shaders, using the GPU for high performance computing, graphics programming on embedded devices such as mobile phones; advanced graphics techniques such as ray tracing. Same as CSCI 4239. Requisites: Requires prerequisite course of CSCI 5229 (minimum grade B). Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.",28,0,["lecture","Th 5:00PM - 7:30PM",13,0,"Willem Schreuder","3"],["lecture","TBA",28,0,"Willem Schreuder","3"]],
["CSCI 5350","Entrepreneurial Projects II","open","None",14,0,["lecture","TuTh 2:00PM - 3:15PM",14,0,"Richard Han, ","3"]],
["CSCI 3753","Design and Analysis of Operating Systems","open","Analyzes the software that extends hardware to provide a computing environment, including he role of linkers, file systems, resource sharing, security and networking. Studies the history of operating system organization and design and their influence on security, functionality and reliability. Requisites: Requires prerequisite courses of CSCI 2270 and either CSCI 2400 or ECEN 3350 (all minimum grade C-).",6,0,["lecture","TuTh 2:00PM - 3:15PM",10,0,"Frank Miller","4"],["recitation","Fr 9:00AM - 9:50AM",6,0,"Max Hollingsworth","4"],["recitation","Fr 10:00AM - 10:50AM",2,0,"Brennan McConnell","4"],["recitation","Fr 11:00AM - 11:50AM",0,0,"Brennan McConnell","4"],["recitation","Fr 12:00PM - 12:50PM",1,0,"Max Hollingsworth","4"],["recitation","Fr 1:00PM - 1:50PM",1,0,"Chirag Kamat","4"]],
["CSCI 2400","Computer Systems","waitlisted","Covers how programs are represented and executed by modern computers, including low-level machine representations of programs and data, an understanding of how computer components and the memory hierarchy influence performance. Requisites: Requires prerequisite course of CSCI 2270 and a prereq or coreq course of CSCI 2824 or MATH 2001 or ECEN 2703 or APPM 3170 (minimum grade C-).",0,0,["lecture","TuTh 9:30AM - 10:45AM",0,0,"Richard Han","4"],["recitation","We 8:00AM - 8:50AM",0,0,"Rohit Gupta","4"],["recitation","We 9:00AM - 9:50AM",1,0,"Rohit Gupta","4"],["recitation","We 10:00AM - 10:50AM",0,0,"Yogesh Virkar","4"],["recitation","We 11:00AM - 11:50AM",0,0,"Yogesh Virkar","4"],["recitation","We 12:00PM - 12:50PM",1,0,"Zaid Al-Ali","4"],["recitation","We 1:00PM - 1:50PM",0,0,"Zaid Al-Ali","4"],["recitation","We 2:00PM - 2:50PM",1,0,"Alexandra Okeson","4"],["recitation","We 3:00PM - 3:50PM",0,0,"Alexandra Okeson","4"]],
["CSCI 4830","Special Topics in Computer Science","open","Covers topics of interest in computer science at the senior undergraduate level. Content varies from semester to semester.  May be repeated up to 9 total credit hours. Requisites: Requires prerequisite course of CSCI 2400 (minimum grade C-).",58,0,["lecture","MoWe 4:30PM - 5:45PM",3,0,"Shaun Kane","3"],["lecture","TuTh 2:00PM - 3:15PM",0,0,"Eric Wustrow","3"],["lecture","MoWe 2:00PM - 3:20PM",0,0,"Mark Gross","3"],["lecture","TuTh 3:30PM - 4:45PM",0,0,"Ryan Shapiro","3"],["lecture","MoWe 4:00PM - 5:15PM",2,0,"Ned Mc Clain","3"],["lecture","TuTh 5:00PM - 6:15PM",2,0,"Pavol Cerny","3"],["lecture","MoWeFr 9:30AM - 10:20AM",0,0,"Robin Dowell-Deen","3"],["lecture","TuTh 3:30PM - 4:45PM",0,0,"Elianna James","3"],["lecture","Tu 5:00PM - 6:15PM",58,0,"Rafael Frongillo","1"],["lecture","MoWe 3:00PM - 4:15PM",1,0,"Jedediah Kallen-Brown","3"],["lecture","MoWe 5:45PM - 7:00PM",4,0,"Christian Ketelsen","3"]],
["CSCI 1200","The Art of Computational Thinking and Computer Programming","open","None",14,0,["lecture","MoWeFr 1:00PM - 1:50PM",14,0,"Ioana Fleming","3"]],
["CSCI 1320","Computer Science 1: Starting Computing-Engineering Applications","open","Intended for students with no prior experience in programming. Class outcomes and goals are identical to CSCI 1300, but uses problems and tools from Engineering. Teaching techniques for writing computer programs in higher level programming languages to solve problems of interest in Engineering and other domains. Credit not granted for this course and CSCI 1300 or CSCI 1310 or ECEN 1310. Requisites: Requires a prerequisite or corequisite course of MATH 1300 or MATH 1310 or APPM 1345 or APPM 1350 (all minimum grade C-). Restricted to College of Engineering or Computer Science (CSEN) or Pre-Engineering Arts and Science (PREN) majors only.",5,0,["lecture","MoWeFr 8:00AM - 8:50AM",10,0,"Ioana Fleming","4"],["recitation","Tu 11:00AM - 11:50AM",0,0,"Kelsey Pool","4"],["recitation","Tu 12:00PM - 12:50PM",0,0,"Sebastian Laudenschlager","4"],["recitation","Tu 3:00PM - 3:50PM",0,0,"Sachin Muralidhara","4"],["recitation","Tu 4:00PM - 4:50PM",0,0,"Sachin Muralidhara","4"],["recitation","We 3:00PM - 3:50PM",0,0,"Ankita Singh","4"],["recitation","We 4:00PM - 4:50PM",5,0,"Julian Lambert","4"],["recitation","Th 9:00AM - 9:50AM",3,0,"Varsha Srikanth Koushik","4"],["recitation","Th 10:00AM - 10:50AM",0,0,"Varsha Srikanth Koushik","4"],["recitation","Th 11:00AM - 11:50AM",0,0,"David Molitor","4"],["recitation","Th 12:00PM - 12:50PM",0,0,"Sebastian Laudenschlager","4"],["recitation","Th 1:00PM - 1:50PM",2,0,"Ankita Singh","4"]],
["CSCI 5622","Machine Learning","open","Trains students to build computer systems that learn from experience. Includes the three main subfields: supervised learning, reinforcement learning and unsupervised learning. Emphasizes practical and theoretical understanding of the most widely used algorithms (neural networks, decision trees, support vector machines, Q-learning). Covers connections to data mining and statistical modeling. A strong foundation in probability, statistics, multivariate calculus, and linear algebra is highly recommended. Requisites: Requires prerequisite courses of CSCI 2400 and CSCI 3104 (all minimum grade C). Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.",13,0,["lecture","MoWe 5:45PM - 7:00PM",4,0,"Christian Ketelsen","3"],["lecture","TBA",13,0,"Christian Ketelsen","3"]],
["CSCI 1300","Computer Science 1: Starting Computing","open","Teaches techniques for writing computer programs in higher level programming languages to solve problems of interest in a range of application domains. This class is intended for students with little to no experience in computing or programming. Credit not granted for this class and CSCI 1310 or CSCI 1320 or ECEN 1310. Requisites: Requires a prerequisite or corequisite course of MATH 1300 or MATH 1310 or APPM 1345 or APPM 1350 (all minimum grade C-).",1,0,["lecture","MoWeFr 1:00PM - 1:50PM",1,0,"David Knox","4"],["recitation","Mo 2:00PM - 2:50PM",2,0,"Jason Zietz","4"],["recitation","Tu 9:00AM - 9:50AM",2,0,"Karthik Kannan","4"],["recitation","Tu 10:00AM - 10:50AM",0,0,"Michael Iuzzolino","4"],["recitation","Tu 1:00PM - 1:50PM",0,0,"Jason Zietz","4"],["recitation","Tu 2:00PM - 2:50PM",0,0,"Monika Tak","4"],["recitation","Tu 3:00PM - 3:50PM",0,0,"Vipra Gupta","4"],["recitation","Tu 4:00PM - 4:50PM",1,0,"Vipra Gupta","4"],["recitation","We 9:00AM - 9:50AM",0,0,"Erik Holbrook","4"],["recitation","We 10:00AM - 10:50AM",1,0,"Erik Holbrook","4"],["recitation","We 2:00PM - 2:50PM",0,0,"Monika Tak","4"],["recitation","Th 9:00AM - 9:50AM",0,0,"Nicholas Farrow","4"],["recitation","Th 10:00AM - 10:50AM",0,0,"Nicholas Farrow","4"],["recitation","Th 11:00AM - 11:50AM",1,0,"Karthik Kannan","4"]],
["CSCI 4113","Unix System Administration","open","Introduces UNIX (Linux) system administration and related topics, including trouble-shooting system and network problems, hardware and software configuration and installation, basic scripting, and security aspects of Internet hosts. Students build a Linux server from the ground up, using provided computing resources, and must maintain and secure the server themselves.  Recommended prereq., CSCI 3308. Requisites: Requires prerequisite course of CSCI 2400 (minimum grade C-).",13,0,["lecture","Th 5:00PM - 7:30PM",13,0,"Willem Schreuder","3"]],
["CSCI 5448","Object-Oriented Analysis and Design","open","An applied analysis and design class addressing the use of object-oriented techniques. Topics include domain modeling, use cases, architectural design, and modeling notations. Students apply the techniques in analysis and design projects.  Same as CSCI 4448. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.",7,0,["lecture","MoWeFr 11:00AM - 11:50AM",7,0,"Elizabeth Boese","3"],["lecture","TBA",3,0,"Elizabeth Boese","3"]],
["CSCI 4593","Computer Organization","open","Studies computer design at the gate level. Discusses instruction set architecture design, arithmetic and logic unit design, control logic, memory design and caches, simple pipelining,  I/O, and peripheral devices. Briefly covers aspects of modern computer architecture, such as multicore processors and cache coherence for these. Same as ECEN 4593. Requisites: Requires prerequisite course of ECEN 3350 or CSCI 2400 (minimum grade C-).  Restricted to College of Engineering majors only.",1,0,["lecture","MoWeFr 12:00PM - 12:50PM",1,0,"Keith Graham","3"]],
["CSCI 4318","Software Engineering Project 2","waitlisted","Second semester of an advanced practicum in computer science. Students must take CSCI 4308 and 4318 contiguously as the project spans the entire academic year. Requisites: Requires prerequisite course of CSCI 4308 (minimum grade C-).",0,0,["lecture","MoWe 5:30PM - 6:45PM",0,0,"Richard Parker","4"],["recitation","Tu 5:30PM - 6:45PM",0,0,"Richard Parker","4"]],
["CSCI 3308","SoftwareDevelopment Methods and Tools","waitlisted","Covers tools and practices for software development with a strong focus on best practices used in industry and professional development, such as agile methodologies, pair-programming and test-driven design. Students develop web services and applications while learning these methods and tools. Requisites: Requires prerequisite course of CSCI 2270 (minimum grade C-).",0,0,["lecture","MoFr 11:00AM - 11:50AM",0,0,"David Graham","3"],["lecture","Tu 5:00PM - 6:40PM",0,0,"Alan Paradise","3"],["lab","Tu 6:30PM - 8:20PM",0,0,"Saish Redkar","3"],["lab","We 4:00PM - 5:50PM",0,0,"Rashmi Shetty","3"],["lab","We 6:00PM - 7:50PM",0,0,"Yawen Zhang","3"],["lab","Th 2:00PM - 3:50PM",0,0,"Saish Redkar","3"],["lab","Th 4:00PM - 5:50PM",0,0,"Rashmi Shetty","3"],["lab","Th 6:30PM - 8:20PM",1,0,"Yawen Zhang","3"],["lab","Fr 9:00AM - 10:50AM",1,0,"Saish Redkar","3"],["lab","Fr 9:00AM - 10:50AM",0,0,"Yogitha Mahadasu","3"],["lab","Th 4:00PM - 5:50PM",0,0,"Yogitha Mahadasu","3"],["lab","Th 6:00PM - 7:50PM",0,0,"Yogitha Mahadasu","3"]],
["CSCI 3155","Principles of Programming Languages","waitlisted","Study fundamental concepts on which programming of languages are based, and execution models supporting them. Topics include values, variables, bindings, type systems, control structures, exceptions, concurrency, and modularity. Learn how to select a language and to adapt to a new language. Requisites: Requires prerequisite courses of CSCI 2270 and CSCI 2824 or ECEN 2703 or APPM 3170 or MATH 2001 (all minimum grade C-).",0,0,["lecture","TuTh 11:00AM - 12:15PM",0,0,"Thomas Nelson","4"],["recitation","We 9:00AM - 9:50AM",0,0,"Athithyaa Panchapakesan Rajeswari","4"],["recitation","Tu 3:00PM - 3:50PM",0,0,"Austin Holler","4"],["recitation","We 11:00AM - 11:50AM",0,0,"Athithyaa Panchapakesan Rajeswari","4"],["recitation","We 3:00PM - 3:50PM",0,0,"Christina Nguyen","4"],["recitation","We 4:00PM - 4:50PM",0,0,"Austin Holler, ","4"]],
["CSCI 7135","Topics in Programming Languages","open","Topics selected by instructor. Possible topics are syntax, semantics, metacompilers, compiler design, and translator writing systems. Department consent required. Requisites: Restricted to graduate students only.",9,0,["lecture","Tu 1:00PM - 3:30PM",9,0,"Bor Chang","3"]],
["CSCI 5444","Introduction to Theory of Computation","open","Reviews regular expressions and finite automata. Studies Turing machines and equivalent models of computation, the Chomsky hierarchy, context-free grammars, push-down automata, and computability. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.",51,0,["lecture","TuTh 11:00AM - 12:15PM",51,0,"Ashutosh Trivedi","3"],["lecture","TBA",26,0,"Ashutosh Trivedi","3"]],
["CSCI 5446","Chaotic Dynamics","waitlisted","Explores chaotic dynamics theoretically and through computer simulations. Covers the standard computational and analytical tools used in nonlinear dynamics and concludes with an overview of leading-edge chaos research. Topics include time and phase-space dynamics, surfaces of section, bifurcation diagrams, fractal dimension, and Lyapunov exponents. Same as CSCI 4446 and ECEN 5423. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.",0,0,["lecture","TuTh 9:30AM - 10:45AM",0,0,"Elizabeth Bradley","3"]],
["CSCI 4314","Algorithms for Molecular Biology","open","Surveys molecular biology and combinatorial algorithms used to understand DNA, RNA, and proteins. Students work in groups to define and tackle meaningful biological problems and learn to collaborate effectively with scientists in other disciplines. Recommended prereq., comfort with mathematics and/or programming experience, and more advanced understanding (upper undergraduate level) of any relevant discipline. Same as CSCI 5314, MCDB 4314 and MCDB 5314. Requisites: Requires a prerequisite course of CSCI 3104 (minimum grade C-).",3,0,["lecture","MoWe 4:00PM - 5:15PM",3,0,"David Knox","3"]],
["CSCI 4446","Chaotic Dynamics","waitlisted","Explores chaotic dynamics theoretically and through computer simulations. Covers the standard computational and analytical tools used in nonlinear dynamics and concludes with an overview of leading-edge chaos research. Topics include time and phase-space dynamics, surfaces of section, bifurcation diagrams, fractal dimension, and Lyapunov exponents.  Recommended prereqs., PHYS 1120, CSCI 3656, and MATH 3130. Same as CSCI 5446 and ECEN 4423. Requisites: Requires prerequisite course of CSCI 1300 or CSCI 1310 or CSCI 1320 and APPM 2350 or MATH 2400 (all minimum grade C-).",0,0,["lecture","TuTh 9:30AM - 10:45AM",0,0,"Elizabeth Bradley","3"]],
["CSCI 4358","Entrepreneurial Projects II","open","None",8,0,["lecture","TuTh 2:00PM - 3:15PM",8,0,"Richard Han, ","4"],["recitation","We 5:00PM - 5:50PM",8,0,"Richard Han, ","4"]],
["CSCI 5302","Advanced Robotics","open","Exposes students to current research topics in the field of robotics and provides hands-on experience in solving a grand challenge program.  Recommended prereq., CSCI 3302 or instructor consent required. Same as CSCI 4302. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.",1,0,["lecture","TuTh 8:00AM - 9:15AM",1,0,"Christoffer Heckman","3"]],
["CSCI 4250","Computer Science: the Canon","waitlisted","Explores the \"great works\" of computer science through intensive reading and discussion. Readings include works by Babbage, Turing, Von Neumann, Goedel, Shannon and Minsky, among others. Same as CSCI 5250. Requisites: Restricted to students with 57-180 credits (Juniors or Seniors).",0,0,["seminar","We 5:00PM - 7:30PM",0,0,"Michael Eisenberg","3"]],
["CSCI 3287","Design and Analysis of Data Systems","open","Analyzes design of data systems, including data stored in file systems, database management systems and physical data organizations. Studies calculus of data models, query languages, concurrency and data privacy and security. Requisites: Requires prerequisite course of CSCI 3104 (minimum grade C-).",1,0,["lecture","TuTh 9:30AM - 10:45AM",1,0,"Frank Miller","3"]],
["CSCI 5673","Distributed Systems","open","Examines systems that span multiple autonomous computers. Topics include system structuring techniques, scalability, heterogeneity, fault tolerance, load sharing, distributed file and information systems, naming, directory services, resource discovery, resource and network management, security, privacy, ethics, and social issues. Recommended prereqs., CSCI 5573 or a course in computer networks. Same as ECEN 5673. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.",22,0,["lecture","TuTh 12:30PM - 1:45PM",22,0,"Shivakant Mishra","3"],["lecture","TBA",18,0,"Shivakant Mishra","3"]],
["CSCI 4448","Object-Oriented Analysis and Design","open","An applied analysis and design class addressing the use of object-oriented techniques. Topics include domain modeling, use cases, architectural design, and modeling notations. Students apply the techniques in analysis and design projects.  Same as CSCI 5448. Requisites: Requires prerequisite courses of CSCI 3155 and CSCI 3308 (all minimum grade C-).",5,0,["lecture","MoWeFr 11:00AM - 11:50AM",1,0,"Elizabeth Boese","3"],["lecture","TBA",5,0,"Elizabeth Boese","3"]],
["CSCI 5314","Algorithms for Molecular Biology","open","Surveys molecular biology and combinatorial algorithms used to understand DNA, RNA, and proteins. Students work in groups to define and tackle meaningful biological problems and learn to collaborate effectively with scientists in other disciplines. Same as CSCI 4314 and MCDB 5314. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.",4,0,["lecture","MoWe 4:00PM - 5:15PM",4,0,"David Knox","3"]],
["CSCI 5832","Natural Language Processing","open","Explores the field of natural language processing as it is concerned with the theoretical and practical issues that arise in getting computers to perform useful and interesting tasks with natural language. Covers the problems of understanding complex language phenomena and building practical programs. Same as LING 5832. Requisites: Restricted to Computer Science (CSEN) graduate students or Computer Science Concurrent Degree majors only.",4,0,["lecture","MoWeFr 9:00AM - 9:50AM",4,0,"Susan Brown","3"]],
["CSCI 4809","Computer Animation","waitlisted","Develops a firm understanding of the general principles of computer animation. Lectures cover the creation of models, materials, textures, surfaces, and lighting. Path and key frame animation, particle dynamics, and rendering are introduced. Students are assigned a number of animation tutorials to carry out. Same as CSCI 5809 and ATLS 4809/5809.",0,0,["lecture","WeFr 5:30PM - 6:45PM",0,0,"Roger King","3"]],
["CSCI 1310","Computer Science 1: Starting Computing - Experienced","open","Intended for students with some prior experience in programming and basic knowledge of variables, conditionals, and loops. Teaches techniques for writing computer programs in higher level programming languages to solve problems of interest in a range of application domains. Credit not granted for this course and CSCI 1300  or CSCI 1320 or ECEN 1310. Requisites: Requires a prerequisite or corequisite course of MATH 1300 or MATH 1310 or APPM 1345 or APPM 1350 (all minimum grade C-).",2,0,["lecture","MoWeFr 8:00AM - 8:50AM",2,0,"Shirly Montero Quesada","4"],["recitation","Tu 11:00AM - 11:50AM",2,0,"Ranganathan Chidambaranathan","4"],["recitation","We 11:00AM - 11:50AM",0,0,"Ranganathan Chidambaranathan","4"]],
["CSCI 7000","Current Topics in Computer Science","open","Covers research topics of current interest in computer science that do not fall into a standard subarea. May be repeated up to 8 total credit hours. Requisites: Restricted to graduate students only.",58,0,["lecture","MoWe 4:30PM - 5:45PM",17,0,"Shaun Kane","3"],["lecture","MoWe 4:00PM - 5:15PM",9,0,"Rafael Frongillo","3"],["lecture","MoWe 3:00PM - 4:15PM",10,0,"Jedediah Kallen-Brown","3"],["lecture","TBA",30,0,"Jedediah Kallen-Brown","3"],["lecture","MoWeFr 10:00AM - 10:50AM",9,0,"Matthew Hammer","3"],["lecture","MoWe 2:00PM - 3:20PM",5,0,"Mark Gross","3"],["lecture","MoWe 1:00PM - 2:15PM",10,0,"Daniel Szafir","3"],["lecture","We 6:15PM - 8:45PM",37,0,"Thomas Hauser","3"],["lecture","TBA",27,0,"Thomas Hauser","3"],["lecture","Tu 3:30PM - 4:30PM",12,0,"Rafael Frongillo, ","1"],["lecture","TuTh 2:00PM - 3:15PM",4,0,"Eric Wustrow","3"],["lecture","TuTh 3:30PM - 4:45PM",0,0,"Ryan Shapiro","3"],["lecture","Mo 6:00PM - 8:30PM",10,0,"Jordan Ying","3"],["lecture","MoWe 4:00PM - 5:15PM",2,0,"Ned Mc Clain","3"],["lecture","MoWeFr 9:30AM - 10:20AM",0,0,"Robin Dowell-Deen","3"],["lecture","TuTh 2:00PM - 3:15PM",27,0,"Martha Palmer","3"],["lecture","TBA",30,0,"Martha Palmer","3"],["lecture","Tu 5:00PM - 6:15PM",58,0,"Rafael Frongillo","1"]],
["LING 6200","Issues and Methods in Cognitive Science","waitlisted","Interdisciplinary introduction to cognitive science, examining ideas from cognitive psychology, philosophy, education, and linguistics via computational modeling and psychological experimentation. Includes philosophy of mind; learning; categorization; vision and mental imagery; consciousness; problem solving; decision making, and game-theory; language processing; connectionism.  No background in computer science will be presumed. Department enforced prereq., at least one course at the 3000-level or higher in CSCI, LING, PHIL, or PSYC. Same as CSCI 6402, EDUC 6504, PHIL 6310, and PSYC 6200. Requisites: Restricted to graduate students only.",0,0,["lecture","TuTh 11:00AM - 12:15PM",0,0,"Albert Kim","3"]],
["LING 1000","Language in U.S. Society","open","Nontechnical exploration of the ways that language is used in America. Emphasizes language as a social institution and how values and goals of both public institutions and private groups shape and are shaped by language and its use. Meets MAPS requirement for social science: general. Approved for arts and sciences core curriculum: United States context or contemporary societies.",1,0,["lecture","MoWe 11:00AM - 11:50AM",0,0,"Chase Raymond","3"],["lecture","MoWe 3:00PM - 3:50PM",1,0,"Marcus Avelar","3"],["recitation","Fr 8:00AM - 8:50AM",0,0,"Ayden Parish","3"],["recitation","Fr 3:00PM - 3:50PM",0,0,"Norielle Adricula","3"],["recitation","Fr 4:00PM - 4:50PM",0,0,"Norielle Adricula","3"],["recitation","Fr 9:00AM - 9:50AM",0,0,"Ayden Parish","3"],["recitation","Fr 9:00AM - 9:50AM",1,0,"Jessica Holman","3"],["recitation","Fr 1:00PM - 1:50PM",0,0,"Irina Wagner","3"],["recitation","Fr 3:00PM - 3:50PM",0,0,"Irina Wagner","3"]],
["LING 4560","Language Development","waitlisted","Emphasizes acquisition of language by young children; development in later years and into adulthood is also treated. Particular attention given to roles of environment and of neurophysiological endowment in learning to communicate with words, sentences, and narratives. Department enforced prereqs., LING 2000 and PSYC 1001. Same as SLHS 4560 and PSYC 4560. Requisites: Restricted to Linguistics (LING) majors only.",0,0,["lecture","MoWeFr 10:00AM - 10:50AM",0,0,"Karin Boerger","3"]],
["LING 5832","Natural Language Processing","open","Explores the field of natural language processing as it is concerned with the theoretical and practical issues that arise in getting computers to perform useful and interesting tasks with natural language. Covers the problems of understanding complex language phenomena and building practical programs. Same as CSCI 5832. Requisites: Restricted to graduate students only.",13,0,["lecture","MoWeFr 9:00AM - 9:50AM",13,0,"Susan Brown","3"]],
["LING 2000","Introduction to Linguistics","open","Introduces the study of languages as structural systems. Principles of sound patterns, word formation, meaning, and sentence structure. Gives attention to language acquisition, psycholinguistics, language families, dialects, historical change in languages, and different language types. Meets MAPS requirement for social science: general.",17,0,["lecture","MoWe 12:00PM - 12:50PM",30,0,"Bhuvaneswari Narasimhan","3"],["recitation","Fr 8:00AM - 8:50AM",9,0,"Marielle Butters","3"],["recitation","Fr 9:00AM - 9:50AM",6,0,"Marielle Butters","3"],["recitation","Fr 3:00PM - 3:50PM",3,0,"Timothy O'Gorman","3"],["recitation","Fr 4:00PM - 4:50PM",17,0,"Timothy O'Gorman","3"]],
["LING 6320","Linguistic Anthropology","waitlisted","Serves as an advanced introduction to the empirical and theoretical foundations of contemporary linguistic anthropology, with special emphasis on the ways in which culture and society emerge semiotically through language and discourse. Same as ANTH 6320. Requisites: Restricted to graduate students only.",0,0,["seminar","We 11:30AM - 2:00PM",0,0,"Kira Hall","3"]],
["LING 1900","Service Learning Practicum: Adult Literacy","open","Practicum for selected students in LING 1000. Provides practical experience of the impact of illiteracy on individuals, families, and the community at large. Coregistration in service learning recitation is required. Department enforced coreq., LING 1000.",15,0,["pra","Fr 10:00AM - 10:50AM",15,0,"Olivia Hirschey","3"]],
["LING 4610","English Structure for Teachers of English to Speakers of Other Languages","open","Description of morphological and syntactic categories and structures of English. Department enforced prereq., LING 2000.  Same as LING 5610.",10,0,["lecture","TuTh 9:30AM - 10:45AM",10,0,"Maria Thomas-Ruzic","3"]],
["LING 3430","Semantics","open","Theoretical and practical study of meaning in natural language. Considers both semantic theories and semantic phenomena from diverse languages. Does not treat techniques for improving the use of language.  Department enforced prereq., LING 2000. Requisites: Restricted to students with 57-180 credits (Junior or Senior) Linguistics (LING) majors only.",1,0,["lecture","TuTh 11:00AM - 12:15PM",1,0,"Barbara Fox","3"]],
["LING 3800","Special Topics in Linguistics","open","Intensive study of a selected area or problem in linguistics. May be repeated up to 9 total credit hours.",6,0,["lecture","MoWeFr 10:00AM - 10:50AM",6,0,"Samuel Beer","3"]],
["LING 3100","Language Sound Structures","open","Introduces the sounds of languages and their organization into phonological structures. Department enforced prereq., LING 2000.",5,0,["lecture","MoWe 11:00AM - 11:50AM",6,0,"Lingshuang Mao","3"],["recitation","Fr 12:00PM - 12:50PM",0,0,"Jonnia Torres","3"],["recitation","Fr 1:00PM - 1:50PM",1,0,"Ling Liu","3"],["recitation","Fr 3:00PM - 3:50PM",5,0,"Ling Liu","3"],["recitation","Fr 9:00AM - 9:50AM",0,0,"Jonnia Torres","3"]],
["LING 4100","Perspectives on Language","open","Provides extended critical examination of a few selected issues, chosen each term for their general interest and relevance, e.g., the relation between language and thought, or human language vs. animal languages, and computer languages.  May be repeated up to 6 total credit hours, provided topics vary.  Department enforced prereq.,  LING 2000. Requisites: Restricted to students with 57-180 credits (Juniors or Seniors).",13,0,["lecture","TuTh 2:00PM - 3:15PM",13,0,"Zygmunt Frajzyngier","3"]],
["LING 6500","Issues in Indigenous Languages","open","Addresses socio-cultural issues concerning indigenous languages, including human rights, intellectual property, language endangerment and maintenance, identity, linguistic relativity, sense of place. Same as ANTH 6500.",16,0,["seminar","TuTh 12:30PM - 1:45PM",16,0,"James Cowell","3"]],
["LING 1010","The Study of Words","open","Study of English words of Latin and Greek origin, focusing on etymological meaning by analysis of component parts (prefixes, bases, suffixes) and on the ways in which words have changed and developed semantically. Same as CLAS 1010.",2,0,["lecture","MoWe 1:00PM - 1:50PM",2,0,"Laura Michaelis-Cummings","3"],["recitation","Fr 3:00PM - 3:50PM",2,0,"Mary Kosse","3"],["recitation","Fr 1:00PM - 1:50PM",0,0,"Mary Kosse","3"]],
["LING 5800","Open Topics in Linguistics","open","Various topics not normally covered in the curriculum.  Offered intermittently depending on student demand and availability of instructors.  Contact the department office for information.  May be repeated up to 9 credit hours. Requisites: Restricted to graduate students only.",13,0,["seminar","TuTh 2:00PM - 3:15PM",13,0,"Zygmunt Frajzyngier","3"]],
["LING 4420","Morphology and Syntax","open","Introduces principles of word formation and sentence structure. Covers major morphological and syntactic structures found in the world's languages, and methods for describing grammatical structures, and includes practice in analyzing data from a variety of languages. Department enforced prereq., LING 2000. Same as LING 5420.",16,0,["lecture","TuTh 12:30PM - 1:45PM",16,0,"Jesus Villalpando","3"]],
["LING 6940","Master's Degree Candidate","waitlisted","None",0,0,["pra","TBA",0,0,"Staff","2"]],
["LING 5900","Independent Study","open","May be repeated up to 7 total credit hours.",7,0,["pra","We 4:00PM - 6:00PM",7,0,"Maria Thomas-Ruzic","1 - 3"]],
["LING 4830","Honors Thesis","open","Required for students who elect departmental honors. Students write an honors thesis based on independent research under the direction of a faculty member. May be repeated up to 7 total credit hours.",10,0,["lecture","TuTh 3:30PM - 4:45PM",10,0,"Rebecca Scarborough","3"]],
["LING 5430","Semantics and Pragmatics","open","Explores fundamental concepts of semantics and pragmatics, including theories of communication and meaning, representation, conversational implications, speech acts, and discourse structure. Department enforced prereq., LING 5420.",8,0,["lecture","TuTh 2:00PM - 3:15PM",8,0,"Barbara Fox","3"]],
["LING 3545","World Language Policies","waitlisted","Examines the economic and sociopolitical impact of choosing English vs. other languages in the U.S. Introduces the study of language policies, rights, and planning in other countries, including the worldwide use of English in social, business, and legal contexts.",0,0,["lecture","MoWeFr 12:00PM - 12:50PM",0,0,"Velda Khoo Yuan Ling","3"]],
["LING 7800","Open Topics in Linguistics","open","Various topics not normally covered in the curriculum; offered intermittently depending on student demand and availability of instructors. Contact the department office for information. Requisites: Restricted to graduate students only.",35,0,["seminar","TuTh 2:00PM - 3:15PM",18,0,"Martha Palmer","3"],["seminar","TuTh 11:00AM - 12:15PM",17,0,"Bhuvaneswari Narasimhan","3"],["seminar","MoWe 4:00PM - 5:30PM",35,0,"Staff","3"]],
["LING 5610","English Structure for Teachers of English to Speakers of Other Languages","open","Description of morphological and syntactic categories and structures of English. Same as LING 4610. Requisites: Restricted to graduate students only.",10,0,["lecture","TuTh 9:30AM - 10:45AM",10,0,"Maria Thomas-Ruzic","3"]],
["LING 1020","Languages of the World","open","Explores the issue of human diversity by examining how languages vary around the world.  Outlines historical, geographic, and typological classifications of languages across human societies, and the criteria used by linguists for grouping them into language families.  Theorizes the relationship between linguistic and cognitive diversity, and considers the impact of language death on humanity.  No formal training in linguistics is required. Approved for arts and sciences core curriculum: human diversity.",2,0,["lecture","MoWe 9:00AM - 9:50AM",2,0,"Jared Desjardins","3"],["lecture","MoWe 2:00PM - 2:50PM",1,0,"Stefanie Ramos Bierge","3"],["recitation","Fr 8:00AM - 8:50AM",1,0,"Ghazaleh Kazeminejad","3"],["recitation","Fr 3:00PM - 3:50PM",1,0,"Ghazaleh Kazeminejad","3"],["recitation","Fr 3:00PM - 3:50PM",0,0,"Luciana Marques","3"],["recitation","Fr 8:00AM - 8:50AM",3,0,"Sarah Moeller","3"],["recitation","Fr 3:00PM - 3:50PM",0,0,"Tao Lin","3"],["recitation","Fr 4:00PM - 4:50PM",0,0,"Tao Lin","3"],["recitation","Fr 3:00PM - 3:50PM",1,0,"Sarah Moeller","3"]],
["LING 7430","Semantic Theory","open","Current developments in the theory of linguistic semantics. Topics include truth-conditional theories, generative linguistic theories, semantic theories of communicative competence, and integration of these theories in development of a combined theory of semantics and pragmatics. Department enforced prereq., LING 5430.",18,0,["lecture","TuTh 9:30AM - 10:45AM",18,0,"Zygmunt Frajzyngier","3"]],
["MATH 3135","Honors Introduction to Linear Algebra","open","Examines basic properties of systems of linear equations, vector spaces, inner products, linear independence, dimension, linear transformations, matrices, determinants, eigenvalues, eigenvectors and diagonalization. Credit not granted for this course and MATH 3130 or APPM 3130. Requisites: Requires a prerequisite course of MATH 2300 or APPM 1360 and MATH 2001 (all minimum grade C-).",2,0,["lecture","MoWeFr 10:00AM - 10:50AM",2,0,"Jonathan Wise","3"]],
["MATH 4520","Introduction to Mathematical Statistics","open","Examines point and confidence interval estimation. Principles of maximum likelihood, sufficiency, and completeness: tests of simple and composite hypotheses, linear models, and multiple regression analysis if time permits. Analyzes various distribution-free methods. Same as MATH 5520 and APPM 4520. Requisites: Requires prerequisite course of MATH 4510 or APPM 3570 (minimum grade C-).",4,0,["lecture","MoWeFr 3:00PM - 3:50PM",4,0,"Sergei Kuznetsov","3"]],
["MATH 1120","Mathematics for Elementary Educators 2","open","Topics include geometry, measurement, probability, and statistics. Department enforced restriction: restricted to prospective elementary teachers. The combination MATH 1110 and 1120 is approved for arts and sciences core curriculum: quantitative reasoning and mathematical skills. Requisites: Requires prerequisite course of MATH 1110 (minimum grade C-).",8,0,["lecture","MoWeFr 1:00PM - 1:50PM",8,0,"Elizabeth Grulke","3"]],
["MATH 4540","Introduction to Time Series","open","Studies basic properties, trend-based models, seasonal models, modeling and forecasting with ARIMA models, spectral analysis and frequency filtration. Same as MATH 5540 and APPM 4540. Requisites: Requires prerequisite course of MATH 4520 or APPM 4520 (minimum grade C-).",1,0,["lecture","MoWeFr 10:00AM - 10:50AM",1,0,"Sergei Kuznetsov","3"]],
["MATH 3430","Ordinary Differential Equations","open","Involves an elementary systematic introduction to first-order scalar differential equations, nth order linear differential equations, and n-dimensional linear systems of first-order differential equations. Additional topics are chosen from equations with regular singular points, Laplace transforms, phase plane techniques, basic existence and uniqueness, and numerical solutions. Requisites: Requires prerequisite courses of MATH 2400 or APPM 2350 and MATH 3130 or MATH 3135 or APPM 3310 (all minimum grade C-).",1,0,["lecture","MoWeFr 9:00AM - 9:50AM",1,0,"Judith Jesudason","3"],["lecture","MoWeFr 1:00PM - 1:50PM",0,0,"Jeffrey Fox","3"]],
["MATH 5820","History of Mathematical Ideas","waitlisted","None",0,0,["seminar","MoWeFr 11:00AM - 11:50AM",0,0,"Jeffrey Fox","3"]],
["MATH 3510","Introduction to Probability and Statistics","waitlisted","Introduces the basic notions of Probability: random variables, expectation, conditioning, and the standard distributions (Binomial, Poisson, Exponential, Normal). This course also covers the Law of Large Numbers and Central Limit Theorem as they apply to statistical questions: sampling from a random distribution, estimation, and hypothesis testing. Credit not granted for this course and MATH 2510 or MATH 4510. Requisites: Requires prerequisite courses of MATH 2001 and MATH 2300 or APPM 1360 (all minimum grade C-).",0,0,["lecture","MoWeFr 9:00AM - 9:50AM",0,0,"Philip Kopel","3"]],
["MATH 4330","Fourier Analysis","open","The notion of Fourier analysis, via series and integrals, of periodic and nonperiodic phenomena is central to many areas of mathematics. Develops the Fourier theory in depth, and considers such special topics and applications as wavelets, Fast Fourier Transforms, seismology, digital signal processing, differential equations, and Fourier optics. Same as MATH 5330. Requisites: Requires prerequisite course of MATH 3001 (minimum grade C-).",6,0,["lecture","MoWeFr 1:00PM - 1:50PM",6,0,"Martin Walter","3"]],
["MATH 4120","Introduction to Operations Research","waitlisted","Studies linear and nonlinear programming, the simplex method, duality, sensitivity, transportation, and network flow problems, some constrained and unconstrained optimization theory, and the Kuhn-Tucker conditions, as time permits. Same as MATH 5120 and APPM 4120. Requisites: Requires prerequisite course of MATH 3130 or MATH 3135 or APPM 3310 (minimum grade C-).",0,0,["lecture","MoWeFr 11:00AM - 11:50AM",0,0,"Yu-Jui Huang","3"]],
["MATH 3450","Introduction to Complex Variables","open","None",13,0,["lecture","MoWeFr 2:00PM - 2:50PM",13,0,"Su-Ion Ih","3"]],
["MATH 4140","Abstract Algebra 2","open","Explores some topic that builds on material in MATH 3140. Possible topics include (but are not limited to) Galois theory, representation theory, advanced linear algebra or commutative algebra. Same as MATH 5140. Requisites: Requires prerequisite course of MATH 3140 (minimum grade C-).",5,0,["lecture","MoWeFr 9:00AM - 9:50AM",5,0,"Sebastian Casalaina-Martin","3"]],
["MATH 5520","Introduction to Mathematical Statistics","open","None",1,0,["lecture","MoWeFr 3:00PM - 3:50PM",1,0,"Sergei Kuznetsov","3"]],
["MATH 6140","Algebra 2","open","Studies modules, fields, and Galois theory. Department enforced prereq., MATH 6130. Instructor consent required for undergraduates. Requisites: Restricted to graduate students only.",10,0,["lecture","MoWeFr 3:00PM - 3:50PM",10,0,"Peter Mayr","3"]],
["MATH 5610","Numerical Analysis 2","waitlisted","None",0,0,["lecture","MoWe 3:00PM - 4:15PM",0,0,"Gregory Beylkin","3"]],
["MATH 5140","Abstract Algebra 2","open","None",4,0,["lecture","MoWeFr 9:00AM - 9:50AM",4,0,"Sebastian Casalaina-Martin","3"]],
["MATH 6250","Theory of Rings","open","Studies semi-simple Artinian rings, the Jacobson radical, group rings, representations of finite groups, central simple algebras, division rings and the Brauer group. Department enforced prereqs., MATH 6130 and MATH 6140. Instructor consent required for undergraduates. Requisites: Restricted to graduate students only.",8,0,["lecture","MoWeFr 1:00PM - 1:50PM",8,0,"Franz Thiem","3"]],
["MATH 4660","Intermediate Numerical Analysis 2","waitlisted","Continuation of MATH 4650. Examines numerical solution of initial-value problems and two-point boundary-value problems for ordinary differential equations. Also looks at numerical methods for solving partial differential equations. Same as APPM 4660. Requisites: Requires prerequisite course of MATH 4650 (minimum grade C-).",0,0,["lecture","MoWeFr 9:00AM - 9:50AM",0,0,"Jan Norris","3"]],
["MATH 8340","Functional Analysis 2","open","Introduces such topics as Banach spaces (Hahn-Banach theorem, open mapping theorem, etc.), operator theory (compact operators and integral equations, and spectral theorem for bounded self-adjoint operators), and Banach algebras (the Gelfand theory). Department enforced prereq., MATH 8330. Instructor consent required for undergraduates. See also MATH 8330. Requisites: Restricted to graduate students only.",11,0,["lecture","MoWeFr 1:00PM - 1:50PM",11,0,"Judith Jesudason","3"]],
["MATH 1212","Data and Models","open","None",9,0,["lecture","MoTuWeThFr 11:00AM - 11:50AM",9,0,"Matthew Pass","3"]],
["MATH 2400","Calculus 3","open","Continuation of MATH 2300. Topics include vectors, three-dimensional analytic geometry, partial differentiation and multiple integrals, and vector analysis. Department enforced prereq., MATH 2300 or APPM 1360 (minimum grade C-). Credit not granted for this course and APPM 2350.",1,0,["lecture","MoTuWeFr 9:00AM - 9:50AM",0,0,"Clifford Blakestad, ","4"],["lecture","MoTuWeFr 10:00AM - 10:50AM",0,0,"Ryan Rosenbaum, ","4"],["lecture","MoTuWeFr 11:00AM - 11:50AM",0,0,"Jonathan Belcher, ","4"],["lecture","MoTuWeFr 12:00PM - 12:50PM",0,0,"Joshua Frinak, ","4"],["lecture","MoTuWeFr 1:00PM - 1:50PM",1,0,"Andrew Healy, ","4"],["lecture","MoTuWeFr 2:00PM - 2:50PM",1,0,"Paul Lessard, ","4"],["lecture","MoTuWeFr 3:00PM - 3:50PM",0,0,"Andrew Healy, ","4"],["lecture","MoTuWeFr 8:00AM - 8:50AM",1,0,"Pearce Washabaugh, ","4"],["lecture","MoTuWeFr 4:00PM - 4:50PM",1,0,"Andrew Healy, ","4"]],
["MATH 3140","Abstract Algebra 1","open","Studies basic properties of algebraic structures with a heavy emphasis on groups. Other topics, time permitting, may include rings and fields. Requisites: Requires prerequisite courses of MATH 2001 and MATH 3130 or MATH 3135 (all minimum grade C-).",5,0,["lecture","MoWeFr 9:00AM - 9:50AM",5,0,"Peter Elliott","3"]],
["MATH 2300","Calculus 2","open","Continuation of MATH 1300. Topics include transcendental functions, methods of integration, polar coordinates, differential equations, improper integrals, infinite sequences and series, Taylor polynomials and Taylor series.  Department enforced prereq., MATH 1300 or MATH 1310 or APPM 1345 or APPM 1350 (minimum grade C-). Credit not granted for this course and APPM 1360.",14,0,["lecture","MoTuWeThFr 8:00AM - 8:50AM",2,0,"Robert Riddle, ","5"],["lecture","MoTuWeThFr 9:00AM - 9:50AM",1,0,"Robert Riddle, ","5"],["lecture","MoTuWeThFr 10:00AM - 10:50AM",0,0,"Katharine Adamyk, ","5"],["lecture","MoTuWeThFr 11:00AM - 11:50AM",1,0,"Albert Bronstein, ","5"],["lecture","MoTuWeThFr 11:00AM - 11:50AM",0,0,"Athena Sparks, ","5"],["lecture","MoTuWeThFr 12:00PM - 12:50PM",0,0,"Jun Hong, ","5"],["lecture","MoTuWeThFr 1:00PM - 1:50PM",0,0,"Albert Bronstein, ","5"],["lecture","MoTuWeThFr 1:00PM - 1:50PM",1,0,"Jun Hong, ","5"],["lecture","MoTuWeThFr 2:00PM - 2:50PM",0,0,"Andrew Moorhead, ","5"],["lecture","MoTuWeThFr 3:00PM - 3:50PM",4,0,"Ilia Mishev, ","5"],["lecture","MoTuWeThFr 4:00PM - 4:50PM",2,0,"Jun Hong, ","5"],["lecture","MoTuWeThFr 10:00AM - 10:50AM",1,0,"Athena Sparks, ","5"],["lecture","MoTuWeThFr 12:00PM - 12:50PM",0,0,"Ilia Mishev, ","5"],["lecture","MoTuWeThFr 2:00PM - 2:50PM",0,0,"Hanson Smith, ","5"],["lecture","MoTuWeThFr 3:00PM - 3:50PM",0,0,"Kevin Manley, ","5"],["lecture","MoTuWeThFr 10:00AM - 10:50AM",0,0,"Kevin Manley, ","5"],["lecture","MoTuWeThFr 8:00AM - 8:50AM",14,0,"Athena Sparks, ","5"],["lecture","MoTuWeThFr 4:00PM - 4:50PM",2,0,"Andrew Moorhead, ","5"],["lecture","MoTuWeThFr 9:00AM - 9:50AM",3,0,"Trubee Davison","5"]],
["MATH 6180","Algebraic Number Theory","open","Introduces number fields and completions, norms, discriminants and differents, finiteness of the ideal class group, Dirichlet's unit theorem, decomposition of prime ideals in extension fields, decomposition, and ramification groups. Department enforced prereqs., MATH 6110 and 6140. Instructor consent required for undergraduates. Requisites: Restricted to graduate students only.",6,0,["lecture","MoWeFr 11:00AM - 11:50AM",6,0,"Katherine Stange","3"]],
["MATH 1310","Calculus, Systems, and Modeling","open","Calculus concepts are developed through the analysis and modeling of complex systems, ranging from gene networks and cells to populations and ecosystems.  Fundamental concepts of probability and statistics are also developed through the lens of calculus.  This course is similar to MATH 1300, but a greater emphasis is placed on relevance and applications in biology and other life sciences.  Credit not granted for this course and MATH 1081, MATH 1300, APPM 1345, APPM 1350 or ECON 1088. Approved for GT-MA1. Approved for arts and sciences core curriculum: quantitative reasoning and mathematical skills. Requisites: Requires prerequisite course of MATH 1150 or APPM 1235 or MATH 1011 and MATH 1021 (minimum grade C-), or an ALEKS math score of 76% or greater.",9,0,["lecture","MoTuWeThFr 11:00AM - 11:50AM",0,0,"Caroline Matson, ","5"],["lecture","MoTuWeThFr 2:00PM - 2:50PM",0,0,"Caroline Matson, ","5"],["lecture","MoTuWeThFr 9:00AM - 9:50AM",9,0,"Albany Thompson, ","5"]],
["MATH 3850","Seminar in Guided Mathematics Instruction","open","Provides Learning Assistants with an opportunity to analyze assessment data for formative purposes, and develop instructional plans as a result of these analyses. These formative assessment analyses will build on the literature in the learning sciences. Students will gain direct experiences interacting with the tools of the trade, especially with actual assessment data and models of instruction.  May be repeated up to 3 total credit hours. Restricted to Learning Assistants in Math. Requisites: Requires a corequisite course of EDUC 4800.",14,0,["seminar","Th 5:00PM - 5:50PM",14,0,"Albert Bronstein","1"],["seminar","Tu 1:00PM - 1:50PM",5,0,"Elizabeth Grulke","1"],["seminar","Th 5:00PM - 5:50PM",14,0,"Lee Roberson","1"],["seminar","Th 11:00AM - 11:50AM",6,0,"Divya Vernerey","1"],["seminar","Th 2:00PM - 2:50PM",3,0,"Joseph Timmer","1"]],
["MATH 4805","Mathematical Teacher Training: Inclusive Pedagogy","open","Designed to train students to teach mathematics in an inclusive, multicultural environment. Students teach a math course within the McNeill Academic Program (Student Academic Services Center) meeting weekly with faculty and colleagues to learn to re-design curriculum, fine-tune pedagogical practices, create assessments, mentor undergraduate instructor assistants and create an inclusive classroom environment. May be repeated up to 4 total credit hours. Department enforced restriction: experience with college-level instruction. Requisites: Restricted to students with 87-180 credits (Seniors) or graduate students only.",3,0,["seminar","TBA",3,0,"Rebecca Machen","1"],["seminar","Mo 9:00AM - 9:50AM",3,0,"Rebecca Machen","1"]],
["MATH 8304","Topics in Analysis 1","open","Presents advanced topics in analysis including Lie groups, Banach algebras, operator theory, ergodic theory, representation theory, etc. Department enforced prereqs., MATH 8330 and MATH 8340.  Instructor consent required for undergraduates. Requisites: Restricted to graduate students only.",15,0,["lecture","MoWeFr 3:00PM - 3:50PM",15,0,"Alexander Kumjian","3"]],
["MATH 4820","History of Mathematical Ideas","waitlisted","Examines the evolution of a few mathematical concepts (e.g., number, geometric continuum, or proof), with an emphasis on the controversies surrounding these concepts. Begins with Ancient Greek mathematics and traces the development of mathematical concepts through the middle ages into the present. Recommended restriction:  completion of upper division Written Communication requirement. Same as MATH 5820. Requisites: Prereq. courses of MATH 2001 and one of the following:  MATH 3001, 3110, 3120, 3130, 3140, 3170, 3210, 3510, 3850, 4000, 4001, 4120, 4140, 4200, 4210, 4230, 4320, 4330, 4430, 4440, 4450, 4710, 4510, 4520, 4540, 4650, 4660 or 4820 (all min grade C-).",0,0,["seminar","MoWeFr 11:00AM - 11:50AM",0,0,"Jeffrey Fox","3"]],
["MATH 1150","Precalculus Mathematics","open","Develops techniques and concepts prerequisite to calculus through the study of trigonometric, exponential, logarithmic, polynomial, and other functions. Credit not granted for this course and MATH 1011, MATH 1021 or APPM 1235. Approved for GT-MA1. Meets MAPS requirement for mathematics. Approved for arts and sciences core curriculum: quantitative reasoning and mathematical skills. Requisites: Requires prerequisite course of MATH 1011 (minimum grade C-) or an ALEKS math score of 61% or greater.",14,0,["lecture","MoTuWeFr 8:00AM - 8:50AM",14,0,"Harrison Stalvey, ","4"],["lecture","MoTuWeFr 9:00AM - 9:50AM",0,0,"Harrison Stalvey, ","4"],["lecture","MoTuWeFr 10:00AM - 10:50AM",0,0,"Ira Becker, ","4"],["lecture","MoTuWeFr 11:00AM - 11:50AM",9,0,"Ilia Mishev, ","4"],["lecture","MoTuWeFr 12:00PM - 12:50PM",2,0,"Divya Vernerey, ","4"],["lecture","MoTuWeFr 1:00PM - 1:50PM",0,0,"Divya Vernerey, ","4"],["lecture","MoTuWeFr 2:00PM - 2:50PM",11,0,"Harrison Stalvey, ","4"],["lecture","MoWeFr 12:00PM - 12:50PM",1,0,"Maung Moon","4"]],
["MATH 1112","Mathematical Analysis in Business","open","Gives students experience with mathematical problem solving in real business contexts.  Students will work with data and spreadsheets to build and analyze mathematical models.  Themes of the course include applying logical operators to model business rules, interpreting data and using tables and graphs, finding break-even and optimal points, and addressing uncertainty and forecasting  Credit not granted for this course and MATH 1012.",2,0,["lecture","MoTuWeFr 8:00AM - 8:50AM",0,0,"Jacob Harper","4"],["lecture","MoTuWeFr 8:00AM - 8:50AM",0,0,"Alexander Nita","4"],["lecture","MoTuWeFr 9:00AM - 9:50AM",0,0,"Jacob Harper","4"],["lecture","MoTuWeFr 9:00AM - 9:50AM",0,0,"Alexander Nita","4"],["lecture","MoTuWeFr 10:00AM - 10:50AM",0,0,"Elizabeth Grulke","4"],["lecture","MoTuWeFr 10:00AM - 10:50AM",0,0,"Jacob Harper","4"],["lecture","MoTuWeFr 11:00AM - 11:50AM",1,0,"Alexander Nita","4"],["lecture","MoTuWeFr 11:00AM - 11:50AM",0,0,"Bahareh Momken","4"],["lecture","MoTuWeFr 12:00PM - 12:50PM",0,0,"Bahareh Momken","4"],["lecture","MoTuWeFr 12:00PM - 12:50PM",0,0,"Michael Roy","4"],["lecture","MoTuWeFr 1:00PM - 1:50PM",0,0,"Michael Roy","4"],["lecture","MoTuWeFr 12:00PM - 12:50PM",0,0,"Elizabeth Grulke","4"],["lecture","MoTuWeFr 2:00PM - 2:50PM",0,0,"Daniel Lindsey","4"],["lecture","MoTuWeFr 3:00PM - 3:50PM",1,0,"Michael Roy","4"],["lecture","MoTuWeFr 3:00PM - 3:50PM",0,0,"Daniel Moritz","4"],["lecture","MoTuWeFr 4:00PM - 4:50PM",0,0,"Daniel Moritz","4"],["lecture","MoTuWeFr 4:00PM - 4:50PM",2,0,"Bahareh Momken","4"],["lecture","MoTuWeFr 2:00PM - 2:50PM",0,0,"Patrick Newberry","4"],["lecture","MoTuWeFr 2:00PM - 2:50PM",0,0,"Bahareh Momken","4"]],
["MATH 6730","Set Theory","open","Presents cardinal and ordinal arithmetic, and basic combinatorial concepts, including stationary sets, generalization of Ramsey's theorem, and ultrafilters, consisting of the axiom of choice and the generalized continuum hypothesis. Department enforced prereqs., MATH 4000 or 5000, and MATH 4730 or 5730. Instructor consent required for undergraduates. Requisites: Restricted to graduate students only.",9,0,["lecture","MoWeFr 2:00PM - 2:50PM",9,0,"Agnes Szendrei","3"]],
["MATH 1012","Quantitative Reasoning and Mathematical Skills","open","Promotes mathematical literacy among liberal arts students. Teaches basic mathematics, logic, and problem-solving skills in the context of higher level mathematics, science, technology, and/or society. This is not a traditional math class, but is designed to stimulate interest in and appreciation of mathematics and quantitative reasoning as valuable tools for comprehending the world in which we live. Approved for GT-MA1. Meets MAPS requirement for mathematics. Approved for arts and sciences core curriculum: quantitative reasoning and mathematical skills.",4,0,["lecture","MoWeFr 9:00AM - 9:50AM",1,0,"Matthew Pass","3"],["lecture","MoWeFr 10:00AM - 10:50AM",4,0,"Catherine Moody","3"],["lecture","MoWeFr 11:00AM - 11:50AM",0,0,"Catherine Moody","3"],["lecture","MoWeFr 12:00PM - 12:50PM",0,0,"Michael Zowada","3"],["lecture","MoWeFr 1:00PM - 1:50PM",0,0,"Catherine Moody","3"],["lecture","MoWeFr 2:00PM - 2:50PM",0,0,"Michael Zowada","3"],["lecture","MoWeFr 2:00PM - 2:50PM",1,0,"Catherine Moody","3"],["lecture","TuTh 8:00AM - 9:15AM",2,0,"Abdel Baouchi","3"],["lecture","TuTh 9:30AM - 10:45AM",0,0,"Abdel Baouchi","3"],["lecture","MoWeFr 3:00PM - 3:50PM",0,0,"Michael Zowada","3"],["lecture","TuTh 12:30PM - 1:45PM",2,0,"Abdel Baouchi","3"],["lecture","TuTh 3:30PM - 4:45PM",0,0,"Michael Zowada","3"],["lecture","TuTh 3:30PM - 4:45PM",1,0,"Abdel Baouchi","3"]],
["MATH 1011","College Algebra","open","Covers simplifying algebraic expressions, factoring, linear and quadratic equations, inequalities, exponentials, logarithms, functions, graphs and systems of equations. Department enforced prereq., one year high school algebra. Credit not granted for this course and MATH 1005, MATH 1150 or APPM 1235.  Meets MAPS requirement for mathematics. Approved for arts and sciences core curriculum: quantitative reasoning and mathematical skills.",13,0,["lecture","MoFr 9:00AM - 9:50AM",8,0,"Eitan Angel","3"],["lecture","MoFr 10:00AM - 10:50AM",6,0,"Eitan Angel","3"],["lecture","MoFr 12:00PM - 12:50PM",6,0,"Matthew Pass","3"],["lecture","MoFr 1:00PM - 1:50PM",19,0,"Eitan Angel","3"],["lecture","MoWeFr 12:00PM - 12:50PM",10,0,"Diana Maggiore","3"],["recitation","Tu 8:00AM - 8:50AM",2,0,"Jordan DuBeau","3"],["recitation","Tu 9:00AM - 9:50AM",1,0,"Jordan DuBeau","3"],["recitation","Tu 10:00AM - 10:50AM",0,0,"Jordan DuBeau","3"],["recitation","Tu 12:00PM - 12:50PM",5,0,"Jordan DuBeau","3"],["recitation","Tu 8:00AM - 8:50AM",4,0,"Zhenhua Wang","3"],["recitation","Tu 9:00AM - 9:50AM",1,0,"Zhenhua Wang","3"],["recitation","Tu 1:00PM - 1:50PM",2,0,"Zhenhua Wang","3"],["recitation","Tu 12:00PM - 12:50PM",0,0,"Zhenhua Wang","3"],["recitation","Tu 10:00AM - 10:50AM",4,0,"Ian Long","3"],["recitation","Tu 11:00AM - 11:50AM",1,0,"Ian Long","3"],["recitation","Tu 1:00PM - 1:50PM",2,0,"Ian Long","3"],["recitation","Tu 2:00PM - 2:50PM",0,0,"Ian Long","3"],["recitation","Tu 1:00PM - 1:50PM",2,0,"Ali Lotfi","3"],["recitation","Tu 3:00PM - 3:50PM",2,0,"Ali Lotfi","3"],["recitation","Tu 4:00PM - 4:50PM",2,0,"Ali Lotfi","3"],["recitation","Tu 5:00PM - 5:50PM",13,0,"Ali Lotfi","3"]],
["MATH 4510","Introduction to Probability Theory","waitlisted","Studies axioms, combinatorial analysis, independence and conditional probability, discrete and absolutely continuous distributions, expectation and distribution of functions of random variables, laws of large numbers, central limit theorems, and simple Markov chains if time permits. Same as MATH 5510. Credit not granted for this course and APPM 3570, ECEN 3810, or MATH 3510. Requisites: Requires prerequisite courses of MATH 2400 or APPM 2350 and MATH 3130 or MATH 3135 (all minimum grade C-).",0,0,["lecture","MoWeFr 10:00AM - 10:50AM",0,0,"Janos Englander","3"],["lecture","MoWeFr 10:00AM - 10:50AM",0,0,"Trubee Davison","3"]],
["MATH 6360","Functions of a Complex Variable 2","open","Focuses on conformal mapping, analytic continuation, singularities, and elementary special functions. Department enforced prereq., MATH 6350.  Instructor consent required for undergraduates. Requisites: Restricted to graduate students only.",11,0,["lecture","MoWeFr 10:00AM - 10:50AM",11,0,"Sebastian Casalaina-Martin","3"]],
["MATH 4470","Partial Differential Equations","waitlisted","Studies initial, boundary, and eigenvalue problems for the wave, heat, and potential equations. Solution by separation of variables, Green's function, and variational methods. Same as MATH 5470. Requisites: Requires prerequisite courses of MATH 3430 (minimum grade C-).",0,0,["lecture","MoWeFr 3:00PM - 3:50PM",0,0,"Leonard Huang","3"]],
["MATH 6230","Introduction to Differential Geometry 1","open","Introduces topological and differential manifolds, vector bundles, differential forms, de Rham cohomology, integration, Riemannian metrics, connections and curvature. Department enforced prereqs., MATH 3130 and 4001. Instructor consent required for undergraduates. Requisites: Restricted to graduate students only.",6,0,["lecture","MoWeFr 12:00PM - 12:50PM",6,0,"Jordan Watts","3"]],
["MATH 5540","Introduction to Time Series","open","None",3,0,["lecture","MoWeFr 10:00AM - 10:50AM",3,0,"Sergei Kuznetsov","3"]],
["MATH 5120","Introduction to Operations Research","open","None",4,0,["lecture","MoWeFr 11:00AM - 11:50AM",4,0,"Yu-Jui Huang","3"]],
["MATH 5470","Partial Differential Equations","open","None",2,0,["lecture","MoWeFr 3:00PM - 3:50PM",2,0,"Leonard Huang","3"]],
["MATH 8815","Ulam Seminar","open","May be repeated up to 3 total credit hours.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Requisites: Restricted to graduate students only.",15,0,["seminar","Th 10:00AM - 10:50AM",15,0,"Alexander Kumjian","1 - 3"]],
["MATH 5510","Introduction to Probability Theory","open","None",5,0,["lecture","MoWeFr 10:00AM - 10:50AM",5,0,"Janos Englander","3"],["lecture","MoWeFr 10:00AM - 10:50AM",1,0,"Trubee Davison","3"]],
["MATH 1300","Calculus 1","open","Topics include limits, derivatives of algebraic and transcendental functions, applications of the derivative, integration and applications of the definite integral. Credit not granted for this course and MATH 1081, MATH 1310, APPM 1345, APPM 1350, or ECON 1088. Approved for GT-MA1. Approved for arts and sciences core curriculum: quantitative reasoning and mathematical skills. Requisites: Requires prerequisite course of MATH 1150 or APPM 1235 or MATH 1011 and MATH 1021 (minimum grade C-), or an ALEKS math score of 76% or greater.",9,0,["lecture","MoTuWeThFr 8:00AM - 8:50AM",1,0,"Brendt Gerics, ","5"],["lecture","MoTuWeThFr 9:00AM - 9:50AM",0,0,"Leo Herr, ","5"],["lecture","MoTuWeThFr 9:00AM - 9:50AM",0,0,"Lauren Farquhar, ","5"],["lecture","MoTuWeThFr 10:00AM - 10:50AM",0,0,"Lauren Farquhar, ","5"],["lecture","MoTuWeThFr 10:00AM - 10:50AM",0,0,"Braden Balentine, ","5"],["lecture","MoTuWeThFr 10:00AM - 10:50AM",3,0,"Sarah Arpin, ","5"],["lecture","MoTuWeThFr 11:00AM - 11:50AM",0,0,"Lauren Farquhar, ","5"],["lecture","MoTuWeThFr 11:00AM - 11:50AM",0,0,"Joel Ornstein, ","5"],["lecture","MoTuWeThFr 12:00PM - 12:50PM",0,0,"Joel Ornstein, ","5"],["lecture","MoTuWeThFr 12:00PM - 12:50PM",9,0,"Andrew Stocker, ","5"],["lecture","MoTuWeThFr 1:00PM - 1:50PM",2,0,"Michael Wheeler, ","5"],["lecture","MoTuWeThFr 1:00PM - 1:50PM",3,0,"Andrew Stocker, ","5"],["lecture","MoTuWeThFr 2:00PM - 2:50PM",4,0,"Michael Wheeler, ","5"],["lecture","MoTuWeThFr 2:00PM - 2:50PM",2,0,"Daniel Martin, ","5"],["lecture","MoTuWeThFr 3:00PM - 3:50PM",1,0,"Isabel Corona, ","5"],["lecture","MoTuWeThFr 3:00PM - 3:50PM",1,0,"Ira Becker, ","5"],["lecture","MoTuWeThFr 4:00PM - 4:50PM",0,0,"Andrew Stocker, ","5"],["lecture","MoWeFr 12:00PM - 12:50PM",1,0,"Clifford Bridges","5"]],
["MATH 3110","Introduction to Theory of Numbers","waitlisted","Studies the set of integers, focusing on divisibility, congruences, arithmetic functions, sums of squares, quadratic residues and reciprocity, and elementary results on distributions of primes. Requisites: Requires prerequisite course of  MATH 2001 (minimum grade C-).",0,0,["lecture","MoWeFr 2:00PM - 2:50PM",0,0,"Tien Trinh","3"]],
["MATH 5905","Mathematics Teacher Training","open","Designed to train students to become effective teachers. Students teach a mathematics course, meeting weekly with faculty to discuss problems particular to the teaching of mathematics. Department enforced restriction: current employment as a teaching assistant. Requisites: Restricted to graduate students only.",10,0,["pra","We 10:00AM - 10:50AM",10,0,"John Martin","1"]],
["MATH 1081","Calculus for Social Science and Business","open","Covers differential and integral calculus of algebraic, logarithmic, and exponential functions.  Credit not granted for this course and MATH 1300, MATH 1310, APPM 1345, APPM 1350 or ECON 1088. Approved for arts and sciences core curriculum: quantitative reasoning and mathematical skills. Requisites: Requires prerequisite course of MATH 1071 or MATH 1011 or MATH 1150 (minimum grade C-) or an ALEKS math score of 61% greater.",17,0,["lecture","MoWeFr 12:00PM - 12:50PM",0,0,"Kevin Manley","3"],["lecture","MoWeFr 2:00PM - 2:50PM",17,0,"Alexander Nita","3"]],
["MATH 4650","Intermediate Numerical Analysis 1","waitlisted","Focuses on numerical solution of nonlinear equations, interpolation, methods in numerical integration, numerical solution of linear systems, and matrix eigenvalue problems. Stresses significant computer applications and software. Department enforced restriction: knowledge of a programming language. Same as APPM 4650. Requisites: Requires prerequisite course of MATH 3130 or MATH 3135 or APPM 3310 (minimum grade C-).",0,0,["lecture","MoWeFr 9:00AM - 9:50AM",0,0,"Divya Vernerey","3"]],
["MATH 2510","Introduction to Statistics","open","Elementary statistical measures. Introduces statistical distributions, statistical inference, hypothesis testing and linear regression. Department enforced prereq., two years of high school algebra.",16,0,["lecture","MoWeFr 8:00AM - 8:50AM",0,0,"Wafa Yacoub","3"],["lecture","MoWeFr 9:00AM - 9:50AM",0,0,"Wafa Yacoub","3"],["lecture","MoWeFr 9:00AM - 9:50AM",1,0,"Martha Rooney","3"],["lecture","MoWeFr 10:00AM - 10:50AM",1,0,"Martha Rooney","3"],["lecture","MoWeFr 11:00AM - 11:50AM",0,0,"Wafa Yacoub","3"],["lecture","MoWeFr 12:00PM - 12:50PM",1,0,"Martha Rooney","3"],["lecture","MoWeFr 12:00PM - 12:50PM",0,0,"Xingzhou Yang","3"],["lecture","MoWeFr 1:00PM - 1:50PM",2,0,"Xingzhou Yang","3"],["lecture","MoWeFr 2:00PM - 2:50PM",0,0,"Joseph Timmer","3"],["lecture","MoWeFr 2:00PM - 2:50PM",2,0,"Xingzhou Yang","3"],["lecture","MoWeFr 3:00PM - 3:50PM",1,0,"Joseph Timmer","3"],["lecture","MoWeFr 4:00PM - 4:50PM",3,0,"Michael Daniel","3"],["lecture","MoWeFr 11:00AM - 11:50AM",2,0,"Martha Rooney","3"],["lecture","MoWeFr 8:30AM - 9:20AM",12,0,"Rachel Benefiel","3"],["lecture","MoWeFr 1:00PM - 1:50PM",6,0,"Michael Daniel","3"],["lecture","MoWeFr 2:00PM - 2:50PM",16,0,"Michael Daniel","3"],["lecture","MoWeFr 3:00PM - 3:50PM",16,0,"Wafa Yacoub","3"]],
["MATH 6320","Introduction to Real Analysis 2","open","Covers general metric spaces, the Baire Category Theorem, and general measure theory, including the Radon-Nikodym and Fubini theorems. Presents the general theory of differentiation on the real line and the Fundamental Theorem of Lebesgue Calculus. Recommended prereq., MATH 6310. Instructor consent required for undergraduates. Requisites: Restricted to graduate students only.",17,0,["lecture","MoWeFr 1:00PM - 1:50PM",17,0,"Janos Englander","3"]],
["MATH 5330","Fourier Analysis","open","None",4,0,["lecture","MoWeFr 1:00PM - 1:50PM",4,0,"Martin Walter","3"]],
["MATH 3130","Introduction to Linear Algebra","waitlisted","Examines basic properties of systems of linear equations, vector spaces, inner products, linear independence, dimension, linear transformations, matrices, determinants, eigenvalues, eigenvectors and diagonalization. Credit not granted for this course and MATH 3135 or APPM 3310. Requisites: Requires prerequisite course of MATH 2300 or APPM 1360 (minimum grade C-).",0,0,["lecture","MoWeFr 9:00AM - 9:50AM",0,0,"Jakub Bulin","3"],["lecture","MoWeFr 10:00AM - 10:50AM",0,0,"Pedro Berrizbeitia","3"],["lecture","MoWeFr 11:00AM - 11:50AM",0,0,"Martin Walter","3"],["lecture","MoWeFr 12:00PM - 12:50PM",0,0,"Peter Elliott","3"],["lecture","MoWeFr 2:00PM - 2:50PM",0,0,"Pedro Berrizbeitia","3"]],
["MATH 2001","Introduction to Discrete Mathematics","waitlisted","Introduces the ideas of rigor and proof through an examination of basic set theory, existential and universal quantifiers, elementary counting, discrete probability, and additional topics. Department enforced prereq., MATH 1300 or MATH 1310 or APPM 1345 or APPM 1350 (minimum grade C-).",0,0,["lecture","MoWeFr 9:00AM - 9:50AM",0,0,"Albert Bronstein","3"],["lecture","MoWeFr 10:00AM - 10:50AM",0,0,"Faan Liu","3"],["lecture","MoWeFr 3:00PM - 3:50PM",0,0,"Su-Ion Ih","3"],["lecture","MoWeFr 12:00PM - 12:50PM",0,0,"Harrison Stalvey","3"],["lecture","MoWeFr 2:00PM - 2:50PM",0,0,"Kevin Manley","3"]],
["MATH 6170","Algebraic Geometry","open","Introduces algebraic geometry, including affine and projective varieties, rational maps and morphisms, and differentials and divisors. Additional topics might include Bezout's Theorem, the Riemann-Roch Theorem, elliptic curves, and sheaves and schemes. Department enforced prereq., MATH 6140. Instructor consent required for undergraduates. Requisites: Restricted to graduate students only.",5,0,["lecture","MoWeFr 3:00PM - 3:50PM",5,0,"Jonathan Wise","3"]],
["MATH 3210","Euclidean and Non-Euclidean Geometry","open","Axiomatic systems; Euclid's presentation of the elements of geometry; Hilbert's axioms; neutral, Euclidean and non-Euclidean geometries and their models. Requisites: Requires prerequisite courses of MATH 2001 and MATH 3130 or MATH 3135 (all minimum grade C-).",14,0,["lecture","MoWeFr 3:00PM - 3:50PM",14,0,"Keith Kearnes","3"]],
["MATH 6220","Introduction to Topology 2","open","Continuation of MATH 6210. Department enforced prereq., MATH 6210. Instructor consent required for undergraduates. Requisites: Restricted to graduate students only.",15,0,["lecture","MoWeFr 2:00PM - 2:50PM",15,0,"Carla Farsi","3"]],
["MATH 3001","Analysis 1","open","Provides a rigorous treatment of the basic results from elementary Calculus. Topics include the topology of the real line, sequences of numbers, continuous functions, differentiable functions, and the Riemann integral. Requisites: Requires prerequisite course of  MATH 2001 (minimum grade C-).",10,0,["lecture","MoWeFr 9:00AM - 9:50AM",10,0,"Markus Pflaum","3"],["lecture","MoWeFr 10:00AM - 10:50AM",5,0,"Agnes Beaudry","3"],["lecture","MoWeFr 12:00PM - 12:50PM",1,0,"Agnes Beaudry","3"]]
]}