{"updated": "2017-11-07", "data":[["ATLS 4151","Flow Visualization","3",0,["None",[0,21,660,710,"3",2,0,"Jean Hertzberg","ITLL 1B50","Notes: This is a combined section class"]]],["APRD 3005","Content Strategy and User Engagement","3",1,["Explore and understand the importance of content as a brand building tool. Students will gain the ability to use analytics to create strategy that allows the brand to have meaningful and cohesive conversation with its community. Requisites: Requires a prerequisite course of APRD 2000 (minimum grade D-).",[0,1,1080,1230,"3",0,1,"Staff","HUMN 190"]]],["APRD 4403","Strategic Communication Campaigns","4",1,["Gives students the opportunity to work in small groups to develop material for an actual client.  Examines basic principles of group dynamics and effective teamwork while conducting research, developing strategies and creating a multimedia campaign.  All work is presented to the client. Requisites: Requires prerequisite course of APRD 3000 or ARPD 3001 or APRD 3002 or APRD 3003 or APRD 3004 or JOUR 3503 or JOUR 3463 (minimum grade D-). Restricted to Strategic Communication (STCM) or Advertising (JADV) majors only with a minimum of 85 hours.",[0,5,1020,1125,"4",0,12,"Staff","HLMS 185"],[0,10,930,1035,"4",0,17,"Michael Stoner","ARMR 218"],[0,5,600,705,"4",0,22,"Richard Goode-Allen","ARMR 206A"],[0,10,930,1035,"4",0,14,"Irma Fisher","HLMS 181"],[0,5,930,1035,"4",0,14,"Erin Schauster","ARMR 218"]]],["AREN 4550","Illumination 2","3",0,["Applies the principles studied in Illumination 1. Provides further study in architectural lighting design methods. Uses lighting studio work to develop a broad knowledge of lighting equipment, design methods, and their application in a series of practical design problems in modern buildings. Requisites: Requires prerequisite course of AREN 3540 (minimum grade C-).",[0,21,600,650,"3",35,0,"Sandra Vasconez","ECCR 155","Notes: This is a combined section class"]]],["AREN 3060","Environmental Systems for Buildings 2","3",0,["Explores operations and architectural design strategies of plumbing, power distribution, renewable electricity generation, illumination, daylighting, acoustical control, vertical transportation, fire protection and telecommunication systems in buildings with a focus on sustainability and resource efficiency. Requisites: College of Engineering majors are excluded from this course.",[0,10,480,555,"3",34,0,"Joseph Wujek","ECCR 155"]]],["ARSC 1400","MASP Coseminar: Chemistry 1 & 2","1",0,["Supplements and strengthens student experiences in chemistry. Allows particularly gifted students an opportunity to extend their understanding of the subject and to explore possible careers in science. May be repeated up to 2 total credit hours.",[3,5,930,1005,"1",6,0,"Staff","FLMG 241","Topic: SASC CO-SEM: Chem I & II"]]],["ASEN 3519","Special Topics","3",0,["Studies specialized aspects of the aerospace engineering sciences or innovative treatment of required subject matter at the upper-division level. Course content is indicated in the online Schedule Planner. Department enforced prereq., varies. Requisites: Restricted to College of Engineering majors only.",[0,10,1020,1095,"3",38,0,"Phillip Larson","ECCR 151","Topic: The Politics of Space"]]],["ASEN 1022","Materials Science for Aerospace Engineers","3",0,["Covers prerequisite chemistry topics for materials science and introduces material types, properties and behavior for aerospace engineers. Topics include review of chemistry; atomic bonding; crystals; diffusion; mechanical/thermal properties; phase diagrams; heat treatment; failure mechanisms; materials selection; and a general introduction to modern materials for aerospace engineering applications including composites, nanomaterials and metamaterials. Lab project or tensile testing is included. Requisites: Requires prerequisite courses of APPM 1350 or MATH 1300 (minimum grade C). Requires corequisite courses of COEN 1300 or ECEN 1310 or CSCI 1300 or CSCI 1310 or CSCI 1320. Restricted to Aerospace Engineering (ASEN) majors only.",[0,21,840,890,"3",284,0,"Jelliffe Jackson, ","MATH 100"]]],["APRD 5003","Brand Design Studio 2","3",0,["None",[5,4,750,930,"3",27,0,"Louis Ferracane","OFF SITE"]]],["ACCT 6700","Income Taxation","4",0,["Emphasizes the fundamentals of the federal income tax system and examines its impact on the individual. Same as LAWS 6007. Requisites: Restricted to Accounting (ACCT), Accounting-Information Systems (ACIS), Accounting-Taxation (ACTX), Master of Business Admininstration (MBA) or Business Administration (BUAD) graduate students only.",[0,10,870,970,"4",5,0,"Sloan Speck","WLAW 204","Notes: This is a combined section class"]]],["BCOR 2002","Principles of Accounting and Finance","3",0,["Provides students with an overall appreciation for coordinated efforts within the business world. Builds a basic understanding of how information regarding a firm's resources and obligations is conveyed to decision makers outside the firm. Examines the use of the tools in financial forecasting, as well as the valuation of projects and assets in the context of time and risk. Credit not granted for this course and BCOR 2000 and BCOR 2200. Requisites: Requires prerequisite courses of BCOR 1015 and BCOR 1025 and ECON 2010 (all minimum  grade D-). Restricted to Business (BUSN) majors with 26-180 units completed.",[0,5,480,555,"3",71,0,"Jeffrey Merrell, ","KOBL 340"],[0,5,570,645,"3",70,0,"Jeffrey Merrell, ","KOBL 340"],[0,5,660,735,"3",70,0,"Jeffrey Merrell, ","KOBL 340"],[0,5,750,825,"3",69,0,"Jeffrey Merrell, ","KOBL 340"]]],["ATLS 3000","Code","3",0,["None",[0,1,780,890,"3",7,0,"Joel Swanson","ATLS 1B31"],[1,4,780,890,"3",7,0,"Staff","ATLS 1B31"]]],["ATOC 6950","Master's Thesis","1 - 6",0,["None",[6,0,0,0,"1 - 6",100,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 6",100,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 6",100,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 6",100,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 6",100,0,"Staff","SEE DEPT"]]],["ANTH 3005","Dogs, Wolves and Human Evolution","3",0,["None",[0,10,570,645,"3",36,0,"Joanna Lambert","HUMN 150"]]],["APRD 5007","Critical Making Studio 2","3",0,["None",[5,8,750,930,"3",30,0,"Benton Rochester, ","OFF SITE"]]],["ANTH 5785","Advanced Seminar in Cultural Anthropology","3",0,["Details the history of theory and practice in contemporary cultural anthropology, considering the development of major theoretical schools of thought and the integration of general social theory within anthropology. Required of masters students in cultural anthropology. Requisites: Restricted to Anthropology (ANTH) graduate students only.",[3,8,600,750,"3",15,0,"Carla Jones","HALE 455"]]],["ARTF 5610","Image-makers Graduate Seminar","3",0,["Explores advanced graduate studio work in a seminar setting. The course will focus on the development of ideas and activities which advance creative image making. May be repeated up to 12 total credit hours. Requisites: Restricted to graduate students only.",[3,16,780,1010,"3",7,0,"Jeanne Liotta","ATLS 102"]]],["ATLS 5250","Fieldwork Methods for ICTD Practitioners","3",0,["Introduces methods and models that can be employed in ICTD program development and deployment. Examines the applications of participatory research, value-centric design, program scale, cross-disciplinary work, and appropriate monitoring and evaluation. The goal of this course is to build student confidence around existing evaluation toolkits and methods, while advancing multi-method approaches to designing and analyzing ICTD initiatives. Requisites: Restricted to graduate students only.",[3,1,990,1140,"3",20,0,"Mustafa Naseem","ATLS 225"]]],["ASEN 5016","Space Life Sciences","3",0,["Familiarizes students with factors affecting living organisms in the reduced-gravity environment of space flight. Covers basic life support requirements, human physiological adaptations, and cellular-level gravity dependent processes with emphasis on technical writing and research proposal preparation. Requisites: Restricted to College of Engineering (ENGR) graduate students or Aerospace Engineering Concurrent Degree (C-ASEN) majors only.",[0,10,930,1005,"3",16,0,"David Klaus","ECCR 1B51"],[0,0,0,0,"3",27,0,"David Klaus","Distance Section"]]],["ANTH 4020","Explorations in Anthropology","3",0,["Special topics in cultural and physical anthropology, as well as archaeology. Check with the department for semester offerings. May be repeated up to 9 total credit hours. Same as ANTH 5020. Requisites: Restricted to students with 57-180 credits (Juniors or Seniors).",[0,10,750,825,"3",18,0,"Lorecia Roland","CLUB 13","Topic: Star Trek and TNG of Anthro"],[0,10,570,645,"3",37,0,"Christian Hammons","HALE 240","Topic: Statecraft and Resistance"]]],["APRD 3004","Account Management","3",0,["Examines managerial and decision making processes of advertising and related brand communication functions. Emphasis on determining opportunities, integrating with other elements of the promotion mix, setting objectives, establishing budgets, and measuring advertising and communication effectiveness. Requisites: Requires a prerequisite course of APRD 2000 or JOUR 2403 (minimum grade D-). Restricted to Strategic Communication (STCM) or Advertising (JADV) majors only.",[0,4,1080,1230,"3",17,0,"Gene Karaffa","ENVD 122"],[0,2,1080,1230,"3",14,0,"Eric Forsyth, ","MUEN E126"],[0,1,1080,1230,"3",0,2,"Staff","MUEN D144"]]],["BUSM 2002","Financial Accounting and Finance","3",0,["Focuses on the development and interpretation of companies' external financial reports. Emphasizes the concepts and skills needed to make sound financial decisions. Topics include financial statement development, statement analysis, working capital management, time value of money, sources of financial capital, cost and value of bonds and stocks, and capital budgeting or project analysis. Department enforced prereq., any calculus or statistics course. Requisites: Restricted to students with Business Minor (BUSM-MIN) plan and 12 units completed.",[0,5,900,975,"3",113,0,"Jeffrey Merrell, ","CHEM 140"],[0,5,990,1065,"3",119,0,"Jeffrey Merrell, ","MUEN E050"]]],["ANTH 4800","Language and Culture","3",0,["Principles of language structure and how language and culture interrelate; how language and language use are affected by culture; and how culture may be affected by use of, or contact with, particular languages.  Recommended prereqs., ANTH 2100 or LING 1000 or LING 2400. Recommended restriction:  students with 57-180 credits (Junior or Senior) only. Same as LING 4800.",[0,21,900,950,"3",25,0,"Staff","HALE 260","Notes: This is a combined section class"]]],["ATOC 5200","Biogeochemical Oceanography","3",0,["Provides a large-scale synthesis of the processes impacting ocean biogeochemistry.  Transforms theoretical understanding into real-world applications using oceanographic data and models.  Topics include:  chemical composition, biological nutrient utilization and productivity, air-sea gas exchange, carbonate chemistry, ocean acidification, ocean deoxygenation, iron fertilization, biogeochemical climate feedbacks, and much more.  Same as ATOC 4200. Requisites: Restricted to graduate students only.",[0,10,900,975,"3",10,0,"Nicole Lovenduski","SEEC S125","Notes: This is a combined section class"]]],["BASE 2104","BCOR Applied Semester Experience 4: Case Project","3",0,["Focuses on a major business decision requiring interdisciplinary analysis. Students will draw on knowledge and tools learned in other BASE and BCOR courses to analyze the case and present their solution in a competitive setting. May be repeated up to 6 total credit hours. Requisites: Requires prerequisite courses of BCOR 2001, 2002 and 2003 (all minimum  grade D-). Restricted to Business (BUSN) majors with 26-180 units completed.",[0,4,480,650,"3",149,0,"Richard Reed","KOBL S135"],[0,8,480,650,"3",143,0,"Mary Lewis","KOBL S135"],[0,4,660,830,"3",138,0,"Craig Stephenson","KOBL S135"],[0,8,840,1010,"3",146,0,"Joshua Neil","KOBL S135"],[0,8,660,830,"3",145,0,"Lori Seward","KOBL S135"]]],["AREN 2110","Thermodynamics","3",0,["Explores fundamental principles of thermodynamics, including first and second law of thermodynamics, thermophysical properties, power and refrigeration cycles, gas mixtures and psychrometrics.  Approved for arts and sciences core curriculum: natural science. Requisites: Requires a prereq course of PHYS 1110 (min grade C-) and a prereq or coreq course of APPM 1360 or MATH 2300 (min grade C-). Restricted to AREN, CVEN or EVEN, GEEN, AMEN or EVENCVEN Concurrent Degree majors only.",[0,21,660,710,"3",69,0,"Lupita Montoya","FLMG 156"]]],["BUSM 3005","Introduction to Real Estate","3",0,["None",[0,5,840,915,"3",57,0,"Michael Kercheval","KOBL S135"]]],["ASEN 5245","Radar and Remote Sensing","3",0,["Examines active techniques of remote sensing, with emphasis on radar fundamentals, radar wave propagation, scattering processes, and radar measurement techniques and design. Examines specific radar systems and applications, such as synthetic aperture radar phased arrays for atmosphere, space, land, and sea applications. Requisites: Restricted to College of Engineering (ENGR) graduate students or Aerospace Engineering Concurrent Degree (C-ASEN) majors only.",[0,8,1020,1190,"3",17,0,"Christopher Williams","HUMN 1B80"],[0,0,0,0,"3",932,0,"Christopher Williams","Distance Section"]]],["AIRR 2020","The Evolution of USAF Air and Space Power 2","1",0,["A continuation of AIRR 2010. One 1-hour lecture and one 2-hour lab per week.",[0,8,750,800,"1",30,0,"Staff","STAD 112"],[2,8,930,1130,"1",30,0,"Staff","DUAN G1B30"],[0,8,840,890,"1",29,0,"Staff","STAD 112"],[2,8,930,1130,"1",29,0,"Staff","DUAN G1B30"]]],["ASTR 7500","Special Topics in Astrophysical and Planetary Sciences","1 - 3",0,["Acquaints students with current research in astrophysical and planetary sciences. Topics vary each semester.  May be repeated up to 9 total credit hours. Requisites: Restricted to graduate students only.",[0,5,720,810,"1 - 3",25,0,"Mark Rast","SEE DEPT"]]],["ASTR 1200","Stars and Galaxies","3",0,["Non-science majors are introduced to the nature and workings of the Sun, stars, neutron stars, black holes, interstellar gas, galaxies, quasars, plus structure and origins of the universe.  Some lectures may be held at Fiske Planetarium.  Offers opportunities to attend nighttime observation sessions at Sommers-Bausch Observatory.  Credit for only one of ASTR 1200, 1120, 1020, or 1040.  Formerly ASTR 1120.  Approved for arts and sciences core curriculum: natural science (non-sequence).",[0,21,540,590,"3",209,0,"Andrew Hamilton","DUAN G1B20"],[0,10,750,825,"3",104,0,"Charles Danforth","DUAN G130"]]],["AREN 6940","Master's Degree Candidate","1",0,["None",[6,0,720,720,"1",30,0,"Staff","TBA"]]],["ANTH 4500","Cross-Cultural Aspects of Socioeconomic Development","3",0,["Examines goals of international agencies that support development in underdeveloped countries. Anthropological perspective is provided for such issues as urban planning, health care and delivery, population control, rural development, and land reform. Same as ANTH 5500. Requisites: Restricted to students with 57-180 credits (Juniors or Seniors).",[0,10,750,825,"3",12,0,"Jerry Jacka","HALE 240","Notes: This is a combined section class"]]],["APRD 3002","Communication Platforms","3",0,["Explores cross-channel media consumption (television, print, radio, Internet, product placement, word-of-mouth, etc.) and developing evaluative techniques to choose media that will most effective implement a brand strategy; allows students to learn how to utilize different forms of media in the context of integrated brand communication. Similar to JOUR 3463. Requisites: Requires a prerequisite course of APRD 2000 or JOUR 2403 (minimum grade D-). Restricted to Strategic Communication (STCM) or Advertising (JADV) majors only.",[0,10,750,825,"3",0,14,"Melinda Cheval","HLMS 241"],[0,1,1080,1230,"3",15,0,"Maxim Lenderman","DUAN G2B60"],[0,8,1110,1260,"3",39,0,"Amos Gelb","CU in DC Carnegie","Notes: This is a combined section class"]]],["ATLS 3173","Creative Climate Communication","3",0,["None",[0,10,570,645,"3",13,0,"Mary Osnes","ATLS 1B31","Notes: This is a combined section class"]]],["CAMW 3939","Center of the American West Internship","1 - 3",0,["Work for public and private organizations on projects that enhance the understanding of various Western American topics and issues (environmental, cultural, public policy, etc.), and which foster students' development as community leaders working for a sustainable West. May be repeated up to 6 total credit hours. Recommended prereq., CAMW 2001. Requisites: Restricted to students with 57-180 credits (Juniors or Seniors).",[8,0,0,0,"1 - 3",12,0,"Brooke Neely","TBA"],[8,0,0,0,"1 - 3",12,0,"Jason Hanson","TBA"],[8,0,0,0,"1 - 3",12,0,"Jason Hanson","TBA"],[8,0,0,0,"1 - 3",12,0,"Jason Hanson","TBA"],[8,0,0,0,"1 - 3",12,0,"Staff","TBA"],[8,0,0,0,"1 - 3",12,0,"Staff","TBA"],[8,0,0,0,"1 - 3",12,0,"Staff","TBA"],[8,0,0,0,"1 - 3",12,0,"Staff","TBA"]]],["ATLS 4010","Capstone Projects I","4",0,["None",[3,1,780,1010,"4",4,0,"Arielle Hein","ATLS 1B25"]]],["ANTH 2040","Laboratory in Biological Anthropology 2","1",0,["Experiments and hands-on exercises designed to enhance understanding of the principles and concepts presented in ANTH 2020. One two-hour class per week. Recommended coreq., ANTH 2020. Approved for GT-SC1. Approved for arts and sciences core curriculum: natural science.",[10,2,600,710,"1",13,0,"Staff","HALE 246"],[10,2,720,830,"1",12,0,"Staff","HALE 246"],[10,2,840,950,"1",16,0,"Staff","HALE 246"],[10,2,960,1070,"1",14,0,"Staff","HALE 246"],[10,4,540,650,"1",10,0,"Staff","HALE 246"],[10,4,660,770,"1",13,0,"Staff","HALE 246"],[10,4,780,890,"1",10,0,"Staff","HALE 246"],[10,4,900,1010,"1",13,0,"Staff","HALE 246"],[10,4,1020,1130,"1",13,0,"Staff","HALE 246"],[10,8,600,710,"1",15,0,"Staff","HALE 246"],[10,8,720,830,"1",14,0,"Staff","HALE 246"],[10,8,840,950,"1",15,0,"Staff","HALE 246"],[10,16,720,830,"1",15,0,"Staff","HALE 246"],[10,16,840,950,"1",12,0,"Staff","HALE 246"]]],["ASTR 2030","Black Holes","3",0,["Black holes are one of the most bizarre phenomena of nature. Students are introduced to the predicted properties of black holes, astronomical evidence for their existence and formation, and modern ideas about space, time, and gravity. Approved for the arts and sciences core curriculum: natural science.",[0,21,780,830,"3",102,0,"Mitchell Begelman","DUAN G130"]]],["APRD 3008","Qualitative Research Methods","3",0,["Exposes students to the principles and methods of qualitative methodology including interviews, focus groups and ethnography. Explores how these methods inform the practice of account planning. Requisites: Requires a prerequisite course of APRD 2000 (minimum grade D-). Restricted Strategic Communication (STCM) majors only.",[0,4,1080,1230,"3",28,0,"Staff","DUAN G2B60"]]],["ARTH 3419","Modern Art Survey","3",0,["Surveys the loss of beauty in art and discusses whether or not that loss is regrettable. Questions the function and historical meaning of modern and postmodern art: is it all hype and strategic positioning by artists for fame and fortune? Is it serious? Are the fine arts still fine? Requisites: Requires prerequisite courses of ARTH 1300 and 1400 (all minimum grade D-).",[0,5,840,915,"3",13,0,"Albert Alhadeff","VAC 303"]]],["AREN 4506","Pre-construction Estimating and Scheduling","3",0,["Integrates project management methods with an emphasis on the techniques used to create bid-day budgets and schedules for architectural and civil engineering projects. Requisites: Requires prerequisite course of CVEN 3246 (minimum grade C-). Restricted to students with 57-180 credits (Junior or Senior) Architectural (AREN), Civil (CVEN) or General (GEEN) Engineering majors only.",[0,10,750,825,"3",37,0,"William Mc Divitt","FLMG 157"]]],["ATLS 3529","Special Topics in Critical Perspectives in Technology","3",0,["None",[0,5,660,735,"3",14,0,"Brizida Ahrnsbrak","ENVD 234A","Topic: History of Design"]]],["ASIA 3300","Sex and Gender in Asian Film and Literature","3",0,["None",[0,10,570,645,"3",25,0,"J Berry","KTCH 1B60"]]],["ARTH 4959","Art History Honors Thesis","3",0,["May be elected during the final semester. Consists of a substantial, original written thesis. Requires faculty sponsorship. Does not guarantee a student will receive honors.",[9,0,0,0,"3",5,0,"Staff","TBA"],[9,0,0,0,"3",5,0,"Staff","TBA"],[9,0,0,0,"3",5,0,"Staff","TBA"]]],["ATOC 7500","Special Topics in Atmospheric and Oceanic Sciences","3",0,["Acquaints students with current research in atmospheres, oceans, and climate. Topics may vary each semester. May be repeated up to 9 total credit hours. Students may register for more than one section of this course in the same semester. Requisites: Restricted to graduate students only.",[0,10,660,735,"3",8,0,"Jennifer Kay","HUMN 1B35","Topic: Objective Data Analysis"],[0,10,840,915,"3",4,0,"Alexandra Jahn","HUMN 1B35","Topic: Num Methods/Modeling"]]],["BADM 1260","First-Year Global Experience","2",0,["In today's world of increased mobility, globally aware students have more choices for employment upon graduation and are immediately ready to contribute in global environments.  They are aware of global issues and cultural differences, and their global mindset allows them to recognize good ideas from whenever they might come and new market/product opportunities wherever they might exist.  This course is the first step toward the development of a global mindset.  It provides a meaningful global experience to first-year business students through an in-depth perspective of a specific country or region outside the United States and a short academic trip to the region. Requisites: Restricted to Business (BUSN) majors only.",[0,2,600,675,"2",30,0,"Mary Lewis","KOBL 355","Topic: Spain"],[0,2,660,735,"2",30,0,"Sean Kenney","CHEY 140","Topic: Portugal"],[0,8,570,645,"2",36,0,"Donald Oest","CHEY 140","Topic: Costa Rica"],[0,8,750,825,"2",30,0,"Kevin McMahon","KOBL 235","Topic: Japan"],[0,2,750,825,"2",30,0,"Christopher Driscoll","KOBL 235","Topic: South Africa"],[0,2,1050,1125,"2",30,0,"Marco Better","KOBL 235","Topic: Israel"],[0,8,1050,1125,"2",30,0,"Richard Stewart","KOBL 255","Topic: UK/Ireland"],[0,16,660,735,"2",30,0,"Andrea Straccia","CHEY 140","Topic: Argentina"],[0,8,840,915,"2",30,0,"Stephanie Garriga-Snaider","KOBL 300","Topic: United Arab Emirates (UAE)"],[0,2,840,915,"2",30,0,"Cynthia Banks","KOBL 300","Topic: Croatia"],[0,2,660,735,"2",30,0,"Vanessa Napier","WVN 160","Topic: Switzerland"],[0,2,960,1035,"2",30,0,"Antonio Papuzza","KOBL 235","Topic: Italy"]]],["ASEN 6519","Special Topics","3",0,["Reflects upon specialized aspects of aerospace engineering sciences. Course content is indicated in the online Schedule Planner. Recommended prereq., varies. Requisites: Restricted to College of Engineering (ENGR) graduate students or Aerospace Engineering Concurrent Degree (C-ASEN) majors only.",[0,10,840,915,"3",19,0,"John Farnsworth","ECCR 139","Topic: Flow Control"],[0,10,570,645,"3",11,0,"Allison Anderson","FLMG 157","Topic: Extravehicular Activity"],[0,10,570,645,"3",19,0,"Peter Hamlington","ECCR 135","Topic: Reacting Flows"]]],["ANTH 6320","Linguistic Anthropology","3",0,["Serves as an advanced introduction to the empirical and theoretical foundations of contemporary linguistic anthropology, with special emphasis on the ways in which culture and society emerge semiotically through language and discourse. Same as LING 6320. Requisites: Restricted to graduate students only.",[3,4,690,840,"3",5,0,"Kira Hall","HLMS 285","Notes: This is a combined section class"]]],["ATLS 4040","Game Design","3",0,["None",[0,1,540,650,"3",5,0,"Matthew Bethancourt","ATLS 1B31","Notes: This is a combined section class"],[2,4,540,650,"3",5,0,"Matthew Bethancourt","ATLS 1B31","Notes: This is a combined section class"]]],["ASEN 5519","Selected Topics","3",0,["Reflects upon specialized aspects of aerospace engineering sciences. Course content is indicated in the online Class Search. Recommended prereq., varies. Requisites: Restricted to College of Engineering (ENGR) graduate students or Aerospace Engineering Concurrent Degree (C-ASEN) majors only.",[0,10,750,825,"3",24,0,"Kurt Maute","ECCR 131","Topic: Topology Opt. S&F Mechanics"],[0,10,1020,1095,"3",15,0,"Daniel Massey","FLMG 33","Topic: Design Thinking for National S"]]],["ARTH 6939","Graduate Seminar: Open Topics in Art History","3",0,["Subjects and topics vary. May be repeated up to 9 total credit hours. Requisites: Restricted to graduate students or Art History Concurrent Degree (C-AAAH) or Film & Art History Concurrent Degree (C-FILMAAAH) students only.",[3,2,840,990,"3",18,0,"Albert Alhadeff","VAC 303","Topic: The Late Picasso"]]],["ASEN 6028","Graduate Projects II","3",0,["Exposes MS and PhD students to leadership positions in project management and systems engineering while working a complex aerospace engineering project as part of a project team. The project team may perform some or all of the following project activities during this second semester of the two-semester course sequence: requirements definition, design and design review, build, test, and verification. Prereq., ASEN 5018. Recommended prereq., ASEN 4138, or 5148, or 5158 or equivalent or instructor consent required. Requisites: Restricted to College of Engineering (ENGR) graduate students or Aerospace Engineering Concurrent Degree (C-ASEN) majors only.",[0,2,1020,1070,"3",38,0,"Richard Hieb","ECCR 1B40","Notes: This is a combined section class"],[2,10,660,770,"3",3,0,"James Voss","See Class Notes For Room Info","Notes: This is a combined section class"],[2,20,780,890,"3",10,0,"Marcin Pilinski","See Class Notes For Room Info","Notes: This is a combined section class"],[2,5,900,1010,"3",5,0,"Lakshmi Kantha","See Class Notes For Room Info","Notes: This is a combined section class"],[2,5,780,890,"3",3,0,"Robert Marshall","See Class Notes For Room Info","Notes: This is a combined section class"],[2,10,960,1070,"3",5,0,"Daniel Kubitschek","See Class Notes For Room Info","Notes: This is a combined section class"],[2,5,540,650,"3",6,0,"James Nabity","See Class Notes For Room Info","Notes: This is a combined section class"],[2,5,900,1010,"3",5,0,"James Nabity","See Class Notes For Room Info","Notes: This is a combined section class"]]],["ATOC 5235","Introduction to Atmospheric Radiative Transfer and Remote Sensing","3",0,["Examines fundamentals of radiative transfer and remote sensing with primary emphasis on the Earth's atmosphere; emission, absorption and scattering by molecules and particles; multiple scattering; polarization; radiometry and photometry; principles of inversion theory; extinction- and emission-based passive remote sensing; principles of active remote sensing; lidar and radar; additional applications such as the greenhouse effect and Earth's radiative energy budget. ATOC graduate core course. Department enforeced prereq., one year of calculus-based physics, and math up through differential equations. Same as ASEN 5235. Requisites: Restricted to graduate students only.",[0,10,810,885,"3",14,0,"Sebastian Schmidt","SEEC S125","Notes: This is a combined section class"]]],["BUSM 2001","Principles of Marketing and Management","3",0,["Focuses on topics of marketing management and management of the firm, including the means by which firms use the \"four P\" decision variables of price, place, promotion, and product to create value for consumers and the marketplace.  In addition, students learn the skills needed to effectively lead and manage individuals and teams, leading to a more effective and efficient workplace. Department enforced prereq., any calculus or statistics course. Requisites: Restricted to students with Business Minor (BUSM-MIN) plan and 12 units completed.",[0,10,840,915,"3",113,0,"Tracy Jennings","GOLD A2B70"],[0,10,930,1005,"3",140,0,"Tracy Jennings","RAMY C250"]]],["AIRR 3020","Air Force Leadership Studies II","3",0,["Two 1 1/2-hour seminars and one 2-hour lab per week. Continuation of AIRR 3010. Emphasizes basic managerial processes while employing group discussions, case studies, and role playing as learning devices. Continues to emphasize the development of communicative skills.",[0,10,570,645,"3",44,0,"Staff","STAD 140"],[2,8,930,1130,"3",44,0,"Staff","DUAN G1B30"],[0,10,840,915,"3",31,0,"Staff","STAD 140"],[2,8,930,1130,"3",31,0,"Staff","DUAN G1B30"]]],["ASTR 3760","Solar and Space Physics","3",0,["Explores the physical processes linking the Sun and planets, emphasizing solar radiative and particulate variability and the response of planetary atmospheres and magnetospheres. Topics include the solar dynamo, solar wind, coronal mass ejections, cosmic ray modulation, magnetospheres, aurora, the space environment, and climate variability. Recommended prereq., PHYS 3310. Elective for APS major and minor. Requisites: Requires prerequisite or corequisite courses of PHYS 2130 or 2170 and MATH 2400 or APPM 2350 (all minimum grade C-).",[0,21,540,590,"3",36,0,"Mark Rast","DUAN G131"]]],["ASEN 5018","Graduate Projects I","3",0,["Exposes MS and PhD students to project management and systems engineering disciplines while working a complex aerospace engineering project as part of a project team. The project team may perform some or all of the following project activities during this first semester of the two-semester course sequence: requirements, definition, design and design review, build, test, and verification. Recommended prereqs., ASEN 4138, or 5148, or 5158 or equivalent or instructor consent required. Requisites: Restricted to Engineering (ENGR) graduate students or Aerospace Engineering-Concurrent Degree (C-ASEN) students.",[0,2,1020,1070,"3",24,0,"Richard Hieb","ECCR 1B40","Notes: This is a combined section class"],[2,10,660,770,"3",2,0,"James Voss","See Class Notes For Room Info","Notes: This is a combined section class"],[2,20,780,890,"3",7,0,"Marcin Pilinski","See Class Notes For Room Info","Notes: This is a combined section class"],[2,5,900,1010,"3",5,0,"Lakshmi Kantha","See Class Notes For Room Info","Notes: This is a combined section class"],[2,5,780,890,"3",3,0,"Robert Marshall","See Class Notes For Room Info","Notes: This is a combined section class"],[2,10,960,1070,"3",5,0,"Daniel Kubitschek","See Class Notes For Room Info","Notes: This is a combined section class"],[2,5,540,650,"3",0,0,"James Nabity","See Class Notes For Room Info","Notes: This is a combined section class"],[2,5,900,1010,"3",2,0,"James Nabity","See Class Notes For Room Info","Notes: This is a combined section class"]]],["ARTH 3109","Art in Contemporary Society","3",0,["Examines writings by philosophers and art critics as they address the question: What is art for? Readings focus on the 19th and 20th centuries, including current theories and some non-Western theories. Students are encouraged to develop their own responses to the question. Requisites: Restricted to Studio Arts (AASA or AASF) or Art History (AAAH) majors only.",[3,8,930,1070,"3",13,0,"George Rivera","VAC 1B23"]]],["AREN 5130","Optical Design for Illumination and Solid State Lighting","3",0,["Covers the optical design process for illumination-based optics, emphasis on applications in architectural lighting.  In-depth coverage of luminaire photometry, lamps, materials, manufacturing methods, product performance requirements.  Projects utilize optical design software, and include a variety of lamp types including LEDs using both reflector/lens optics.  Department enforced prereq., AREN 3540.  Same as AREN 4130.",[0,5,1050,1125,"3",23,0,"Mark Jongewaard","ECCR 118","Notes: This is a combined section class"]]],["ASTR 2840","Independent Study","1 - 3",0,["May be repeated up to 6 total credit hours. Instructor consent required.",[7,0,0,0,"1 - 3",5,0,"Erica Ellingson","TBA"]]],["ARSC 1720","SASC Coseminar: Calculus Work Group","1",0,["This 1-credit seminar provides motivated calculus students with more in-depth and more challenging coverage of material assumed in calculus. Students complete advanced problems that cannot be covered in calculus courses due to time constraints. Mastery of material is emphasized. Prereq., proficiency in pre-calculus mathematics. Recommended prereq., A/B average in pre-calculus sequence. Coreq., MATH1300.",[3,5,810,885,"1",1,0,"Maung Moon","FLMG 265"]]],["BCOR 1015","The World of Business","3",0,["Provides an overview of the nature business in a global economy.  In addition to exploring the economic, governmental, social and environmental context in which businesses operate, students will discover how business creates value and takes advantage of opportunities and challenges.  Using examples, cases and projects, students will learn about the business functions in an integrated format.  Weekly discussion of current events will focus on entrepreneurship, ethics, international business, business and society, and other topics.  Formerly BCOR 1010. Requisites: Restricted to Business majors or to Pre-Business A&S students with less than 52 units.",[0,10,570,645,"3",49,0,"Catherine Milburn","KOBL 220"],[0,10,660,735,"3",49,0,"Donald Oest","KOBL 220"],[0,5,840,915,"3",50,0,"Eric Alston","KOBL S127"],[0,5,570,645,"3",46,0,"Lorna Christoff","CHEY 240"],[0,5,660,735,"3",46,0,"Lorna Christoff","CHEY 240"],[0,10,660,735,"3",46,0,"Birdie Reznicek","CHEY 240"],[0,10,750,825,"3",47,0,"Birdie Reznicek","CHEY 240"],[0,5,570,645,"3",7,0,"Ronald Gwozdz","WVN 181A"],[0,5,660,735,"3",6,0,"Nancy Chapple","WVN 181A"],[0,5,780,855,"3",11,0,"Nancy Chapple","WVN 181A"],[0,10,780,855,"3",4,0,"Kenneth Schuetz","WVN 181A"],[0,10,870,945,"3",10,0,"Kenneth Schuetz","WVN 181A"]]],["ATLS 2519","Special Topics in Technology, Arts and Media","3",0,["Analyzes special interest areas of multidisciplinary technology, arts and media research and practice. Requisites: Restricted to students in the Atlas student group (PATL) only.",[0,10,660,735,"3",43,0,"Ian Hales","ATLS 100","Topic: Design Tech: Toolkit"],[0,1,660,770,"3",16,0,"Ian Hales","ATLS 1B31","Topic: Design Tech: Process"],[2,4,660,770,"3",16,0,"Ian Hales","ATLS 1B31","Topic: Design Tech: Process"],[0,2,660,770,"3",34,0,"David Schaal","ATLS 1B31","Topic: Design Tech: Process"],[2,8,660,770,"3",34,0,"David Schaal","ATLS 1B31","Topic: Design Tech: Process"]]],["ARAB 3120","Advanced Arabic 2","3",0,["Continues training in the four language skills (writing, speaking, reading, listening/comprehension) at an advanced level.  Enables students to acquire a better and broader understanding of Arabic culture and texts drawn from various genres of Arabic letters. Formerly ARAB 3020. Requisites: Requires prerequisite course of ARAB 3110 (minimum grade C).",[0,21,720,770,"3",6,0,"Mona Attwa","HLMS 152"]]],["ASTR 5800","Planetary Surfaces and Interiors","3",0,["Examines processes operating on the surfaces of solid planets and in their interiors. Emphasizes spacecraft observations, their interpretation, the relationship to similar processes on Earth, the relationship between planetary surfaces and interiors, and the integrated geologic histories of the terrestrial planets and satellites. Same as GEOL 5800. Requisites: Restricted to graduate students only.",[0,10,750,825,"3",10,0,"Brian Hynek","DUAN E126","Notes: This is a combined section class"]]],["BASE 2103","BCOR Applied Semester Experience 3: Mature Stage","3",0,["Builds on material covered in BCOR 2001, 2002, 2003. Provides students the opportunity to apply tools from the functional business disciplines. Business problems, solutions and decisions are addressed in the context of a mature stage business. May be repeated up to 6 total credit hours. Requisites: Requires prerequisite courses of BCOR 2001, 2002 and 2003 (all minimum  grade D-). Restricted to Business (BUSN) majors with 26-180 units completed.",[0,1,480,650,"3",149,0,"Richard Reed","KOBL S135"],[0,5,600,710,"3",143,0,"Mary Lewis","FLMG 155"],[0,1,660,830,"3",138,0,"Craig Stephenson","KOBL S135"],[0,5,900,1010,"3",146,0,"Joshua Neil","FLMG 155"],[0,10,480,590,"3",145,0,"Lori Seward","FLMG 155"]]],["BCOR 1030","Communication Strategy","3",0,["Helps develop basic communication skills to prepare you for success in the business world. This communication and social science theory-based, skill-building course is framed in Fiske and Cuddy's person perception theory that all people are perceived on two dimensions, competence and warmth. You will learn how to use communication skills to strategically demonstrate those dimensions. Requisites: Restricted to Business (BUSN) majors with 0 - 59 units completed.",[0,10,750,825,"3",25,0,"Kimberly Campbell","KOBL S110"],[0,10,840,915,"3",24,0,"Kimberly Campbell","KOBL S110"],[0,10,930,1005,"3",24,0,"Kimberly Campbell","KOBL 375"],[0,5,1020,1095,"3",25,0,"Salma Shukri","KOBL 300"],[0,5,840,915,"3",22,0,"Cory Cunningham","KOBL 330"],[0,20,480,555,"3",25,0,"Staff","KOBL 255"],[0,20,570,645,"3",23,0,"Cory Cunningham","KOBL 255"],[0,20,660,735,"3",25,0,"Cory Cunningham","KOBL 255"],[0,5,840,915,"3",25,0,"Jennifer Bone","KOBL 340"],[0,2,1080,1230,"3",25,0,"Kimberly Campbell","KOBL 302"],[0,5,840,915,"3",25,0,"Staff","KOBL 375"],[0,5,480,555,"3",25,0,"Jennifer Bone","KOBL S125"],[0,5,570,645,"3",24,0,"Bonnie Auslander","CHEY 140"],[0,5,660,735,"3",24,0,"Jennifer Bone","CHEY 140"],[0,5,750,825,"3",24,0,"Salma Shukri","CHEY 140"],[0,5,840,915,"3",24,0,"Salma Shukri","CHEY 140"],[0,10,750,825,"3",23,0,"Bradley Ludwig","CHEY 140"],[0,10,840,915,"3",24,0,"Bradley Ludwig","CHEY 140"],[0,10,930,1005,"3",24,0,"Bradley Ludwig","CHEY 140"],[0,5,690,765,"3",24,0,"Staff","CHEY 252A"]]],["CAMW 4001","Seminar on the American West","3",0,["Interdisciplinary capstone seminar for the Western American Studies certificate program. Applies a selected natural science, social science, or humanities topic to the American West and addresses how westerners can make and sustain viable landscapes and communities. Recommended prereqs., CAMW 2001 and completion of Western American Studies certificate electives. Requisites: Restricted to students with 57-180 credits (Juniors or Seniors).",[3,1,1080,1250,"3",16,0,"Jan Whitt","HUMN 270","Topic: Literature/Journalism of West"]]],["ARSC 4750","Social Foundations of Professional Life in Washington DC","3 - 4",0,["In this course, students will gain deep exposure to the historical, cultural, and socio-economic traditions and pressures that drive domestic and international policy making in Washington D.C. Students will read widely, prepare papers, and lead discussions on fundamental aspects of Washington's professional life. Course takes place in the nation's capital and is taken in conjunction with a professional internship. Restricted to CU in D.C. program participants.",[3,2,1080,1260,"3 - 4",14,0,"Jessica Gerrity, ","CU in DC Carnegie"]]],["APRD 4404","Advanced Ad Campaigns NSAC","3",1,["None",[0,1,990,1140,"3",0,19,"Harsha Gangadharbatla","ARMR 206A"]]],["ANTH 2100","Introduction to Cultural Anthropology","3",0,["Covers current theories in cultural anthropology and discusses the nature of field work. Explores major schools of thought and ethnographic fieldwork in a range of cultures studied by anthropologists. Required for Anthropology majors. Approved for arts and sciences core curriculum: human diversity.",[0,5,720,770,"3",87,0,"Kathryn Goldfarb","HUMN 150"],[1,4,900,950,"3",18,0,"Kathryn Goldfarb","MUEN D144"],[1,8,540,590,"3",24,0,"Kathryn Goldfarb","HALE 236"],[1,16,480,530,"3",22,0,"Kathryn Goldfarb","RAMY N1B31"],[1,4,960,1010,"3",23,0,"Kathryn Goldfarb","HALE 240"],[0,21,660,710,"3",12,0,"Katherine Fischer","LIBR N424A"]]],["ASEN 3200","Orbital Mechanics/Attitude Dynamics and Control","4",0,["Presents the fundamentals of orbital mechanics, 3D rigid body dynamics, and satellite attitude dynamics and controls. Offered spring only. Requisites: Requires prerequisite courses of ASEN 2003, ASEN 2004 and APPM 2360 (all minimum grade C).  Restricted to Aerospace Engineering (ASEN) majors only.",[0,10,930,1005,"4",16,1,"Daniel Scheeres, ","FLMG 155"],[2,16,600,710,"4",16,0,"Daniel Scheeres, ","ITLL 2B10"],[2,16,780,890,"4",0,1,"Daniel Scheeres, ","ITLL 2B10"]]],["ANTH 5020","Explorations in Anthropology","3",0,["Special topics in cultural and physical anthropology, as well as archaeology. Check with the department for semester offerings. May be repeated up to 9 total credit hours. Same as ANTH 4020. Requisites: Restricted to graduate students only.",[0,10,750,825,"3",5,0,"Lorecia Roland","CLUB 13","Topic: Star Trek and TNG of Anthro"]]],["ASTR 2050","The Sun and Society: Living with an Active Star","3",0,["None",[0,10,570,645,"3",48,0,"Steven Cranmer","DUAN G131"]]],["ARTH 5169","Topics in Ancient and Classical Art and Archaeology","3",0,["Same as CLAS 5169.",[0,10,660,735,"3",4,0,"Dimitri Nakassis","DUAN G1B35","Topic: Iron Age Greece"]]],["ATLS 4320","Mobile Application Development: Advanced Topics","3",1,["None",[0,2,660,770,"3",0,2,"Aileen Pierce","ATLS 104","Notes: This is a combined section class"],[2,8,660,770,"3",0,2,"Aileen Pierce","ATLS 104","Notes: This is a combined section class"]]],["ASTR 4840","Independent Study","1 - 3",0,["May be repeated up to 6 total credit hours. Instructor consent required.",[7,0,0,0,"1 - 3",20,0,"Ann Madigan","TBA"],[7,0,0,0,"1 - 3",20,0,"Staff","TBA"],[7,0,0,0,"1 - 3",20,0,"Staff","TBA"],[7,0,0,0,"1 - 3",20,0,"Staff","TBA"],[7,0,0,0,"1 - 3",20,0,"Erica Ellingson","TBA"],[7,0,0,0,"1 - 3",20,0,"Kevin France","TBA"]]],["BSLW 5120","Advanced Business Law","3",1,["Same as BSLW 4120. Requisites: Restricted to Accounting, Finance/Accounting, Information Systems/Accounting, Systems/Accounting Concurrent Degree students or Accounting, Accounting/Taxation or Business Administration (BUAD) graduate students only.",[0,10,930,1005,"3",0,2,"John Ballantine","KOBL 255","Notes: This is a combined section class"]]],["AIRR 1020","Foundations of the United States Air Force 2","1",0,["A continuation of AIRR 1010-1. One 1-hour lecture and one 2-hour lab per week.",[0,8,660,710,"1",34,0,"Staff","STAD 112"],[2,8,930,1130,"1",34,0,"Staff","DUAN G1B30"],[0,8,840,890,"1",35,0,"John Cacic","ECCR 245"],[2,8,930,1130,"1",35,0,"Staff","DUAN G1B30"]]],["ACCT 3220","Corporate Financial Reporting 1","3",0,["First of a two-course sequence intended to provide students with increased fluency in the language of business. Focuses on U.S. and international accounting concepts and methods that underlie financial statements and the related implications for interpreting financial accounting information. Requisites: Requires prerequisite courses of BCOR 2000 and BCOR 2200 or BCOR 2002 (all minimum grade D-). Restricted to Business (BUSN) majors with 52-180 units completed.",[0,5,660,735,"3",0,4,"Frances Tice","KOBL 302"],[0,5,750,825,"3",19,0,"Frances Tice","KOBL 302"],[0,5,840,915,"3",22,0,"Frances Tice","KOBL 302"]]],["APRD 3003","Strategic Communication Research Methods","3",0,["Provides an opportunity to use and master quantitative and qualitative research methods. Students conduct research and analyze data to determine the targets relationship with specific product categories and identify the emotional and practical needs that create brand relationships. Similar to JOUR 4533. Requisites: Requires a prerequisite course of APRD 2000 or JOUR 2403 (minimum grade D-). Restricted to Strategic Communication (STCM) or Advertising (JADV) majors only.",[0,10,840,915,"3",16,0,"Seow Lee","ENVD 1B90"],[0,21,660,710,"3",15,0,"Jennifer Colman","ECCR 108"],[0,8,1080,1230,"3",0,0,"Lisa Poole","DUAN G2B60"]]],["ATLS 5151","Flow Visualization","3",0,["None",[0,21,660,710,"3",5,0,"Jean Hertzberg","ITLL 1B50","Notes: This is a combined section class"]]],["ASTR 2020","Space Astronomy and Exploration","3",0,["Covers physical principles of performing astronomy from space for science and exploration. The basic design of launch vehicles and spacecraft, orbital dynamics, and instruments will be described in the context of specific space missions (e.g. Hubble Telescope, Mars rovers) as well as prospects for future space observatories in orbit and on the Moon. Approved for arts and sciences core curriculum: natural science.",[0,21,900,950,"3",67,0,"Jack Burns","DUAN G125"]]],["ASEN 5037","Turbulent Flows","3",0,["Studies turbulent closure methods and computational procedures used to solve practical turbulent flows. Emphasizes multi-equation models used with time-averaged equations to calculate free-turbulent shear-flows and turbulent boundary layers. Employs spectral methods in direct and large-eddy simulation of turbulence. Recommended prereq., ASEN 5051 or equivalent or instructor consent required. Formerly ASEN 6037. Requisites: Restricted to College of Engineering (ENGR) graduate students or Aerospace Engineering Concurrent Degree (C-ASEN) majors only.",[0,10,660,735,"3",6,0,"John Evans","ECCR 131","Notes: This is a combined section class"]]],["APRD 4931","Internship","1 - 6",0,["None",[8,15,480,1080,"1 - 6",40,0,"Amos Gelb","CU in DC Carnegie"]]],["AREN 4315","Design of Masonry Structures","3",0,["Covers modern masonry construction; properties and behavior of the reinforced masonry component materials, clay and concrete masonry units, mortar, grout, and steel reinforcement; vertical and lateral load types and intensities; and design of reinforced masonry walls, beams, and columns by working stress and strength design methods. Requisites: Requires prerequisite course of CVEN 3525  (minimum grade C-).",[0,10,750,825,"3",30,0,"Michael Schuller","ECCR 155","Notes: This is a combined section class"]]],["ATLS 3519","Special Topics in Technology, Arts, and Media","3",0,["Analyzes special interest areas of multidisciplinary technology, arts and media research and practice. May be repeated up to 12 total credit hours for different topics.  Recommended prereq., ATLS 3010.  Same as ATLS 5519 and 6519.",[0,10,930,1005,"3",3,0,"Elianna James","ATLS 1B31","Topic: Universal Des Digital Media"],[0,5,660,735,"3",1,0,"Victor Braha","ATLS 1B25","Topic: Design for the Web"],[0,2,750,860,"3",0,3,"Arielle Hein","ATLS 113","Topic: Object"],[2,8,750,860,"3",0,3,"Arielle Hein","ATLS 113","Topic: Object"],[0,2,930,1040,"3",6,0,"Staff","ATLS 113","Topic: Object"],[2,8,930,1040,"3",6,0,"Staff","ATLS 113","Topic: Object"],[0,1,780,890,"3",7,0,"Kevin Hoth","ATLS 104","Topic: Alternative Digital Imaging"],[2,4,780,890,"3",7,0,"Kevin Hoth","ATLS 104","Topic: Alternative Digital Imaging"],[0,2,540,650,"3",4,0,"Daniel Rankin","ATLS 113","Topic: Materials"],[2,8,540,650,"3",4,0,"Daniel Rankin","ATLS 113","Topic: Materials"],[0,2,540,650,"3",8,0,"Arielle Hein","ENVD 234A","Topic: Interface Design"],[2,8,540,650,"3",8,0,"Arielle Hein","ENVD 234A","Topic: Interface Design"],[0,2,930,1040,"3",0,3,"Christopher Carruth","ENVD 234A","Topic: Advanced Image"],[2,8,930,1040,"3",0,3,"Christopher Carruth","ENVD 234A","Topic: Advanced Image"]]],["AREN 6960","Master's Report","1 - 3",0,["None",[7,0,720,720,"1 - 3",20,0,"Staff","TBA"]]],["ARSC 1492","MASP Research Seminar","1 - 3",0,["Enhances students' knowledge and appreciation of the humanities, the social sciences or STEM-related fields. The course's readings, discussions, cooperative learning exercises, work-shopping papers and presentations, guest speakers, and outside activities are designed to enhance both students' appreciation of the subject matter and their performance in their regular courses. Emphasis will be placed on actively using knowledge of humanities, social sciences or STEM fields in a variety of ways. Department consent required. May be repeated up to 6 total credit hours.",[3,4,960,1035,"1 - 3",15,0,"Karen Ramirez, ","CLRE 104"]]],["ASTR 5150","Introductory Plasma Physics","3",0,["Includes basic phenomena of ionized gases, static and dynamic shielding, linear waves, instabilities, particles in fields, collisional phenomena, fluid equations, collisionless Boltzman equations, Landau damping, scattering and absorption of radiation in plasmas, elementary nonlinear processes, WKB wave theory, controlled thermonuclear fusion concepts, astrophysical applications, and experimental plasma physics (laboratory). Same as PHYS 5150. Requisites: Restricted to graduate students only.",[0,10,750,825,"3",10,0,"Dmitri Uzdensky","DUAN G2B41","Notes: This is a combined section class"]]],["ARSC 4909","Senior Thesis for Individually Structured Major","2 - 6",0,["May be repeated up to 6 total credit hours.",[9,0,0,0,"2 - 6",10,0,"Mary Osnes","TBA"],[9,0,0,0,"2 - 6",10,0,"Jennifer Knight","TBA"],[9,0,0,0,"2 - 6",10,0,"Ajume Wingo","TBA"],[9,0,0,0,"2 - 6",10,0,"Rebecca Safran","TBA"],[9,0,0,0,"2 - 6",10,0,"Polly Mclean","TBA"],[9,0,0,0,"2 - 6",10,0,"Petger Schaberg","TBA"]]],["BSLW 4900","Independent Study","1 - 3",0,["None",[7,0,0,0,"1 - 3",100,0,"Staff","TBA"],[7,0,0,0,"1 - 3",100,0,"Staff","TBA"],[7,0,0,0,"1 - 3",100,0,"Staff","TBA"],[7,0,0,0,"1 - 3",100,0,"Staff","TBA"],[7,0,0,0,"1 - 3",100,0,"Staff","TBA"]]],["ASEN 5022","Dynamics of Aerospace Structures","3",0,["Applies concepts covered in undergraduate dynamics, structures, and mathematics to the dynamics of aerospace structural components, including methods of dynamic analysis, vibrational characteristics, vibration measurements, and dynamic stability. Recommended prereqs., ASEN 5012, 5227, MATH 3130, or APPM 3310 or equivalent or instructor consent required. Requisites: Restricted to College of Engineering (ENGR) graduate students or Aerospace Engineering Concurrent Degree (C-ASEN) majors only.",[0,10,570,645,"3",20,0,"Sanghamitra Neogi","FLMG 104"]]],["ARTF 5004","Topics in Film Theory","3",0,["Provides topic-centered analyses of controversial areas in film theory. Students read extensive materials in the topic area, analyze and summarize arguments as presented in the literature, write \"Position\" papers, and make oral presentations in which they elaborate their own arguments about specific assigned topic, establishing critical dialogue with the primary materials. May be repeated up to 6 total credit hours. Same as FILM 4004. Requisites: Requires prerequisite course of FILM 3051 (minimum grade D-). Restricted to graduate students only.",[3,10,840,915,"3",5,0,"Staff","ATLS 1B29","Topic: Science on Screen"]]],["ARTH 4269","Art and Archaeology of the Ancient Near East","3",0,["Examines civilizations of the Iran-Iraq region from the rise of urbanism in Mesopotamia through the era of the first 'world empire,' Achaemenid Persia. Emphasizes the material record of religious and state institutions of the ancient Near East, especially monuments that illustrate concepts of kingship. Explores notions of style, symbolism, visual rhetoric, text-image synthesis, patronage, creativity, and roles of artists. Recommended prereq., CLAS/ARTH 1509. Same as CLAS 4269. Approved for arts and science core curriculum: human diversity.",[0,10,570,645,"3",1,3,"Elspeth Rogers M. Dusinberre","GUGG 2","Notes: This is a combined section class"]]],["BADM 6930","Commercializing Sustainable Energy Technologies","3",0,["Addresses the opportunities and problems of commercializing new renewable energy technologies.  Focuses on energy markets, opportunity identification, life cycle analysis, policy economics, project financing, and economic analysis as they relate to bringing renewable energy technologies to market. Same as ENST 5002.",[0,4,1020,1170,"3",17,0,"Jeffrey York","SEEC N124","Notes: This is a combined section class"]]],["ATLS 4214","Big Data Architecture","3",1,["Provides students with a comprehensive survey of technologies used today in the collection, storage, processing, analytics and display of big data. The course focuses on cultivating real world skills with students working on semester long projects to execute on a group project. Same as ATLS 5214. Requisites: Requires prerequisite course of CSCI 2270 (minimum grade D-).",[0,5,1050,1125,"3",0,1,"Gregory Greenstreet","ATLS 100","Notes: This is a combined section class"]]],["ACCT 4850","Senior Seminar - Accounting Ethics","3",1,["This seminar examines the nature of accounting theory and practice from perspectives of economics, law, globalization, accounting, ethics, and moral reasoning. This course also explores issues including implications of institutional factors, such as Sarbanes-Oxley, SEC, FASB, IFRS, and capital markets. Department enforeced prereq., one 4000-level ACCT course. Requisites: Requires prerequisite course of ACCT 3230 or ACCT 3225 (minimum grade D-).  Restricted to Accounting (ACCT) majors with 102-180 units completed.",[3,20,480,555,"3",0,10,"Randy Johnston","KOBL 308"],[3,20,570,645,"3",0,12,"Randy Johnston","KOBL 308"]]],["ANTH 2200","The Archaeology of Human History","3",0,["Where do we come from? This course provides a brief introduction to the practice of archaeology and then emphasizes the evidence for major events/transitions in human history over the last 2.5 million years. Required for ANTH majors. Approved for arts and scicences core curriculum: historical context.",[0,5,840,890,"3",130,0,"Catherine Cameron","HUMN 150"],[1,8,540,590,"3",24,0,"Staff","HLMS 185"],[1,16,540,590,"3",23,0,"Staff","MUEN D439"],[1,8,900,950,"3",23,0,"Staff","ECCR 108"],[1,4,960,1010,"3",24,0,"Staff","HLMS 263"],[1,8,540,590,"3",23,0,"Staff","MUEN E123"],[1,4,900,950,"3",13,0,"Staff","HALE 240"]]],["ARTH 5029","Art History Research Methods","1",0,["Learn to expertly navigate art scholarship and be prepared to do thesis-level research. This course is an introduction to the vast array of art historical resources and their uses. Explore advanced techniques for searching both online and offline sources of art information. Master the various modes of art historical research, including finding iconographic, historical, or technical information. Same as LIBR/ARTH 4029. Requisites: Restricted to graduate students only.",[0,4,840,915,"1",15,0,"Alexander Watkins","SEE DEPT","Notes: This is a combined section class"]]],["ATLS 2036","Introduction to Media Studies in the Humanities","3",0,["Serves as an introduction to media studies specifically from a humanities perspective. Studies both histories and theories of media from the 20th and 21st centuries. Touches on methodologies for undertaking media studies (including distant ready and media archaeology). Objects of study may include such topics as film, radio, social media platforms and games, as well as digital art and literature. Same as ENGL 2036. Requisites: Restricted to students in the Atlas student group (PATL) only.",[3,10,840,915,"3",8,0,"Mark Winokur","HUMN 190","Notes: This is a combined section class"],[3,10,750,825,"3",5,0,"Mark Winokur","HUMN 190","Notes: This is a combined section class"]]],["ASEN 1400","Gateway to Space","3",0,["Introduces the basics of atmosphere and space sciences, space exploration, spacecraft design, rocketry, and orbits.  Students design, build, and launch a miniature satellite on a high altitude balloon.  Explores the current research in space through lectures from industry.  Formerly ASEN 2500. Same as ASTR 2500. Requisites: Restricted to students with 0-26 (Freshmen) College of Engineering majors only.",[0,10,570,645,"3",48,0,"Christopher Koehler","ITLL 1B50","Notes: This is a combined section class"]]],["ASEN 5235","Introduction to Atmospheric Radiative Transfer and Remote Sensing","3",0,["Examines fundamentals of radiative transfer and remote sensing with primary emphasis on the Earth's atmosphere; emission, absorption and scattering by molecules and particles; multiple scattering; polarization; radiometry and photometry; principles of inversion theory; extinction- and emission-based passive remote sensing; principles of active remote sensing; lidar and radar; additional applications such as the greenhouse effect and Earth's radiative energy budget. Recommended prereq., one year of calculus-based physics and math up through differential equations. Same as ATOC 5235. Requisites: Restricted to College of Engineering (ENGR) graduate students or Aerospace Engineering Concurrent Degree (C-ASEN) majors only.",[0,10,810,885,"3",13,0,"Sebastian Schmidt","SEEC S125","Notes: This is a combined section class"]]],["ACCT 5450","Income Taxation of Business Entities","3",0,["Examines the income tax consequences of business entities. Focuses on regular corporations, partnerships, limited liability companies and S corporations. Same as ACCT 4825. Requisites: Requires prerequisite course of ACCT 3230 (minimum grade D-).  Restricted to Accounting (ACCT), Accounting Taxation (ACTX) or Business Administration (BUAD) graduate students only.",[3,10,660,735,"3",12,0,"Susan Morley","KOBL S110","Topic: Bus Entity Taxation"],[3,15,465,555,"3",35,0,"Susan Morley","KOBL 102","Topic: Bus Entity Taxation"]]],["APRD 4523","Portfolio 2","3",0,["Gives students an opportunity to develop an extensive body of work.  Students create integrated campaigns, which include print, digital and guerilla ideas.  Final portfolios are critiqued by both faculty and outside reviewers.  Instructor consent required. Requisites: Requires a prerequisite course of  APRD 4503/JOUR 4503 (minimum grade D-). Restricted to Strategic Communication (STCM) majors only.",[0,2,1080,1230,"3",19,0,"Jon Ligon","ENVD 1B90"],[0,10,750,825,"3",19,0,"Glenn Griffin","ENVD 1B90"]]],["ASTR 1030","Accelerated Introductory Astronomy 1","4",0,["Covers principles of modern astronomy summarizing our present knowledge about the Earth, Sun, moon, planets, and origin of life. Requires nighttime observation sessions at Sommers-Bausch Observatory. Required in ASTR major/minor. Students may receive credit for only one of ASTR 1030, 1010, 1000, or 1110. Similar to ASTR 1010 and 1000, but taught at a higher intellectual level, including a significant amount of quantitative analysis.  Approved for GT-SC1.  Approved for arts and sciences core curriculum: natural science. Requisites: Requires prerequisite or corequisite course of MATH 1300 or APPM 1350 or APPM 1340 and APPM 1345 (all minimum grade C-).",[0,10,930,1005,"4",67,0,"Ann Madigan","DUAN G130"],[2,1,600,705,"4",14,0,"Staff","OBSV S175"],[2,1,720,825,"4",10,0,"Staff","OBSV S175"],[2,1,840,945,"4",13,0,"Staff","OBSV S175"],[2,16,660,765,"4",15,0,"Staff","OBSV S175"],[2,16,780,885,"4",15,0,"Staff","OBSV S175"]]],["ARSC 1080","College Writing and Research","4",0,["Introduces academic and professional genres through the research and inquiry process. Students practice close reading, oral presentation, drafting, synthesis, analysis and research skills in discussion, writing workshops, and one-on-one conferences. Meets MAPS requirement for English. Approved for arts and sciences core curriculum: written communication.",[0,5,600,675,"4",4,0,"Marlene Miyamoto","FLMG 244"],[0,5,780,855,"4",12,0,"Marlene Miyamoto","FLMG 244"],[0,10,570,645,"4",8,0,"Shane Oshetski","FLMG 241"]]],["APRD 1001","Creative Concepts","3",0,["Introduces students to a disciplined process that is used to create innovative solutions across commercial communication fields. The course emphasizes approaches to problem identification and solution that combine research and human insight with a variety of creative thinking techniques. Topics include need finding, structured brainstorming, rapid sketching, storytelling and visual communication. Similar to JOUR 3453. Requisites: Requires a prerequisite course of APRD 1000 or JOUR 2403 (minimum grade D-). Restricted to Strategic Communication (STCM) or Advertising (JADV) majors only.",[0,8,1080,1230,"3",20,0,"Tom Leydon","HUMN 190"],[0,1,1080,1230,"3",18,0,"Allen Richardson, ","HLMS 247"],[0,10,660,735,"3",10,0,"Glenn Griffin","ENVD 1B90"],[0,21,780,830,"3",19,0,"Jon Ligon","ENVD 1B90"],[0,21,720,770,"3",18,0,"Jeff Curry","ENVD 1B90"],[0,2,1080,1230,"3",20,0,"Celeste Mckeon, ","HLMS 263"],[0,4,1080,1230,"3",19,0,"Christopher Giangreco, ","HUMN 190"],[0,2,1080,1230,"3",20,0,"Scott Hooten","HLMS 255"]]],["ATOC 5060","Dynamics of the Atmosphere and Oceans","3",0,["Examines large-scale motions in a stratified rotating atmosphere, and quasi-geostrophic flow, barotropic and baroclinic instabilities, cyclogenesis, global circulations, and boundary layer processes. Ageostrophic motions, including Kelvin waves, internal gravity waves, and the theory of frontogenesis are also considered. Department enforced prereq., ATOC 5050, one year of college chemistry and calculus-based physics and math up through differential equations.  ATOC graduate core course. Requisites: Restricted to graduate students only.",[0,10,630,705,"3",28,0,"Jeffrey Weiss","SEEC S125"]]],["BCOR 2001","Principles of Marketing and Management","3",0,["Focuses on the basic principles of marketing and management. Within the marketing domain, students will be exposed to the role of marketing within a market economy, along with managerial decision making with respect to the marketing mix variables of price, product promotion and distribution. Within the management domain, students will learn how modern businesses compete in the global marketplace by utilizing the knowledge and skills of managers. Credit not granted for this course and BCOR 2300 and BCOR 2400. Requisites: Requires prerequisite courses of BCOR 1015 and BCOR 1025 and ECON 2010 (all minimum  grade D-). Restricted to Business (BUSN) majors with 26-180 units completed.",[0,10,660,735,"3",65,0,"Bahriye Goren, ","KOBL 210"],[0,10,750,825,"3",73,0,"Bahriye Goren, ","KOBL 210"],[0,10,840,915,"3",73,0,"Bahriye Goren, ","KOBL 210"],[0,10,930,1005,"3",72,0,"Bahriye Goren, ","KOBL 210"]]],["ARSC 2400","MASP Coseminar: Organic Chemistry","1",0,["Supplements and strengthens student experiences in organic chemistry. Allows gifted students an opportunity to extend their understanding of the subject and to explore possible careers in science. May be repeated up to 2 total credit hours.",[3,5,840,915,"1",15,0,"Staff","FLMG 170","Topic: SASC CO-SEM: Org Chem 1"]]],["APRD 3007","Curiosity for Strategists","3",1,["Introduces students to the practice of curiosity as the basis of creative problem solving. Students will participate in exercises and exploration based projects to increase productive curiosity, critical thinking and creative products, which will inform the development of integrated marketing communication campaigns. Requisites: Requires a prerequisite course of APRD 2000 (minimum grade D-). Restricted Strategic Communication (STCM) majors only.",[0,2,1080,1230,"3",0,4,"Staff","HALE 260"]]],["APRD 1002","Introduction to Branding","3",0,["Designed to help students acquire a basic understanding of brand and brand culture. Emphasis on theories and practical problems to learn effective ways of building a strong brand strategy. This encompasses every facet of making strategic decisions for a brand. This involves understanding the content a consumer requires, how the consumer will come in contact with the brand, and what is the goal of the relationship between consumer and content. Similar to JOUR 3403. Requisites: Requires a prerequisite course of APRD 1000 or JOUR 2403 (minimum grade D-). Restricted to Strategic Communication (STCM) or Advertising (JADV) majors only.",[0,10,930,1005,"3",30,0,"Erin Willis","EKLC E1B75"],[0,10,570,645,"3",22,0,"Irma Fisher","KTCH 1B71"],[0,10,840,915,"3",24,0,"Jennifer Colman","ENVD 122"],[0,21,540,590,"3",25,0,"Jennifer Colman","KTCH 1B87"],[0,2,1080,1230,"3",30,0,"Ann Boyd","HLMS 251"],[0,1,1080,1230,"3",30,0,"Molly Katz","HLMS 245"],[0,2,1080,1230,"3",30,0,"Staff","MUEN D144"],[0,4,1080,1230,"3",30,0,"Kiersten Bagley","KTCH 1B60"]]],["AREN 4606","Construction Project Execution and Control","3",0,["Integrates project execution and control techniques for construction scope, cost and schedule.  Includes progress measurement, resource planning, earned value methods, productivity, risk management methods and progress visualization. Requisites: Requires prerequisite courses of CVEN 3246 and AREN 4506 (all minimum grade C-). Restricted to students with 57-180 credits (Junior or Senior) Civil (CVEN), Architectural (AREN) or General (GEEN) Engineering  majors only.",[0,10,840,915,"3",29,0,"Matthew Morris","FLMG 33"]]],["ATLS 5519","Advanced Special Topics in Technology, Arts, and Media","3",0,["Same as ATLS 3519, 4519. Requisites: Restricted to graduate students only.",[0,2,960,1110,"3",15,0,"Jonathan Black","ENVD 234A","Topic: Design Studio"],[0,5,900,975,"3",15,0,"Daniel Szafir","ATLS 1B31","Topic: Human-Robot Interaction"],[0,5,660,735,"3",4,0,"Mark Gross","ATLS 113","Topic: Wearable Technologies"],[0,5,900,975,"3",4,0,"Daniel Leithinger","ATLS 113","Topic: Physical Comp Interfaces"],[0,1,780,890,"3",18,0,"Jeffrey Harriman","ATLS 113","Topic: Creative Technologies"],[2,4,780,890,"3",18,0,"Jeffrey Harriman","ATLS 113","Topic: Creative Technologies"],[0,2,600,750,"3",14,0,"Jill Dupre","ATLS 225","Topic: Proseminar: Bus Creativity"],[0,2,960,1110,"3",15,0,"Jill Dupre","ATLS 225","Topic: Design Thesis"],[0,2,540,650,"3",5,0,"Aileen Pierce","ATLS 104","Notes: This is a combined section class"],[2,8,540,650,"3",5,0,"Aileen Pierce","ATLS 104","Notes: This is a combined section class"],[0,1,960,1070,"3",5,0,"John Bacus","ATLS 104","Topic: Product Development Studio"],[2,4,960,1070,"3",5,0,"John Bacus","ATLS 104","Topic: Product Development Studio"]]],["ASTR 3740","Cosmology and Relativity","3",0,["Special and general relativity as applied to astrophysics, cosmological models, observational cosmology, experimental relativity, and the early universe. Elective for APS major and minor. Requisites: Requires prerequisite or corequisite courses of PHYS 2130 or 2170 and MATH 2400 or APPM 2350 (all minimum grade C-).",[0,21,600,650,"3",30,0,"Jeremiah Darling","DUAN G131"]]],["ACCT 5827","Integrated Reporting for Socially Responsible Strategies","3",1,["Explores the growing global trend of companies to measure, disclose and report for socially responsible initiatives.  Integrated reporting combines financial, environmental, social and governance information into a single report.  Current practices in sustainability and integrated reporting in the US and across the world will be examined/learned through case studies, guest speakers, current literature and projects.  Can be taken concurrently with BCOR 3010 and ACCT 3220.  Same as ACCT 4827. Requisites: Restricted to Accounting, Finance/Accounting, Information Systems/Accounting, Systems/Accounting Concurrent Degree students or Accounting, Accounting/Taxation or Business Administration (BUAD) graduate students only.",[0,10,750,825,"3",0,1,"Catherine Milburn","KOBL 375","Notes: This is a combined section class"]]],["ATLS 5214","Big Data Architecture","3",0,["Provides students with a comprehensive survey of technologies used today in the collection, storage, processing, analytics and display of big data. The course focuses on cultivating real world skills with students working on semester long projects to execute on a group project. Same as ATLS 4214. Requisites: Requires prerequisite course of CSCI 2270 (minimum grade D-).",[0,5,1050,1125,"3",18,0,"Gregory Greenstreet","ATLS 100","Notes: This is a combined section class"]]],["ARTH 4029","Art History Research Methods","1",0,["Learn to expertly navigate art scholarship and be prepared to do thesis-level research. This course is an introduction to the vast array of art historical resources and their uses. Explore advanced techniques for searching both online and offline sources of art information. Master the various modes of art historical research, including finding iconographic, historical, or technical information. Same as LIBR 4029 and ARTH 5029.",[0,4,840,915,"1",15,0,"Alexander Watkins","SEE DEPT","Notes: This is a combined section class"]]],["ARTH 4929","Special Topics in Art History","1 - 3",0,["May be repeated up to 18 total credit hours when topic varies. Same as ARTH 5929.",[0,10,660,735,"1 - 3",21,0,"Brianne Cohen","VAC 308","Topic: Eco Aesthetics"],[0,4,900,1005,"1 - 3",21,0,"Robert Nauman","VAC 455"]]],["ATLS 8990","Doctoral Dissertation","1 - 10",0,["Approved research conducted under the supervision of members of the graduate faculty. Investigates some specialized topic or field in the area of interdisciplinary information and communication technology. All doctoral students must register for at least 30 hours of dissertation credit as part of the requirement for the ATLAS doctoral degree. Requisites: Restricted to Atlas (ATLS) graduate students only.",[6,0,0,0,"1 - 10",5,0,"Amy Voida","TBA"],[6,0,0,0,"1 - 10",5,0,"Staff","TBA"],[6,0,0,0,"1 - 10",5,0,"Pei Hsiu Yeh","TBA"],[6,0,0,0,"1 - 10",5,0,"Lecia Barker","TBA"],[6,0,0,0,"1 - 10",5,0,"Jill Dupre","TBA"],[6,0,0,0,"1 - 10",5,0,"Mark Gross","TBA"],[6,0,0,0,"1 - 10",5,0,"Clayton Lewis","TBA"],[6,0,0,0,"1 - 10",5,0,"Noah Finkelstein","TBA"],[6,0,0,0,"1 - 10",5,0,"Ryan Shapiro","TBA"],[6,0,0,0,"1 - 10",5,0,"Daniel Szafir","TBA"]]],["ANTH 4160","Early Hominin Paleoecology","3",1,["Explores current thinking about the diets, environments and lives of early human ancestors and their close kin. There is a strong emphasis on the methods used to construct such knowledge. Same as ANTH 5160.",[0,4,720,870,"3",0,0,"Matthew Sponheimer","HALE 450","Notes: This is a combined section class"]]],["ARSC 1470","MASP Natural Science Seminar","1",0,["None",[3,2,570,645,"1",15,0,"Katharine Semsar","ENVD 122"]]],["ATOC 3500","Air Chemistry and Pollution","3",0,["Examines the composition of the atmosphere, and sources of gaseous and particulate pollutants: their chemistry, transport, and removal from the atmosphere. Applies general principles to acid rain, smog, and stratospheric ozone depletion. Department enforced prereqs., two semesters of chemistry. Same as CHEM 3151. Approved for arts and sciences core curriculum: natural science.",[0,10,540,615,"3",5,0,"Darin Toohey","SEEC N126","Notes: This is a combined section class"]]],["BASE 2101","BCOR Applied Semester Experience 1: Early Stage","3",0,["Builds on material covered in BCOR 2001, 2002, 2003. Provides students the opportunity to apply tools from the functional business disciplines. Business problems, solutions and decisions are addressed in the context of an early stage business. May be repeated up to 6 total credit hours. Requisites: Requires prerequisite courses of BCOR 2001, 2002 and 2003 (all minimum  grade D-). Restricted to Business (BUSN) majors with 26-180 units completed.",[0,1,480,650,"3",149,0,"Richard Reed","KOBL S135"],[0,5,600,710,"3",143,0,"Mary Lewis","FLMG 155"],[0,1,660,830,"3",138,0,"Craig Stephenson","KOBL S135"],[0,5,900,1010,"3",146,0,"Joshua Neil","FLMG 155"],[0,10,480,590,"3",145,0,"Lori Seward","FLMG 155"]]],["ARSC 3935","Internship","1 - 6",0,["May be repeated up to 6 total credit hours.",[8,31,480,1020,"1 - 6",5,0,"Tracey-Katherine Rousseau","CU in DC Carnegie"]]],["ASTR 5400","Introduction to Fluid Dynamics","3",0,["Covers equations of fluid motion relevant to planetary atmospheres and oceans, as well as stellar atmospheres; effects of rotation and viscosity; and vorticity dynamics, boundary layers, and wave motions. Introduces instability theory, nonlinear equilibration, and computational methods in fluid dynamics. Same as ATOC 5400. Requisites: Restricted to graduate students only.",[0,21,600,650,"3",25,0,"Benjamin Brown","DUAN E126"]]],["ASEN 4028","Senior Projects 2: Design Practicum","4",0,["Focuses on the fabrication, integration, verification and validation of designs produced in ASEN 4018. Students work within the same teams from ASEN 4018.  Department consent required. Offered spring only. Requisites: Requires prerequisite course of ASEN 4018 (minimum grade C).  Restricted to Aerospace Engineering (ASEN) majors only.",[0,5,960,1010,"4",40,0,"Dale Lawrence","RAMY C250"],[2,10,736,836,"4",40,0,"Dale Lawrence","See Class Notes For Room Info"]]],["ATOC 3180","Aviation Meteorology","3",0,["Familiarizes students with a wide range of atmospheric behavior pertinent to air travel: rudiments of aerodynamics; aircraft stability and control; atmospheric circulation, vertical motion, turbulence, and wind shear; fronts, clouds, and storms. Department enforced prereq., ATOC 1050. Approved for arts and sciences core curriculum: natural science.",[0,5,855,930,"3",30,0,"Katja Friedrich","SEEC N128"]]],["ATOC 5900","Independent Study","1 - 6",0,["May be repeated up to 6 total credit hours. Students may register for more than one section of this course in the same semester. Requisites: Restricted to graduate students only.",[7,0,0,0,"1 - 6",100,0,"Staff","SEE DEPT"],[7,0,0,0,"1 - 6",100,0,"Staff","SEE DEPT"],[7,0,0,0,"1 - 6",100,0,"Staff","SEE DEPT"],[7,0,0,0,"1 - 6",100,0,"Staff","SEE DEPT"],[7,0,0,0,"1 - 6",100,0,"Staff","SEE DEPT"]]],["ATOC 1050","Weather and the Atmosphere","3",0,["Introduces principles of modern meteorology for nonscience majors, with emphasis on scientific and human issues associated with severe weather events. Includes description, methods of prediction, and impacts of blizzards, hurricanes, thunderstorms, tornadoes, lightning, floods, and firestorms. Approved for GT-SC1. Meets MAPS requirement for natural science: non-lab. Approved for arts and sciences core curriculum: natural science.",[0,10,570,645,"3",301,0,"Melissa Nigro","DUAN G1B30"],[0,10,930,1005,"3",305,0,"Staff","CHEM 140"]]],["ATOC 4900","Independent Study","1 - 3",0,["May be repeated up to 6 total credit hours. Prereq., instructor consent.",[7,0,0,0,"1 - 3",10,0,"Staff","SEE DEPT"],[7,0,0,0,"1 - 3",10,0,"Staff","SEE DEPT"],[7,0,0,0,"1 - 3",10,0,"Staff","SEE DEPT"],[7,0,0,0,"1 - 3",10,0,"Staff","SEE DEPT"],[7,0,0,0,"1 - 3",10,0,"Staff","SEE DEPT"]]],["ASTR 3520","Observations and Instrumentation 2","4",0,["Lab course in observation and instrumentation. Hands-on exercises include obtaining and analyzing multi-wavelength data, optical design and instrumentation, and statistical analysis, with emphasis on spectroscopy. A significant number of night time observation sessions are required. Elective for APS majors.  Elective for APS minors on space available basis. Requisites: Requires a prerequisite course of ASTR 3510 (minimum grade C-). Restricted to Astrophysics (ASTR) majors only.",[0,10,570,645,"4",5,0,"Kevin France","DUAN E126"],[2,2,1110,1220,"4",5,0,"Staff","OBSV S125"]]],["APRD 4543","Strategic Brand Management","3",0,["Examines the theory of branding: what brands are, how brands are created and measured, as well as strategies for managing brands and brand communication. Requisites: Requires prerequisite course of APRD 3002 or JOUR 3463 (minimum grade D-). Restricted to Strategic Communication (STCM) or Advertising (ADVT-BSJR or JADV-BSJR) majors only with 57-180 credits (Juniors or Seniors).",[0,10,660,735,"3",0,7,"William Weintraub","STAD 136C","Notes: This is a combined section class"],[0,1,1110,1260,"3",40,0,"Amos Gelb","CU in DC Carnegie","Notes: This is a combined section class"]]],["AREN 4830","Special Topics for Seniors/Grads","3",0,["Supervised study of special topics of interest to students under instructor guidance. May be repeated up to 12 total credit hours. Department consent required. Requisites: Restricted to College of Engineering majors only.",[0,10,930,1005,"3",42,0,"Jennifer Scheib","ECCR 200","Topic: Lighting Controls"],[0,10,930,1005,"3",21,0,"Kyri Baker","ECCR 139","Topic: Electrical Cir for Arch Engrs"],[0,1,540,690,"3",22,0,"Galen Burrell","ENVD 102","Topic: Architectrl Daylighting Dsgn"],[0,1,1020,1190,"3",18,0,"Jay Wratten","ENVD 120","Topic: Lighting Design Capstone"]]],["ARTH 4569","United States Architecture","3",0,["Examines architecture as it developed in the area now defined as the continental United States from early cultures to the present. Considers the major styles and issues of cultural interaction, race/ethnicity, gender and class concerns as they relate to the practice, theory, and profession of architecture. Requisites: Requires prerequisite courses of ARTH 1300 and 1400 (all minimum grade D-).",[0,10,840,915,"3",7,0,"Robert Nauman","VAC 308"]]],["ANTH 4270","Plains Archaeology","3",0,["Archaeological evidence for Native American ways of life on the North American Great Plains from the initial peopling of the region into the 19th century.  Recommended prereq., ANTH 2200. Same as ANTH 5270. Requisites: Restricted to students with 57-180 credits (Juniors or Seniors).",[0,10,750,825,"3",24,0,"Douglas Bamforth","HALE 260","Notes: This is a combined section class"]]],["ACCT 6900","Independent Study","1 - 6",0,["Prior department consent required of instructor under whose direction study is taken. Departmental form required. Requisites: Restricted to Accounting, Finance/Accounting, Information Systems/Accounting, Systems/Accounting Concurrent Degree students or Accounting, Accounting/Taxation or Business Administration (BUAD) graduate students only.",[7,0,0,0,"1 - 6",98,0,"Maria Nondorf","TBA"],[7,0,0,0,"1 - 6",100,0,"Staff","TBA"],[7,0,720,720,"1 - 6",100,0,"Staff","TBA"]]],["ATOC 4800","Policy Implications of Climate Controversies","3",0,["Examines controversial issues related to the environment, including climate change. Covers scientific theories and the intersection between science and governmental policy. Includes discussion, debate, and critical reading of textual materials. Department enforced prereqs., ATOC 1060 or 3600. Credit not granted for this course and ATOC 5000.",[0,5,945,1020,"3",13,0,"Weiqing Han","SEEC N126","Notes: This is a combined section class"]]],["ACCT 4827","Integrated Reporting for Socially Responsible Strategies","3",1,["Explores the growing global trend of companies to measure, disclose and report for socially responsible initiatives.  Integrated reporting combines financial, environmental, social and governance information into a single report.  Current practices in sustainability and integrated reporting in the US and across the world will be examined/learned through case studies, guest speakers, current literature and projects.  Can be taken concurrenlty with BCOR 3010 and ACCT 3220.  Same as CESR 4827. Requisites: Requires prerequisite courses of BCOR 2000 and 2200 or BCOR 2002 (all minimum grade D-). Restricted to students with 57-180 credits (Juniors or Seniors).",[0,10,750,825,"3",0,0,"Catherine Milburn","KOBL 375","Notes: This is a combined section class"]]],["ASTR 5700","Stellar Astrophysics","3",0,["Explores stellar interiors, evolution and atmospheres, with the Sun and its heliosphere being used as the closest and best-studied example of a star. Covers energy generation, transport, principles of stellar structure, stellar rotation, pulsation and evolution to supernova and compact object stages. Includes radiation transport in stellar photospheres, chromospheres, coronas, winds. Department enforced prereq., senior level undergraduate physics. Recommended prereq., ASTR 5120. Requisites: Restricted to graduate students only.",[0,21,540,590,"3",25,0,"Steven Cranmer","DUAN E126"]]],["ARTF 5024","Advanced Research Seminar","3",0,["Focuses on a specific topic, director, or genre chosen by the professor. Research skills and critical thinking are emphasized. With faculty guidance, students determine individual projects and present them to the class. Class participation is mandatory. Each student submits a thorough and original research paper for a final grade. May be repeated up to 6 total credit hours. Recommended prereqs., FILM 3051, 3061. Same as FILM 4024. Requisites: Requires prerequisite course of FILM 1502 (minimum grade D-). Restricted to graduate students only.",[3,10,930,1125,"3",4,0,"Melinda Barlow","ATLS 1B29","Topic: Stories We Tell"]]],["ARTH 5269","Art and Archaeology of the Ancient Near East","3",0,["Same as CLAS 5269.",[0,10,570,645,"3",4,0,"Elspeth Rogers M. Dusinberre","GUGG 2","Notes: This is a combined section class"]]],["ARTH 4919","Capstone Seminar: Topics in Art History","3",0,["Seminar course dealing with selected areas or problems within the history of art. Consult current online Schedule Planner for seminar topic. May be repeated up to 7 total credit hours. Requisites: Restricted to Art History (AAAH) majors only.",[3,10,930,1005,"3",10,0,"Brianne Cohen","VAC 308","Topic: Photo and Political Violence"]]],["ATOC 4710","Introduction to Atmospheric Physics","3",0,["Provides a fundamental overview of the physics of Earth's atmosphere. Topics include atmospheric composition and structure, atmospheric radiation and optics (rainbows, halos and other phenomena), atmospheric  thermodynamics, cloud physics and atmospheric electricity and lightning. Including both descriptive and quantitative approaches to the subject material. Where applicable, observations from the ATOC Skywatch Observatory will be introduced. Department enforced prereqs., one year of calculus and one year of physics with calculus.",[0,5,585,660,"3",21,0,"Peter Pilewskie","SEEC N129"]]],["ACCT 5620","Auditing and Assurance Services","3",1,["Emphasizes the value of assurance services, including the market for financial-statement audits, and the audit decision process, from obtaining a client through planning and testing, to issuance of the audit report. Focuses on making judgments and decisions under conditions of uncertainty and continually evaluating the substance of business transactions over their form.  Same as ACCT 4620. Requisites: Requires prerequisite course of ACCT 3230 (minimum grade D-).  Restricted to Acct (ACCT), Accounting Taxation (ACTX) or Business Administration (BUAD) graduate students or Finance/Acct (FNCEACCT) or ACCT Concurrent Degree students only.",[0,10,1020,1095,"3",0,0,"David Frederick","KOBL 220","Notes: This is a combined section class"]]],["ASTR 2000","Ancient Astronomies of the World","3",0,["Documents the numerous ways in which observational astronomy and cosmology have been features of ancient cultures. Includes naked eye astronomy, archaeoastronomy, ethnoastronomy, concepts of time, calendrics, cosmogony, and cosmology. Approved for arts and sciences core curriculum: natural science or human diversity.",[0,10,840,915,"3",148,0,"Erica Ellingson","BESC 180"]]],["ARSC 1420","MASP Coseminar: Introduction to EEB","1",1,["Designed to supplement and strengthen student experiences in EBIO 1210 and 1220. Allows particularly gifted students an opportunity to extend their understanding of the subject and possible careers in science. May be repeated up to 2 total credit hours.",[3,5,900,975,"1",0,0,"Staff","FLMG 170","Topic: SASC CO-Seminar: EBIO"],[3,10,990,1065,"1",0,0,"Staff","FLMG 244","Topic: SASC CO-Seminar: EBIO"]]],["ASTR 1040","Accelerated Introductory Astronomy 2","4",0,["Covers principles of modern astronomy summarizing our present knowledge about the Sun, stars, birth and death of stars, neutron stars, black holes, galaxies, quasars, and the organization and origins of the universe.  May require nighttime observing sessions at Sommers-Bausch Observatory. Required in ASTR major/minor. Includes a recitation. Students may receive credit for only one of ASTR 1020, 1040, 1200, or 1120. Similar to ASTR 1020 and 1200 but taught at a higher intellectual level including a significant amount of quantitative analysis.  Approved for GT-SC2.  Approved for arts and sciences core curriculum: natural science. Requisites: Requires prerequisite course of ASTR 1010 or ASTR 1030 and MATH 1300 or APPM 1350 or APPM 1340 and APPM 1345 (all minimum grade C-).",[0,10,660,735,"4",68,0,"Juri Toomre","DUAN G130"],[1,2,900,950,"4",15,0,"Juri Toomre","DUAN D318"],[1,4,660,710,"4",10,0,"Staff","DUAN E126"],[1,4,720,770,"4",12,0,"Staff","DUAN E126"],[1,4,780,830,"4",16,0,"Staff","DUAN D318"],[1,4,840,890,"4",15,0,"Staff","DUAN E126"]]],["ANTH 1120","Exploring a Non-Western Culture: Pueblo Indians of the Southwest","3",0,["Explores two American Indian cultures, Hopi and Navajo, and cultural interrelationships from the prehistoric through the contemporary period, using an integrated, holistic, and humanistic viewpoint. Same as ETHN 1123. Approved for arts and sciences core curriculum: human diversity.",[0,5,600,650,"3",143,0,"Scott Ortman","HALE 270"],[1,4,840,890,"3",17,0,"Staff","STAD 136C"],[1,4,900,950,"3",22,0,"Staff","MUEN E417"],[1,16,480,530,"3",23,0,"Staff","HALE 236"]]],["ASTR 2600","Introduction to Scientific Programming","3",0,["Introduces practical research skills and provides orientation to computational tools commonly used in research by astrophysicists and planetary scientists.",[0,10,660,735,"3",12,0,"Seth Hornstein","OBSV S125"],[0,10,930,1005,"3",16,0,"Seth Hornstein","OBSV S125"]]],["ASTR 2500","Gateway to Space","3",0,["Introduces the basics of atmospheric and space sciences, space exploration, spacecraft design, rocketry, and orbits. Students design, build, and launch a miniature satellite on a high altitude balloon. Explores the current research in space through lectures from industry.  Same as ASEN 1400. Requisites: Restricted to Astrophysics (ASTR) majors only.",[0,10,570,645,"3",9,0,"Christopher Koehler","ITLL 1B50","Notes: This is a combined section class"]]],["AREN 4317","Architectural Engineering Design","5",0,["Provides a capstone experience to AREN students. Students design a modest commercial building and complete an integrated engineering design of the building systems executed for the conceptual, schematic, and design development phases. Students' teams work on structural, mechanical, electrical/lighting, and construction engineering management design. Each stage produce a professional-quality design document. Faculty and industry mentors participate in the teaching and evaluation of designs. Requisites: Requires prerequisite courses of ARCH 4010 and AREN 3010 and AREN 3540 and CVEN 3246 and CVEN 3525 and ECEN 3030 (all minimum grade C-).",[0,5,960,1035,"5",37,0,"Moncef Krarti","FLMG 156"]]],["ACCT 6000","Academic Internship in Accounting","1 - 4",0,["Offers students the opportunity to gain professional work experience in an accounting or tax position while still in school. Provides academically relevant work experience that complements students' studies and enhances their career potential. Includes lectures and a course paper. Students may not preregister for  this course, and they must contact the Director of the concurrent degree program in accounting for approval. Department enforced prereqs., at least 90 credit hours of course work and a minimum GPA of 3.00.  Instructor consent required. Requisites: Requires prerequisite course of ACCT 3230 (minimum grade D-).  Restricted to Acct (ACCT), Accounting Taxation (ACTX) or Business Administration (BUAD) graduate students or Finance/Acct (FNCEACCT) or ACCT Concurrent Degree students only.",[8,0,0,0,"1 - 4",23,0,"Maria Nondorf","TBA"]]],["ASEN 6080","Statistical Orbit Determination","3",0,["Continuation of ASEN 5070. Emphasizes orthogonal transformation techniques such as Givens and Householder, square root filtering and smoothing, and considers covariance analysis. Also nonlinear filters and dynamic model compensation techniques. Requires term project that involves the application of many of the techniques required for precise orbit determination.  Recommended prereq., ASEN 5070 or equivalent or instructor consent required. Requisites: Restricted to College of Engineering (ENGR) graduate students or Aerospace Engineering Concurrent Degree (C-ASEN) majors only.",[0,5,510,585,"3",29,0,"Jay Mc Mahon","ECCS 1B14"],[0,0,0,0,"3",19,0,"Jay Mc Mahon","Distance Section"]]],["ATLS 2100","Image","3",0,["Introduces techniques, technologies and concepts of digital image making and manipulation through lectures, projects and critiques. Focuses on digital photography, digital animation and digital video as a means to formal and expressive ends. This course also contextualizes practices and methodologies of digital imaging with historical and critical perspectives. Requisites: Requires prerequisite course of ATLS 2000 (minimum grade C). Restricted to Technology, Arts and Media (TMEN) majors or the ATLAS (PATL) student group only.",[0,4,900,975,"3",37,1,"Kevin Hoth","ATLS 100"],[1,8,480,555,"3",10,0,"Staff","ATLS 1B25"],[1,8,570,645,"3",2,0,"Staff","ATLS 1B25"],[1,8,660,735,"3",0,0,"Staff","ATLS 1B25"],[1,8,750,825,"3",0,1,"Staff","ATLS 1B25"],[1,8,840,915,"3",9,0,"Staff","ATLS 1B25"],[1,8,930,1005,"3",8,0,"Staff","ATLS 1B25"],[1,16,570,645,"3",8,0,"Staff","ATLS 104"]]],["ANTH 7000","Seminar: Current Research Topics in Cultural Anthropology","3",0,["Discusses current research and theoretical issues in the field of cultural anthropology. Requisites: Restricted to graduate students only.",[3,4,540,690,"3",20,0,"Alison Cool","HALE 455","Topic: Anthropology of Abstraction"],[3,4,720,870,"3",14,0,"Donna Goldstein","HALE 455","Topic: Environmental Anthropology"]]],["BADM 2010","Excel in Business","1",0,["Teaches beginner to intermediate level Excel skills, emphasizing efficient use of Excel to make sense of substantial data sets.  The course is designed to increase students' proficiency with Excel through a series of hands-on workshops.  The workshops have a business problem solving orientation and use real data from Leeds' corporate partners.  The workshops emphasize the most important skills that employers value. Requisites: Restricted to Business (BUSN) majors only.",[10,1,840,890,"1",10,0,"Noah Zikmund","KOBL 320"],[10,4,840,890,"1",9,0,"Noah Zikmund","KOBL 320"]]],["ATOC 4500","Special Topics in Atmospheric and Oceanic Sciences","3",0,["Acquaints students with current research in atmospheres, oceans, and climate. Topics may vary each semester. May be repeated for a total of 9 total credit hours within the degree. Students may register for more than one section of this course in the same semester.",[0,10,840,915,"3",1,0,"Alexandra Jahn","HUMN 1B35","Topic: Num Methods/Modeling"],[0,5,900,975,"3",13,0,"Mark Seefeldt","HUMN 1B45","Topic: Synoptic Dyn Met"],[0,10,660,735,"3",7,0,"Jennifer Kay","HUMN 1B35","Topic: Objective Data Analysis"]]],["ACCT 5250","Financial Statement Analysis","3",1,["Same as ACCT 4250. Requisites: Requires prerequisite course of ACCT 3220 or ACCT 3225 (min grade D-).  Restricted to Acct (ACCT), Accounting Taxation (ACTX) or Business Administration (BUAD) graduate students or Finance/Acct (FNCEACCT) or ACCT Concurrent Degree students only.",[0,10,930,1005,"3",0,4,"Maria Nondorf","KOBL 308","Notes: This is a combined section class"]]],["BUSM 3003","New Venture Creation: Intro to Entrepreneurship","3",0,["Introduces students to the multiple facets of entrepreneurship including the entrepreneurial process and way of thinking. Venture creation involves many key areas including ideation to opportunity recognition to opportunity evaluation to venture planning to exit. This course will focus on the ideation and opportunity recognition and evaluation areas of venture creation, utilizing tactics such as rapid prototyping and design thinking. Requisites: Requires prerequisite courses of BUSM 2001 and 2002 (minimum grade D-). Restricted to students with Business Minor (BUSM-MIN) plan.",[0,10,570,645,"3",63,0,"Sid Saleh","KOBL 340"],[0,10,660,735,"3",59,0,"Sid Saleh","KOBL 340"]]],["ASEN 5010","Spacecraft Attitude Dynamics and Control","3",0,["Includes rigid body kinematics and spacecraft attitude descriptions, torque-free attitude dynamics, static attitude determination, motion and stability due to gravity gradient torque and spinning craft, passive and active methods of attitude control, nonlinear regulator and attitude tracking feedback controlaws. Recommended prereq., ASEN 3200 or equivalent or instructor consent required. Requisites: Restricted to College of Engineering (ENGR) graduate students or Aerospace Engineering Concurrent Degree (C-ASEN) majors only.",[0,10,480,555,"3",3,0,"Hanspeter Schaub","ECCS 1B28"],[0,0,0,0,"3",32,0,"Hanspeter Schaub","Distance Section"]]],["ARTH 2029","Art and Archaeology of Ancient Egypt","3",0,["None",[0,21,540,590,"3",15,0,"Sarah James","VAC 1B88","Notes: This is a combined section class"],[0,21,660,710,"3",12,0,"Sarah James","VAC 1B88","Notes: This is a combined section class"]]],["ARTH 5909","Graduate Independent Study---Art History","1 - 3",0,["May be repeated up to 9 total credit hours. Requisites: Restricted to graduate students only.",[7,0,0,0,"1 - 3",100,0,"Kirk Ambrose","TBA"],[7,0,0,0,"1 - 3",100,0,"Staff","TBA"],[7,0,0,0,"1 - 3",100,0,"Claire Farago","TBA"],[7,0,0,0,"1 - 3",100,0,"James Cordova","TBA"],[7,0,0,0,"1 - 3",100,0,"Robert Nauman","TBA"],[7,0,0,0,"1 - 3",100,0,"Marilyn Brown","TBA"],[7,0,0,0,"1 - 3",100,0,"Albert Alhadeff","TBA"]]],["ASTR 7920","Reading and Research in Astrophysical and Planetary Sciences","1 - 6",0,["May be repeated up to 6 total credit hours.  Instructor consent required. Requisites: Restricted to graduate students only.",[9,0,0,0,"1 - 6",100,0,"Staff","TBA"],[9,0,0,0,"1 - 6",100,0,"Staff","TBA"],[9,0,0,0,"1 - 6",100,0,"Staff","TBA"]]],["ASTR 6000","Seminar in Astrophysics","1",0,["Studies current research and research literature on an astrophysical topic. Students and faculty give presentations. Subjects vary each semester. May be repeated for a total of 4 credit hours to meet candidacy requirements. Requisites: Restricted to graduate students only.",[3,8,960,1010,"1",25,0,"Staff","DUAN E126"]]],["AREN 4130","Optical Design for Illumination and Solid State Lighting","3",0,["Learn the optical design process used for illumination-based optics, with an emphasis on applications in architectural lighting. Includes in-depth coverage of luminaire photometry, lamps, materials, manufacturing methods, and product performance requirements. Optical design projects will utilize optical design software and include a variety of lamp types including LEDs using both reflector and lens optics. Same as AREN 5130. Requisites: Requires prerequisite course of AREN 3540 (minimum grade C-). Restricted to Architectural (AREN) or Civil (CVEN) Engineering majors only.",[0,5,1050,1125,"3",23,0,"Mark Jongewaard","ECCR 118","Notes: This is a combined section class"]]],["ATOC 5750","Desert Meteorology and Climate","3",0,["Same as ATOC 4750. Requisites: Restricted to graduate students only.",[0,5,765,840,"3",8,0,"Derek Brown","SEEC N128","Notes: This is a combined section class"]]],["ASTR 5550","Observations, Data Analysis and Statistics","3",0,["Introduces multi-wavelength observational techniques,their limitations and effects of various noise sources. Describes basic data handling, error analysis, and statistical tests relevant to modeling. Topics include probability distributions, model-fitting algorithms, confidence intervals, correlations, sampling and convolution. Students derive physical measurements and uncertainties with hands-on analysis of real datasets. Department enforced requisite, senior level undergraduate physics or instructor consent will be required. Requisites: Restricted to graduate students only.",[0,21,780,830,"3",25,0,"Nils Halverson","DUAN E126"]]],["ACCT 6350","Current Issues in Professional Accounting--Accounting Ethics","3",0,["Examines the nature of accounting theory and practice from perspectives of economics, law, globalization, accounting, ethics, and moral reasoning. This course also explores issues including implications of institutional factors, such as Sarbanes-Oxley, SEC, FASB, IFRS, and capital markets. Counts as senior seminar for Concurrent degree students. Requisites: Restricted to Accounting, Finance/Accounting, Information Systems/Accounting, Systems/Accounting Concurrent Degree students or Accounting, Accounting/Taxation or Business Administration (BUAD) graduate students only.",[0,10,750,825,"3",0,0,"Randy Johnston","KOBL 255"],[0,16,540,705,"3",8,0,"Paul Munter","KOBL 230"]]],["ARTH 4939","Art Museum Internship","3 - 6",0,["Focuses on opportunities at the Denver Art Museum, working with individual curators and master teachers in selected areas, such as audience interpretation, interpretive research files, and public school curriculums. Introduces students to the professional culture and activities of art museums. May be repeated up to 6 total credit hours. Same as ARTH 5939.",[8,4,900,1005,"3 - 6",30,0,"Robert Nauman","VAC 455"]]],["ATOC 5770","Wind Energy Meteorology","3",0,["Explores the complex interactions of the atmosphere and wind energy generation. Surveys wind turbine designs. Explores planetary boundary layer dynamics, traditional and novel wind measurement methods, forecasting methods, wind turbine and wind far wakes, wind far optimization, sound propagation from wind plants, climate change impacts on wind resources, and the impacts of wind plants on local environments. Same as ATOC 4770.",[0,5,855,930,"3",3,0,"Julie Lundquist","SEEC S125","Notes: This is a combined section class"]]],["BASE 2102","BCOR Applied Semester Experience 2: Growth Stage","3",0,["Builds on material covered in BCOR 2001, 2002, 2003. Provides students the opportunity to apply tools from the functional business disciplines. Business problems, solutions and decisions are addressed in the context of a growth stage business. May be repeated up to 6 total credit hours. Requisites: Requires prerequisite courses of BCOR 2001, 2002 and 2003 (all minimum  grade D-). Restricted to Business (BUSN) majors with 26-180 units completed.",[0,1,480,650,"3",149,0,"Richard Reed","KOBL S135"],[0,5,600,710,"3",143,0,"Mary Lewis","FLMG 155"],[0,1,660,830,"3",138,0,"Craig Stephenson","KOBL S135"],[0,5,900,1010,"3",146,0,"Joshua Neil","FLMG 155"],[0,10,480,590,"3",145,0,"Lori Seward","FLMG 155"]]],["AREN 5110","HVAC Design","3",0,["Explores design of heating, ventilating, and air conditioning (HVAC) systems for buildings. Covers HVAC systems description, load estimating, code compliance, duct design, fan systems, applied psychrometrics, cooling and heating coils, filters, hydronic systems, piping, and pumps. Department enforced prereq., AREN 3010 or equivalent. Same as AREN 4110.",[0,10,660,735,"3",13,0,"Gregor Henze","ECCR 139","Notes: This is a combined section class"]]],["ARTH 6929","Seminar: Theories of Art History","3",0,["Provides a systematic critical overview of the development of art history as a discipline beginning with 18th century theories of aesthetics and ending with current interdisciplinary models of critical interpretation. Weekly readings, discussions, reports, and written papers constitute the format of this seminar in methodology. Topics vary from semester to semester. May be repeated up to 6 total credit hours within a term. Required for MA (art history) students. Requisites: Restricted to graduate students or Art History Concurrent Degree (C-AAAH) or Film & Art History Concurrent Degree (C-FILMAAAH) students only.",[3,8,660,810,"3",20,0,"James Cordova","VAC 303","Topic: Colonialism in Lat. Amer. Art"],[3,1,840,990,"3",18,0,"Hannah Friedman","VAC 455"]]],["ASIA 4930","Engage Asia: Internship in Asian Studies","1 - 6",0,["Matches students with supervised internships in which they share academic learning of topics in Asian culture, history, or language with, for example, teachers and students in the Boulder Valley School District. Students work with Center for Asian Studies research and teaching faculty to, for example, research and prepare lessons they will present in BVSD K-12 classes on world cultures, world geography, world history, and Asian languages. May be repeated up to 6 total credit hours. Recommended prereq., Asian language and culture courses. Requisites: Restricted to students with 27-180 credits (Sophomores, Juniors or Seniors) only.",[8,0,0,0,"1 - 6",10,0,"J Berry","TBA"]]],["ATOC 5830","Topics in Planetary Science","3",0,["Covers current topics in planetary science based on recent discoveries, spacecraft observations, or other developments. Focuses on a specific topic such as Mars, Venus, Galilean satellites, exobiology, comets, or extrasolar planets. May be repeated up to 6 total credit hours, provided the topics vary.  Same as ASTR 5830 and GEOL 5830. Requisites: Restricted to graduate students only.",[0,10,840,915,"3",10,0,"Bruce Jakosky","DUAN E126","Topic: Astrobiology"]]],["ATLS 5040","Game Design","3",0,["None",[0,1,540,650,"3",5,0,"Matthew Bethancourt","ATLS 1B31","Notes: This is a combined section class"],[2,4,540,650,"3",5,0,"Matthew Bethancourt","ATLS 1B31","Notes: This is a combined section class"]]],["ATOC 1070","Weather and the Atmosphere Laboratory","1",0,["Optional laboratory for ATOC 1050. Laboratory experiments illustrate fundamentals of meteorology. Covers collection, analysis, and discussion of data related to local weather. Uses computers for retrieval and interpretation of weather data from Colorado and across the U.S.  Department enforced prereq. or coreq., ATOC 1050. Approved for GT-SC1. Approved for arts and sciences core curriculum: natural science.",[10,1,560,670,"1",19,0,"Staff","SEEC S128"],[10,1,680,790,"1",19,0,"Staff","SEEC S128"],[10,1,800,910,"1",20,0,"Staff","SEEC S128"],[10,1,920,1030,"1",17,0,"Staff","SEEC S128"],[10,1,1040,1150,"1",20,0,"Staff","SEEC S128"],[10,8,560,670,"1",23,0,"Derek Brown","SEEC S128"],[10,8,765,875,"1",22,0,"Derek Brown","SEEC S128"],[10,4,560,670,"1",22,0,"Staff","SEEC S128"],[10,4,680,790,"1",19,0,"Staff","SEEC S128"],[10,4,800,910,"1",18,0,"Staff","SEEC S128"],[10,4,920,1030,"1",20,0,"Staff","SEEC S128"],[10,4,1040,1150,"1",20,0,"Staff","SEEC S128"]]],["ATOC 5600","Physics and Chemistry of Clouds and Aerosols","3",0,["Clouds and aerosols are ubiquitous in planetary atmospheres, where they impact climate, atmospheric chemistry, remote sensing, and weather. Applies basic microphysical, radiative, and chemical processes affecting particles to issues in current literature. Department enforced prereq., one year of college chemistry and calculus-based physics and math up through differential equations. ATOC graduate core course. Requisites: Restricted to graduate students only.",[0,10,540,615,"3",28,0,"Owen Toon","SEEC S125"]]],["ACCT 4250","Financial Statement Analysis","3",1,["Focuses on the use of U.S. and international accounting information by decision-makers external to the firm. Considers judgments made by investors, security analysts, bank lending officers, and auditors. Emphasizes equity valuation and risk analysis. Requisites: Requires a prerequisite course of ACCT 3220 or 3225 (minimum grade D-).  Restricted to Accounting (ACCT), Finance (FNCE) or Accounting Concurrent Degree majors only with 52-180 units completed.",[0,10,930,1005,"3",0,9,"Maria Nondorf","KOBL 308","Notes: This is a combined section class"]]],["ATOC 6020","Seminar in Atmospheric and Oceanic Sciences","1",0,["Studies an area of current research in the atmospheric and oceanic sciences. Students read selected papers from the literature. Students and faculty give presentations and participate in discussions. May be repeated for a total of 6 credit hours within the degree. May be repeated for a total of 3 credit hours within a semester. Requisites: Restricted to graduate students only.",[3,16,840,900,"1",11,0,"Staff","SEEC N126","Topic: Communicating Science"],[3,0,0,0,"1",12,0,"Katja Friedrich","See Class Notes For Room Info","Topic: Precip Systems"],[3,0,0,0,"1",12,0,"Weiqing Han","See Class Notes For Room Info","Topic: Tropical Ocean & Climate"],[3,0,0,0,"1",11,0,"Alexandra Jahn","See Class Notes For Room Info","Topic: Climate Modeling"],[3,0,0,0,"1",12,0,"Kristopher Karnauskas","See Class Notes For Room Info","Topic: Climate Dynamics"],[3,0,0,0,"1",12,0,"Jennifer Kay","See Class Notes For Room Info","Topic: Polar Climate"],[3,0,0,0,"1",12,0,"Jan Lenaerts","See Class Notes For Room Info"],[3,0,0,0,"1",12,0,"Nicole Lovenduski","See Class Notes For Room Info","Topic: Ocean Biogeochemistry"],[3,0,0,0,"1",11,0,"Julie Lundquist","See Class Notes For Room Info","Topic: Boundary Layer Meteorology"],[3,16,960,1020,"1",9,0,"Peter Pilewskie","SEEC S126","Topic: Making Simple Estimations"],[3,0,0,0,"1",12,0,"Cora Randall","See Class Notes For Room Info","Topic: Mid Atmos Investgtns"],[3,0,0,0,"1",12,0,"Sebastian Schmidt","See Class Notes For Room Info","Topic: Airborne Radiation Science"],[3,0,0,0,"1",12,0,"Darin Toohey","See Class Notes For Room Info","Topic: Atmospheric Observations"],[3,0,0,0,"1",12,0,"Owen Toon","See Class Notes For Room Info","Topic: Clouds and Aerosols"],[3,0,0,0,"1",12,0,"Jeffrey Weiss","See Class Notes For Room Info","Topic: Geophysical Fluid Dynamics"],[3,0,0,0,"1",12,0,"Julie Lundquist","See Class Notes For Room Info"]]],["APRD 2000","Principles of Advertising","3",0,["Explores the practice of advertising from a variety of viewpoints including advertisers, agencies and the public. Students will examine advertising via successful campaigns for some of the world's most iconic brands. Topics include history and evolution of the industry, the process of creating ideas in a multi-disciplinary world and challenge of advertising to act ethically and responsibly within society. Similar to JOUR 2403. Requisites: Requires prerequisite courses of APRD 1001 and APRD 1002 (all minimum grade D-). Restricted to Strategic Communication (STCM) majors only.",[0,10,930,1005,"3",90,0,"Erin Schauster","HALE 270"]]],["ANTH 4745","Science, Technology and Society","3",0,["None",[0,5,900,975,"3",35,0,"Alison Cool","HUMN 1B90"]]],["ACCT 6620","Advanced Auditing: Business Risk and Decision Analysis","3",0,["Explores contemporary issues, historical developments, and selected topics pertinent to business assurance services by independent accountants. Emphasizes improving both the decision behavior of decision makers and the quality of information, or its context, for decision makers. Requisites: Requires a prereq course of ACCT 5620 (min grade D-). Restricted to Acct, Fnce/Acct, Infor Syst/Acct, Syst/Acct Concurrent Degree students or Acct, Acct/Tax or Busn Admin (BUAD) graduate students only.",[0,4,930,1095,"3",6,0,"David Frederick","KOBL 255"],[0,4,1110,1275,"3",15,0,"David Frederick","KOBL 255"]]],["ACCT 3440","Income Taxation of Individuals","3",0,["Examines concepts and structure of the United States income tax system. Focuses on concepts affecting all taxpayers, with emphasis on individual taxation. Requisites: Requires a prerequisite course of BCOR 2000  or 2002 (minimum grade D-).  Restricted to Accounting (ACCT) or Finance (FNCE) majors with 52-180 units completed.",[0,10,480,555,"3",26,0,"Lauren Long","KOBL S110"],[0,10,570,645,"3",2,0,"Lauren Long","KOBL S110"],[0,10,750,825,"3",0,11,"Lauren Long","KOBL 230"]]],["BUSM 3001","Managing Innovation in Organizations","3",0,["Examines the organizational structures that support innovation and organizational change. Creativity and innovation are becoming critical competitive advantages, yet over forty percent of the new products that are launched each year fail in the marketplace. This course focuses on the role of effective teamwork in organizations and the tools needed during new product development to improve success. Requisites: Requires prerequisite courses of BUSM 2001 and 2002 (minimum grade D-). Restricted to students with Business Minor (BUSM-MIN) plan.",[0,10,840,915,"3",51,0,"Heather Adams","KOBL 330"]]],["ANTH 1170","Exploring Culture and Gender through Film","3",0,["Uses films and written texts to explore the concepts of culture and gender, as well as ethnicity and race. By looking at gender, ethnicity, and race cross-culturally, students will know how these concepts are constructed in their own society, as well as in others. Approved for arts and sciences core curriculum: human diversity.",[0,21,600,650,"3",130,0,"Christian Hammons","VAC 1B20","Notes: This is a combined section class"]]],["ASTR 4800","Space Science: Practice and Policy","3",0,["Exposes students to current controversies in science that illustrate the scientific method and the interplay of observation, theory, and science policy. Students research and debate both sides of the issues, which include strategies and spin-offs of space exploration, funding of science, big vs. small science, and scientific heresy and fraud. Requisites: Requires prerequisite courses of ASTR 1010 or ASTR 1000 or ASTR 1030 and ASTR 1200 or ASTR 1020 or ASTR 1040 and PHYS 1010 or PHYS 1110 or PHYS 2010 and PHYS 1020 or PHYS 1120 or PHYS 2020 (all minimum grade C-).",[0,10,750,825,"3",17,0,"Larry Esposito","DUAN G131"]]],["ACCT 5240","Advanced Financial Accounting","3",1,["Examines advanced financial accounting theory and practice, emphasizing U.S. and international accounting for business combinations, consolidated financial statements, and accounting for partnerships. Requisites: Requires prerequisite course of ACCT 3230 (minimum grade D-).  Restricted to Acct (ACCT), Accounting Taxation (ACTX) or Business Administration (BUAD) graduate students or Finance/Acct (FNCEACCT) or ACCT Concurrent Degree students only.",[0,10,840,915,"3",0,0,"Randy Johnston","KOBL 235","Notes: This is a combined section class"]]],["ASEN 6008","Interplanetary Mission Design","3",0,["Exploration of principles and methods related to the design and construction of trajectories for interplanetary mission design. Some topics covered include: two-and three-body motion, gravity assists, maneuver computation, navigation, numerical integration, and construction of orbits. The main focus is on simple ballistic mission designs, such as Galileo or Cassini, however, libration point trajectories will also be covered. Recommended prereq., ASEN 5050 or equivalent or instructor consent required. Requisites: Restricted to College of Engineering (ENGR) graduate students or Aerospace Engineering Concurrent Degree (C-ASEN) majors only.",[0,5,1110,1185,"3",12,0,"Kathryn Davis","ECCR 108"],[0,0,0,0,"3",36,0,"Kathryn Davis","Distance Section"]]],["BUSM 4001","Professional Business Plan Development","3",0,["Using a business plan development model, this capstone course integrates the accounting, finance, management and marketing principles learned previously and incorporates social reasonability and values driven leadership. Objectives focus on the development of professional skills, e.g., time management, career management, team building, through a combination of classroom and experiential learning. Requisites: Requires prerequisite course of BUSM 3001 or 3002 or 3003 (minimum grade D-). Restricted to Business Minor (BUSM-Min) majors only.",[0,4,930,1095,"3",1,6,"Janet Bercovitz","KOBL 330"],[0,2,1020,1185,"3",0,2,"Janet Bercovitz","KOBL 330"],[0,8,1020,1185,"3",11,0,"George Deriso","KOBL 330"],[0,1,1020,1185,"3",0,1,"Keith Stockton","KOBL S135"],[0,4,1020,1185,"3",4,0,"Keith Stockton","KOBL S135"],[0,8,930,1095,"3",0,2,"David Cass","KOBL 235"],[0,16,570,735,"3",25,0,"Sarah Schupp","KOBL 330"]]],["ARAB 1011","Introduction to Arab and Islamic Civilizations","3",0,["Provides an interdisciplinary overview of the cultures of the Arabic-speaking peoples of Southwest Asia and North Africa from the rise of Islam in the 7th century to the present. Readings include historical, religious, literary and cultural texts from both the medieval and modern eras. Taught in English. Approved for arts and sciences core curriculum: human diversity.",[0,10,930,1005,"3",55,0,"Sabahat Adil","DUAN G125"]]],["ATLS 2300","Text","3",0,["Introduces technologies, terminology and histories related to the design of text within digital and analogue media. Students will learn the fundamentals of design, typography and layout through lectures, projects and critiques. The curriculum surveys significant theoretical perspectives, historical periods and significant practitioners that influence the practice of typographic design. Requisites: Requires prerequisite course of ATLS 2000 (minimum grade C). Restricted to Technology, Arts and Media (TMEN) majors or the ATLAS (PATL) student group only.",[0,1,900,975,"3",22,9,"Staff","ATLS 100"],[1,16,480,555,"3",9,0,"Staff","ATLS 104"],[1,2,570,645,"3",0,4,"Staff","ATLS 1B25"],[1,16,660,735,"3",1,0,"Staff","ATLS 104"],[1,16,750,825,"3",6,0,"Staff","ATLS 104"],[1,16,840,915,"3",6,0,"Staff","ATLS 104"],[1,2,480,555,"3",0,1,"Staff","ATLS 1B25"],[1,2,840,915,"3",0,4,"Staff","ATLS 1B31"]]],["ATLS 4809","Computer Animation","3",0,["Develops a firm understanding of the general principles of computer animation. Lectures cover the creation of models, materials, textures, surfaces, and lighting. Path and key frame animation, particle dynamics, and rendering are introduced. Students are assigned a number of animation tutorials to carry out. Same as ATLS 5809 and CSCI 4809/5809. Requisites: Restricted to students in the Atlas student group (PATL) only.",[0,5,1020,1095,"3",5,0,"Roger King","ATLS 1B31","Notes: This is a combined section class"]]],["ATOC 4200","Biogeochemical Oceanography","3",0,["Provides a large-scale synthesis of the processes impacting ocean biogeochemistry.  Transforms theoretical understanding into real-world applications using oceanographic data and models.  Topics include:  chemical composition, biological nutrient utilization and productivity, air-sea gas exchange, carbonate chemistry, ocean acidification, ocean deoxygenation, iron fertilization, biogeochemical climate feedbacks, and much more.  Same as ATOC 5200.",[0,10,900,975,"3",11,0,"Nicole Lovenduski","SEEC S125","Notes: This is a combined section class"]]],["ARAB 2120","Intermediate Arabic 2","5",0,["Continuation of ARAB 2110. Requisites: Requires prerequisite course of ARAB 2110 (minimum grade C).",[0,31,540,590,"5",0,0,"Mona Attwa","HLMS 145"],[0,31,600,650,"5",17,0,"Mona Attwa","HLMS 145"]]],["APRD 4873","Special Topics","varies",0,["None",[0,4,1080,1230,"3",0,5,"Trina Arnett","HUMN 270","Topic: Data Visualization"],[0,0,0,0,"1",0,6,"Patrick Finn","ARMR 218","Topic: Strategic Comm and Improv"],[0,21,720,770,"3",68,0,"Staff","MCOL W100","Topic: Mktg Comm Skills"],[0,0,540,1020,"1",3,0,"Staff","ARMR 218","Topic: Programmatic Advertising"],[0,10,840,915,"3",0,4,"Staff","ARMR 1B01","Topic: Copywriting"],[0,1,1080,1230,"3",0,6,"Staff","HALE 240","Topic: Event Planning"],[0,4,1080,1230,"3",3,0,"Staff","MUEN E064","Topic: Advertising Media Planning"]]],["APRD 3302","Case Studies in Public Relations","3",0,["Designed to help develop and refine critical thinking in selecting, creating and applying tools, techniques and principles of public relations to a variety of managerial cases and problem situations. Requisites: Requires a prerequisite course of APRD 2002 (minimum grade D-). Restricted Strategic Communication (STCM) majors only.",[0,10,660,735,"3",12,0,"Seow Lee","MUEN E130"],[0,1,1110,1260,"3",40,0,"Amos Gelb","CU in DC Carnegie","Notes: This is a combined section class"]]],["ANTH 5345","Archaeological Theory","3",0,["Provides an advanced historical introduction to archaeological theory and methods. Designed to help students understand why certain issues have been and are important to the development of archaeology, especially American archaeology. Explores issues within the context of the history of anthropology and American society as a whole.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               Requisites: Restricted to graduate students only.",[0,2,780,930,"3",16,0,"Arthur Joyce","HALE 455"]]],["ASTR 5720","Galaxies","3",0,["Highlights the classification, structure, content, dynamics, and other observational properties of galaxies, active galaxies, and clusters of galaxies. Discusses Hubble's Law, the cosmic distance scale,and the intergalactic medium. Department enforced requisite, senior level undergraduate physics. Requisites: Restricted to graduate students only.",[0,21,900,950,"3",25,0,"Julia Comerford","DUAN E126"]]],["ANTH 5160","Early Hominin Paleoecology","3",0,["Explores current thinking about the diets, environments and lives of early human ancestors and their close kin. There is a strong emphasis on the methods used to construct such knowledge. Same as ANTH 4160. Requisites: Restricted to graduate students only.",[0,4,720,870,"3",5,0,"Matthew Sponheimer","HALE 450","Notes: This is a combined section class"]]],["ATOC 4700","Weather Analysis & Forecasting","3",0,["Utilizing a range of operational weather observations to analyze current weather conditions, providing hands-on experience interpreting observations and relating those observations to the physical principles that govern atmospheric behavior is the course emphasis. It focuses on how to read weather reports, analyze observations, and how to prepare weather maps to analyze current conditions and how to interpret numerical weather forecasts. Department enforced prereqs., ATOC 1050 or 1060 or 4720. Approved for arts and sciences core curriculum: natural science.",[0,10,990,1065,"3",17,0,"Betsy Forrest","SEEC S125"]]],["APRD 5004","Experiential Design Studio 2","3",0,["None",[5,2,1050,1230,"3",29,0,"Leonard Beasley, ","OFF SITE"]]],["ACCT 4620","Auditing and Assurance Services","3",1,["Emphasizes the value of assurance services, including the market for financial-statement audits, and the audit decision process, from obtaining a client through planning and testing, to issuance of the audit report. Focuses on making judgments and decisions under conditions of uncertainty and continually evaluating the substance of business transactions over their form.  Same as ACCT 5620. Requisites: Requires a prerequsite course of ACCT 3230 (minimum grade D-).  Restricted to Accounting (ACCT) majors 52-180 units completed.",[0,10,1020,1095,"3",0,0,"David Frederick","KOBL 220","Notes: This is a combined section class"]]],["APRD 2002","Principles of Public Relations","3",0,["Overview of public relations practice and theory including history, media channels and relations, legal and ethical concerns, international and diverse perspectives, and career options. Similar to JOUR 4272. Requisites: Requires prerequisite courses of APRD 1001 and APRD 1002 (all minimum grade D-). Restricted to Strategic Communication (STCM) majors only.",[0,21,540,590,"3",92,0,"Dawn Doty","MCOL W100"]]],["ASTR 5830","Topics in Planetary Science","3",0,["Examines current topics in planetary science, based on recent discoveries, spacecraft observations, and other developments. Focuses on a specific topic each time the course is offered, such as Mars, Venus, Galilean satellites, exobiology, comets, or extrasolar planets. May be taken twice for credit. Same as ATOC 5830 and GEOL 5830. Requisites: Restricted to graduate students only.",[0,10,840,915,"3",9,0,"Bruce Jakosky","DUAN E126","Topic: Astrobiology"]]],["ANTH 7020","Seminar: Physical Anthropology","3",0,["In-depth discussion of selected topics in physical anthropology with emphasis on recent research. May be repeated up to 6 total credit hours.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               Requisites: Restricted to graduate students only.",[3,4,660,810,"3",9,0,"Michelle Sauther","HALE 129","Topic: Primate Evol Ecol / Comp Bio"]]],["BCOR 1025","Statistical Analysis in Business","3",0,["Covers sampling concepts, graphical and numerical data summaries, basic probability theory, discrete and continuous probability models, sampling distributions, hypothesis testing, correlation, and both simple and multiple regression analysis. Students learn decision making and solving business problems by using data. Uses statistical features of Excel. Course requirements: laptop with Excel 2010 or newer; clickers. Credit not granted for this course and BCOR 1020. Requisites: Requires a prerequisite or corequisite course of MATH 1112 or a prerequisite course of MATH 1071 (minimum grade D-). Restricted to Business (BUSN), Advertising (ADVT) or International Affairs (IAFS) majors only.",[0,5,570,645,"3",70,0,"Donald Oest","KOBL 210"],[0,5,660,735,"3",64,0,"Donald Oest","KOBL 210"],[0,5,750,825,"3",64,0,"Kevin Schaub","KOBL 210"],[0,5,750,825,"3",28,0,"Heather Adams","CHEY 240"],[0,5,840,915,"3",24,0,"Kevin Schaub","CHEY 240"],[0,10,930,1005,"3",44,0,"Heather Adams","CHEY 240"],[0,10,570,645,"3",42,0,"Donald Oest","CHEY 240"],[0,10,840,915,"3",44,0,"Ozlem Koc","CHEY 240"],[0,10,930,1005,"3",44,0,"Ozlem Koc","CHEY 240"],[0,10,480,555,"3",44,0,"Christina Fisher","CHEY 240"],[0,5,570,645,"3",40,0,"Christina Fisher","KOBL 330"],[0,5,660,735,"3",39,0,"Christina Fisher","KOBL 330"],[0,5,480,555,"3",39,0,"Christina Fisher","KOBL 330"]]],["APRD 1000","Creative Industries","3",0,["Explores creative and strategic thinking and the many industries involved in creating brand communication as well as these industries growing interdependence in a changing media landscape. Considers technology's impact and the effect of commercial culture on an increasingly diverse society.",[0,10,840,915,"3",307,0,"Melinda Cheval","CHEM 140"]]],["ASTR 1010","Introductory Astronomy 1","4",0,["Introduction to the night sky, planets, moons, and the life in our solar system.  Highlights the latest discoveries from space.  For non-science majors.  Some lectures may be held at Fiske Planetarium. Requires nighttime observations at Sommers-Bausch Observatory.  Similar to ASTR 1000, but with additional lab.  Credit for only one of ASTR 1000, 1110, 1010, or 1030.  Meets MAPS requirement for natural science: lab.  Approved for arts and sciences core curriculum: natural science (lab, sequence).",[0,10,840,915,"4",199,0,"Douglas Duncan","DUAN G1B20"],[2,2,540,645,"4",23,0,"Staff","OBSV S175"],[2,2,660,765,"4",23,0,"Staff","OBSV S175"],[2,4,540,645,"4",21,0,"Staff","OBSV S175"],[2,4,660,765,"4",18,0,"Staff","OBSV S175"],[2,4,780,885,"4",22,0,"Staff","OBSV S175"],[2,4,900,1005,"4",21,0,"Staff","OBSV S175"],[2,8,660,765,"4",24,0,"Staff","OBSV S175"],[2,16,540,645,"4",0,0,"Staff","OBSV S175"]]],["ASTR 8990","Doctoral Dissertation","1 - 10",0,["All doctoral students must register for not fewer than 30 hours of dissertation credit as part of the requirements for the degree. For a detailed discussion of doctoral dissertation credit, refer to the Graduate School section.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         Requisites: Restricted to graduate students only.",[6,0,0,0,"1 - 10",100,0,"Staff","TBA"],[6,0,0,0,"1 - 10",100,0,"Douglas Duncan","TBA"],[6,0,0,0,"1 - 10",100,0,"Jeremiah Darling","TBA"],[6,0,0,0,"1 - 10",100,0,"Robert Ergun","TBA"],[6,0,0,0,"1 - 10",100,0,"James Green","TBA"],[6,0,0,0,"1 - 10",100,0,"Philip Armitage","TBA"],[6,0,0,0,"1 - 10",100,0,"John Bally","TBA"],[6,0,0,0,"1 - 10",100,0,"Mitchell Begelman","TBA"],[6,0,0,0,"1 - 10",100,0,"Bruce Jakosky","TBA"],[6,0,0,0,"1 - 10",100,0,"Webster Cash","TBA"],[6,0,0,0,"1 - 10",100,0,"John Stocke","TBA"],[6,0,0,0,"1 - 10",100,0,"Nils Halverson","TBA"],[6,0,0,0,"1 - 10",100,0,"Nicholas Schneider","TBA"],[6,0,0,0,"1 - 10",100,0,"Jason Glenn","TBA"],[6,0,0,0,"1 - 10",100,0,"Larry Esposito","TBA"],[6,0,0,0,"1 - 10",100,0,"Mark Rast","TBA"],[6,0,0,0,"1 - 10",100,0,"Juri Toomre","TBA"],[6,0,0,0,"1 - 10",100,0,"Brian Hynek","TBA"],[6,0,0,0,"1 - 10",100,0,"Owen Toon","TBA"],[6,0,0,0,"1 - 10",100,0,"Julia Comerford","TBA"],[6,0,0,0,"1 - 10",100,0,"Jack Burns","TBA"],[6,0,0,0,"1 - 10",100,0,"Frances Bagenal","TBA"],[6,0,0,0,"1 - 10",100,0,"Daniel Scheeres","TBA"],[6,0,0,0,"1 - 10",100,0,"Michael Shull","TBA"],[6,0,0,0,"1 - 10",100,0,"Kevin France","TBA"],[6,0,0,0,"1 - 10",100,0,"Steven Cranmer","TBA"],[6,0,0,0,"1 - 10",100,0,"Glen Stewart","TBA"],[6,0,0,0,"1 - 10",100,0,"Erica Ellingson","TBA"],[6,0,0,0,"1 - 10",100,0,"Benjamin Brown","TBA"],[6,0,0,0,"1 - 10",100,0,"Theodore Snow","TBA"],[6,0,0,0,"1 - 10",100,0,"David Brain","TBA"],[6,0,0,0,"1 - 10",100,0,"Staff","TBA"],[6,0,0,0,"1 - 10",100,0,"Staff","TBA"],[6,0,0,0,"1 - 10",100,0,"Staff","TBA"],[6,0,0,0,"1 - 10",100,0,"Staff","TBA"],[6,0,0,0,"1 - 10",100,0,"Staff","TBA"]]],["ANTH 4720","Departmental Honors in Anthropology 2","3",0,["Continuation of ANTH 4710. Recommended prereq., ANTH 4710.",[3,2,600,750,"3",5,0,"Carla Jones","HALE 455"]]],["ASTR 3800","Introduction to Scientific Data Analysis and Computing","3",0,["Introduces scientific data analysis from a practical perspective.  Covers statistical analysis, model fitting, error analysis, theoretical compliance and image analysis with examples from space-based and ground-based astronomy. Elective for APS major. Requisites: Requires prerequisite or corequisite courses of (ASTR 1020 or 1040) and PHYS 1120 and (APPM 1360 or MATH 2300) and ASTR 2600 (all minimum grade C-).",[0,5,900,1020,"3",8,0,"Webster Cash","OBSV S125"]]],["ARSC 1440","MASP Coseminar: Mathematics","1",0,["Offers an unusual and essential opportunity for students to receive small-group enrichment and reinforcement. Supplements and strengthens student experiences in mathematics, allowing particularly gifted students an opportunity to extend their understanding of the subject in a supportive environment, and to explore possible careers inscience. May be repeated up to 2 total credit hours.",[3,10,570,645,"1",3,0,"William Piper","FLMG 244","Topic: SASC CO-SEM: Math"],[3,10,570,645,"1",8,0,"William Piper","FLMG 170","Topic: SASC CO-SEM: Math"]]],["AREN 4045","Architectural Structures 2","3",0,["Analyzes basic structural systems. Covers principles of mechanics as applied to the design of flexural members, columns, continuous beams, and rigid frames. For nonengineering students; does not apply toward an engineering degree. Requisites: Requires prerequisite course of AREN 4035 (minimum grade C-).",[0,10,1050,1125,"3",15,0,"Jeffrey Keely","ECCR 116"]]],["ARTH 2049","Introduction to Roman Art and Architecture","3",0,["Introduces the monuments and sites of the ancient Roman world from the foundation of Rome (753 B.C.E.) to Constantine (306-307 C.E.). Emphasizes the relationship of art, architecture, and artifacts to the political, social, and religious institutions of Italy and the provinces. Same as CLAS 2049. Formerly CLAS 3049. Approved for arts and sciences core curriculum: literature and the arts.",[0,21,600,650,"3",10,0,"Edwin Lansford","VAC 1B88","Notes: This is a combined section class"]]],["APRD 2003","Principles of Design","3",0,["Provides a comprehensive survey of the ideas, events, and individuals that determined the design of information, objects, culture, and commerce across societies. Students will examine the social, political and cultural contexts that have shaped media design and the ideologies and relationships of similar movements in art and architecture. Requisites: Requires prerequisite courses of APRD 1001 and APRD 1002 (all minimum grade D-). Restricted to Strategic Communication (STCM) majors only.",[0,10,930,1005,"3",89,0,"David Smail","MCOL W100"]]],["BUSM 3002","Business and Financial Analytics","3",0,["Focuses on the use of quantitative tools to interpret and solve important problems in business and finance. Makes extensive use of spreadsheet modeling, analysis, and minicases to present material. Targeted at students with an interest in quantitative methods and modeling. Requisites: Requires prerequisite courses of BUSM 2001 and 2002 (minimum grade D-). Restricted to students with Business Minor (BUSM-MIN) plan.",[0,5,930,1005,"3",51,0,"Christina Fisher, ","KOBL S135"]]],["AREN 4110","HVAC Design","3",0,["Applies engineering principles to the design of heating, ventilating, and air conditioning (HVAC) systems for buildings. Covers HVAC systems description, load estimating, applied psychometrics, coils and heat exchangers, air and water distribution systems, and primary equipment and systems. Same as AREN 5110. Requisites: Requires prerequisite course of AREN 3010 (minimum grade C-).",[0,10,660,735,"3",13,0,"Gregor Henze","ECCR 139","Notes: This is a combined section class"]]],["ASEN 3046","Introduction to Humans in Aviation","3",0,["Investigates the history of manned aviation accomplished through a review of the history of flight, the physiological and psychological limitations facing aviators, and investigates the human related causal factors in aviation accidents.  The course also looks at the social and economic impacts of aviation in modern society.  Not accepted as a Professional Area Elective for ASEN majors.  Approved for upper-division Humanities and Social Science elective for engineering students.",[0,16,1020,1190,"3",98,0,"Frank Scott","FLMG 155"]]],["ACCT 6450","Taxation of Corporations","3",1,["Studies federal income taxation related to taxable corporations, the entities through which a large part of the economic activity in the U.S. is conducted. Includes creation, operation, distributions, sale of interests, and liquidation. Same as LAWS 6157. Requisites: Requires corequisite courses of ACCT 6420 and ACCT 6700. Restricted to Bus Admin, Acct, Acct-Tax, Acct-Info Syst, Mgt Sci-Info Syst, Fnce, Mktg or Master of Business Admin graduate students only.",[0,5,780,860,"3",0,4,"Eric Zinn","WLAW 304","Notes: This is a combined section class"]]],["ARSC 1460","SASC Coseminar: Biology","1",0,["Supplements and strengthens student experiences in MCDB 1150 and 2150. Allows particularly gifted students an opportunity to extend their understanding of the subject and to explore possible careers in science. May be repeated up to 2 total credit hours.",[3,16,780,890,"1",4,0,"Lameese Akacem","FLMG 241"]]],["ANTH 4580","The Holocaust: An Anthropological Perspective","3",0,["Focuses on the Holocaust during the Third Reich, which involved the murder of millions of people, including six million Jews. Reviews the Holocaust's history, dynamics, and consequences as well as other genocides of the 20th century, using an anthropological approach. Same as JWST 4580. Requisites: Restricted to students with 57-180 credits (Juniors or Seniors).",[0,10,840,915,"3",5,0,"P Shankman","HUMN 250","Notes: This is a combined section class"]]],["ARTF 5500","Cinema Production 2","3",0,["Advanced exploration of creative cinema production through short production and post-production projects. Course focuses on the tactics and strategies of independent cinema production exploring either documentary, experimental, or narrative genres. May be repeated up to 9 total credit hours. Same as FILM 4500. Requisites: Requires prerequisite course of FILM 3400 (minimum grade D-). Restricted to graduate students only.",[0,5,780,915,"3",3,0,"Kelly Sears","ATLS 342","Topic: BFA Capstone 2"]]],["ATLS 2000","The Meaning of Information Technology","3",0,["Surveys the history of information technologies and modern techniques of information production, storage, transmission, and retrieval. Emphasizes understanding not only the technological transformations in interpersonal, organizational, and mass communication, but also the technological, social and political changes that underlie the movement toward a digital society. ATLS 2000 and HUEN 2020 are the same course. Requisites: Restricted to students in the Atlas student group (PATL) only.",[0,10,750,825,"3",74,0,"Christopher Carruth","ATLS 100"],[0,10,840,915,"3",73,0,"Christopher Carruth","ATLS 100"]]],["APRD 3103","Strategic Writing for Public Relations","3",0,["Emphasis on communication tactics; plan, write and execute public relation tools; audience segmentation; media selection; application of social media channels. Requisites: Requires a prerequisite course of APRD 2002 (minimum grade D-).",[0,21,660,710,"3",15,0,"Dawn Doty","MUEN E130"],[0,2,1080,1230,"3",11,0,"Staff","HALE 240"],[0,4,1080,1230,"3",0,0,"Staff","HLMS 259"]]],["ARTH 1400","History of World Art 2","3",0,["Surveys major art styles from about 1600 to the present, including Europe, Asia, the Islamic world, the Americas, and tribal arts. Emphasizes comparison of Western and non-Western visual expressions as evidence of differing cultural orientations. Credit not granted for this course and FINE 1409. Approved for GT-AH1. Approved for arts and sciences core curriculum: literature and the arts.",[0,21,660,710,"3",409,0,"Kirk Ambrose","HUMN 1B50"],[1,8,480,530,"3",17,0,"Valeria Serrano","VAC 485"],[1,16,480,530,"3",19,0,"Laura Thompson","VAC 485"],[1,8,540,590,"3",19,0,"Valeria Serrano","VAC 485"],[1,16,540,590,"3",18,0,"Laura Thompson","VAC 485"],[1,8,600,650,"3",18,0,"Valeria Serrano","VAC 485"],[1,16,600,650,"3",15,0,"Laura Thompson","VAC 485"],[1,8,660,710,"3",17,0,"Molly McGill","VAC 485"],[1,16,660,710,"3",19,0,"Gladys Preciado","VAC 485"],[1,8,720,770,"3",18,0,"Molly McGill","VAC 485"],[1,16,720,770,"3",18,0,"Gladys Preciado","VAC 485"],[1,8,780,830,"3",17,0,"Molly McGill","VAC 485"],[1,16,780,830,"3",18,0,"Gladys Preciado","VAC 485"],[1,8,840,890,"3",18,0,"Brianna Humbert","VAC 485"],[1,8,900,950,"3",19,0,"Brianna Humbert","VAC 485"],[1,8,960,1010,"3",19,0,"Brianna Humbert","VAC 485"]]],["AREN 2120","Fluid Mechanics and Heat Transfer","3",0,["Explores fundamental principles of fluid dynamics and heat transfer. Topics include fluid statics, momentum, and energy conservation; laminar and turbulent viscous flow; convection heat transfer; conduction heat transfer; convection heat transfers;  and radiation heat transfer. Requisites: Requires prerequisite courses of APPM 2350 or MATH 2400, and AREN 2110 or GEEN 3852 or MCEN 3012 or ASEN 2002 (all minimum grade C-). Requires corequisite course of APPM 2360. Restricted to College of Engineering majors only.",[0,10,750,825,"3",37,0,"Wangda Zuo","ECCR 135"]]],["ASEN 2004","Aerospace 4: Aerospace Vehicle Design and Performance","5",0,["Introduction to design and analysis of aircraft and spacecraft. Aircraft topics include cruise performance, wing design, propulsion, stability, control, and structures. Spacecraft topics includerocket staging, orbit selection, launch systems, and spacecraft subsystems. Includes laboratory experiments and team design exercises. Offered spring only. Requisites: Requires prerequisite courses of ASEN 2001, 2002, 2012 and APPM 2350 (all minimum grade C).   Requires corequisite courses of APPM 2360 and ASEN 2003.  Restricted to Aerospace Engineering (ASEN) majors only.",[0,10,480,555,"5",161,0,"Brian Argrow, ","DUAN G1B30"],[2,5,480,580,"5",45,0,"Brian Argrow, ","ITLL 2B10"],[2,5,600,700,"5",62,0,"Brian Argrow, ","ITLL 2B10"],[2,5,780,880,"5",54,0,"Brian Argrow, ","ITLL 2B10"]]],["ANTH 5400","Research Methods in Archaeology 2","3",0,["Focuses on the design of research including constructing empirical arguments and testing them, data gathering, site formation processes, field strategies (archival resources, mapping, field survey, surface collecting/recording, excavation and preliminary analysis) and artifact analysis as it relates to research design.",[3,8,780,930,"3",7,0,"Gerardo Gutierrez","HALE 455"]]],["ANTH 3010","The Human Animal","3",0,["Identifies genetic, anatomical, physiological, social, and behavioral characteristics humans share with other mammals and primates. Explores how these characteristics are influenced by modern culture. Recommended prereq., ANTH 2010. Approved for arts and sciences core curriculum: natural science. Requisites: Restricted to students with 57-180 credits (Juniors or Seniors).",[0,10,570,645,"3",16,0,"Herbert Covert","HLMS 199"]]],["ARSC 1490","MASP Humanities Seminar","1",0,["Enhances students' knowledge and appreciation of the humanities. Readings, discussions, cooperative learning exercises, workshopping papers and presentation, guest speakers, and outside activities are designed to enhance both students' appreciation of the subject matter and their performance in their regular courses. Emphasis is on actively using knowledge of humanities in a variety of ways. Department consent required. May be repeated up to 4 total credit hours.",[3,1,960,1035,"1",13,0,"Marcos Steuernagel","CLRE 104"],[3,8,930,1005,"1",15,0,"Karen Ramirez","GUGG 2"]]],["ASIA 4001","Advanced Language Co-Seminar Arts and Humanities","1",0,["None",[3,8,930,980,"1",10,0,"Marcia Yonemoto","CHEM 146"]]],["ATOC 3720","Planets and Their Atmospheres","3",0,["Explores the physics and chemistry of the atmospheres of Mars, Venus, Jupiter, Saturn, and Titan. Examines evolution of the atmospheres of Earth, Venus, and Mars; and the escape of gases from the Galilean satellites, Titan and Mars; the orbital characteristics of moons, planets, and comets. Uses recent results of space exploration. Elective for APS major and minor. Same as ASTR 3720. Requisites: Requires prerequisite courses of PHYS 1110 and 1120 and MATH 1300 and 2300 or APPM 1350 and 1360 (all minimum grade D-).  Restricted to students with 57-180 credits (Junior or Senior) Astronomy (ASTR) or Atmospheric & Oceanic Sciences (ATOC) majors only.",[0,10,840,915,"3",39,0,"Staff","DUAN G130","Notes: This is a combined section class"]]],["ASTR 1020","Introductory Astronomy 2","4",0,["Non-science majors learn the nature and workings of the Sun, stars, neutron stars, black holes, galaxies, quasars, structure and origins of the universe.  Some lectures may be held at Fiske Planetarium.  Offers opportunities for nighttime observations at Sommers-Bausch Observatory.  Includes recitation.  Sequence link ASTR 1010.  Credit for only one of ASTR 1020, 1200, 1120, or 1040. Prereq., ASTR 1010 or 1000.  Approved for arts and sciences core curriculum: natural science (sequence).",[0,10,660,735,"4",184,0,"Charles Danforth","DUAN G1B20"],[1,2,780,830,"4",21,0,"Staff","OBSV S175"],[1,2,780,830,"4",24,0,"Staff","OBSV S125"],[1,2,840,890,"4",23,0,"Staff","OBSV S175"],[1,2,840,890,"4",23,0,"Staff","OBSV S125"],[1,8,540,590,"4",23,0,"Staff","OBSV S175"],[1,8,540,590,"4",24,0,"Staff","OBSV S125"],[1,8,600,650,"4",22,0,"Staff","OBSV S175"],[1,8,600,650,"4",24,0,"Staff","OBSV S125"]]],["ATLS 2200","Web","3",0,["Introduces techniques, technologies and concepts of web design and development through lectures, projects and critiques. Focuses technically on HTML, CSS and JavaScript as the primary web technologies. Contextualizes the technical and societal implications of the Internet through historical and critical perspectives. Requisites: Requires prerequisite course of ATLS 2000 (minimum grade C). Restricted to Technology, Arts and Media (TMEN) majors or the ATLAS (PATL) student group only.",[0,2,570,645,"3",29,2,"Aileen Pierce","ATLS 100"],[1,2,660,735,"3",0,1,"Staff","ATLS 1B25"],[1,2,750,825,"3",0,1,"Staff","ATLS 1B25"],[1,2,840,915,"3",0,0,"Staff","ATLS 1B25"],[1,2,930,1005,"3",5,0,"Staff","ATLS 1B25"],[1,2,1020,1095,"3",9,0,"Staff","ATLS 1B25"],[1,8,1020,1095,"3",11,0,"Staff","ATLS 1B25"],[1,8,840,915,"3",4,0,"Staff","ATLS 1B31"]]],["BADM 6940","Land Use Law","3",0,["Examines Federal, state and local regulations governing land use in the U.S. and surveys the basic principles of urban planning and public finance. Describes basic tools governments use to control land use: Euclidean zoning, nuisance law, police power, eminent domain and takings, Planned Urban Developments, historic preservation, wetlands and flood zones, airports, endangered species, view restrictions, and environmental law. Requisites: Restricted to Master of Business Admin (MBAD), MBA with Dual Degree (DMBA), Joint Juris Doctor/MBA (JMBA), Professional MBA Program (PMBA), Supply Chain Management (SCMN) or Business Analytics (BUAN) majors only.",[0,4,960,1125,"3",8,0,"Thomas Ragonetti, ","TBA"]]],["APRD 3001","Intermediate Design Concepts","3",0,["Students are introduced to design elements and principles, resarch and visual storytelling. They are challenged to communicate intellectual, sensory and emotional conepts by learning a visual vocabulary of type, color, and form expressed in a variety of mediums and dimensons. Similar to JOUR 4513. Requisites: Requires a prerequisite course of APRD 2003 or APRD 2003 (minimum grade D-). Requires a corequisite course of APRD 3000. Restricted to Strategic Communication (STCM) majors only.",[0,2,1080,1230,"3",5,0,"Michael Benjamin","HLMS 259"],[0,4,1080,1230,"3",15,0,"Andrew Stone","HUMN 186"]]],["ATLS 5809","Computer Animation","3",0,["Develops a firm understanding of the general principles of computer animation. Lectures cover the creation of models, materials, textures, surfaces, and lighting. Path and key frame animation, particle dynamics, and rendering are introduced. Students are assigned a number of animation tutorials to carry out. Same as ATLS 4809 and CSCI 4809/5809 Requisites: Restricted to graduate students only.",[0,5,1020,1095,"3",4,0,"Roger King","ATLS 1B31","Notes: This is a combined section class"]]],["ARSC 1480","MASP Social Science Seminar","1",0,["Fosters an appreciation of the social sciences. Readings, discussions, cooperative learning exercises, and outside activities illustrate the interconnections between different bodies of knowledge. Emphasizes relationships between the social sciences and the real world. Department consent required. May be repeated up to 4 total credit hours.",[3,2,930,1005,"1",15,0,"Celeste Montoya","HLMS 104"]]],["ARTH 3929","Special Topics in Art History","3",0,["May be repeated up to 18 total credit hours when topic varies.",[0,10,1020,1095,"3",22,0,"Robert Nauman","VAC 308","Topic: Critical Issues - Photography"],[0,21,600,650,"3",26,0,"Hannah Friedman","VAC 308","Topic: Northern Renaissance"]]],["ASEN 4057","Aerospace Software","3",1,["Provides an overview of prevalent software and hardware computing concepts utilized in practice and industry. Establishes the background necessary to tackle programming projects on different computing platforms with various software tools and programming languages. Recommended prereqs., CSCI 1320 or ECEN 1310 or COEN 1300. Requisites: Restricted to Aerospace Engineering (ASEN) or Aerospace Engineering Concurrent Degree (C-ASEN) majors only.",[0,5,540,590,"3",0,11,"Tomoko Matsuo","ECCE 141"],[2,5,600,650,"3",0,11,"Tomoko Matsuo","ECCE 141"]]],["AREN 4560","Luminous Radiative Transfer","3",0,["Teaches fundamentals of radiative exchange as applied to illumination engineering. Describes and uses principal numerical techniques for radiative transfer analysis. Applies techniques to lighting design and analysis.  Taught intermittently. Requisites: Requires prerequisite course of AREN 3540 (minimum grade C-).",[0,21,780,830,"3",14,0,"Jennifer Scheib","ECCR 116","Notes: This is a combined section class"]]],["ASIA 2000","Gateway to Modern Asia: Exploring Regional Connections","3",0,["Introduces main themes, intellectual approaches used in Asian Studies through a transdisciplinary perspective that focuses on interactions and links between geographic regions and national boundaries. Presents Asia as a concept, a powerful imaginary geography, and historically dynamic construct that has shaped / been shaped by global patterns of economic development, nation building, war and diplomacy, colonialism and aspirations for better lives.",[0,10,840,915,"3",28,0,"J Berry","CLUB 13"]]],["APRD 5011","Book Lab","1",0,["None",[5,2,750,930,"1",30,0,"Emily Smith","OFF SITE"]]],["ARTF 5200","Flow Visualization","3",0,["http://www.colorado.edu/MCEN/flowvls/",[0,21,660,710,"3",1,0,"Jean Hertzberg","ITLL 1B50","Notes: This is a combined section class"]]],["ATOC 3050","Principles of Weather","3",0,["Explores the processes that influence middle latitude weather including atmospheric thermodynamics, cloud and precipitation processes, atmospheric dynamics, air masses and fronts, and mid-latitude cyclones. Recitations and homework assignments will allow students to apply these concepts to real weather data through analysis of weather maps, thermodynamics diagrams, and conceptual models. Department enforced prereq., ATOC 1050. Approved for Arts and Sciences core curriculum: natural science.",[0,5,675,725,"3",28,0,"John Cassano","SEEC N128"],[1,16,675,725,"3",11,0,"Staff","SEEC N126"],[1,8,990,1040,"3",17,0,"Staff","SEEC N129"]]],["APRD 4501","Design for Social Innovation","3",0,["Provides an introduction to design thinking as a means to drive social change and solve real-world problems. This studio class is project based and asks students to experiment with new behaviors of work and learning, including: collaboration, iteration, prototyping, empathizing, craft and inference. Field work and collaboration with teammates are required. Requisites: Requires a prerequisite course of APRD 2000 (minimum grade D-). Restricted Strategic Communication (STCM) majors only with a minimum of 80 hours.",[5,8,1080,1230,"3",4,0,"Russell Bowen","HLMS 181"]]],["AREN 4849","Independent Study","1 - 3",0,["Offers an independent, in-depth study, research, or design in a selected area of architectural engineering. Offerings are coordinated with individual faculty. Students should consult the Department of Civil, Environmental, and Architectural Engineering. Numbered AREN 4840 through AREN 4849.",[7,0,720,720,"1 - 3",30,0,"Staff","TBA"]]],["ASEN 5335","Aerospace Environment","3",0,["Examines the components of the solar-terrestrial system and their interactions to provide an understanding of the re-entry and orbital environments within which aerospace vehicles operate. Includes the sun, solar wind, magnetospere, ionosphere, thermosphere, radiation belts, energetic particles, comparative environments (Mars, Venus, etc.), orbital debris, spacecraft charging, particle effects on systems, shielding, and satellite drag. Recommended restriction, senior or graduate standing in engineering or related physical sciences.",[0,10,840,915,"3",0,3,"Delores Knipp","ECCS 1B28"],[0,0,0,0,"3",17,0,"Delores Knipp","Distance Section"]]],["BCOR 2003","Business Law, Ethics and Social Responsibility","3",0,["Throughout the course students will consider the interconnectedness of law, ethics, values, public policy and regulation. Emphasis will be placed on the importance of individual and organizational responsibility for business. Allows students to consider the relationship between law and ethics in the broader social context, which is necessary to successfully navigate an increasingly complex, global business environment. Credit not granted for this course and BCOR 3000 and BCOR 3010. Requisites: Requires prerequisite courses of BCOR 1015 and BCOR 1025 and ECON 2010 (all minimum  grade D-). Restricted to Business (BUSN) majors with 26-180 units completed.",[0,10,480,555,"3",72,0,"Elizabeth Stapp, ","KOBL 330"],[0,10,570,645,"3",69,0,"Elizabeth Stapp, ","KOBL 330"],[0,10,660,735,"3",72,0,"Elizabeth Stapp, ","KOBL 330"],[0,10,750,825,"3",68,0,"Elizabeth Stapp, ","KOBL 330"]]],["ASEN 4519","Special Topics","3",0,["Studies specialized aspects of the aerospace engineering sciences or innovative treatment of required subject matter at the upper-division level. Course content is indicated in the online Schedule Planner. Department enforced prereq., varies. Requisites: Restricted to College of Engineering majors only.",[0,10,930,1005,"3",24,0,"Robert Nerem","FLMG 104","Topic: Climate Change and Engineering"]]],["ATLS 4519","Advanced Special Topics in Technology, Arts, and Media","varies",0,["Analyzes special interest areas of multidisciplinary technology, arts and media research and practice. May be repeated up to 9 total credit hours. Same as ATLS 3519, 5519 and 6519. Requisites: Restricted to Technology, Arts and Media (TMEN) majors or the ATLAS (PATL) student group only.",[3,4,780,1010,"4",4,0,"Yi Luen Ellen Do","ATLS 1B25","Topic: Capstone Projects 2"],[0,5,660,735,"3",0,2,"Mark Gross","ATLS 113","Topic: Wearable Technologies"],[0,5,900,975,"3",3,0,"Daniel Leithinger","ATLS 113","Topic: Physical Comp Interfaces"],[0,2,930,1040,"3",6,0,"David Schaal","ATLS 104","Topic: Web Creative Dev Tools"],[2,8,930,1040,"3",6,0,"David Schaal","ATLS 104","Topic: Web Creative Dev Tools"],[0,1,780,930,"3",8,0,"Ryan Shapiro","ECES 114","Topic: Interactive Mach Learn HCI"],[0,2,540,650,"3",15,0,"Aileen Pierce","ATLS 104","Notes: This is a combined section class"],[2,8,540,650,"3",15,0,"Aileen Pierce","ATLS 104","Notes: This is a combined section class"],[0,1,960,1070,"3",12,0,"John Bacus","ATLS 104","Topic: Product Development Studio"],[2,4,960,1070,"3",12,0,"John Bacus","ATLS 104","Topic: Product Development Studio"],[0,2,540,650,"3",9,0,"Ian Hales","ATLS 104","Topic: Advanced Motion"],[2,8,540,650,"3",9,0,"Ian Hales","ATLS 104","Topic: Advanced Motion"]]],["APRD 3301","Social Media Strategies for Public Relations","3",0,["Emphasis on how social media and internet marketing influence public relations; understand the fundamentals and best practices in social media management, visual communication and mobile applications. Requisites: Requires a prerequisite course of APRD 2002 (minimum grade D-). Restricted Strategic Communication (STCM) majors only.",[0,10,570,645,"3",0,3,"Kate Stabrawa","ARMR 218"],[0,10,840,915,"3",0,6,"Tobias Hopp","TBA"],[0,8,1110,1260,"3",39,0,"Amos Gelb","CU in DC Carnegie","Notes: This is a combined section class"]]],["ATLS 5900","Masters Level Independent Study","1 - 6",0,["Provides opportunities for independent study and research at the Masters level. Students work on research project guided by faculty. May be repeated up to 6 total credit hours. Requisites: Restricted to graduate students only.",[7,0,0,0,"1 - 6",10,0,"Staff","TBA"],[7,0,0,0,"1 - 6",10,0,"Staff","TBA"],[7,0,0,0,"1 - 6",10,0,"Staff","TBA"],[7,0,0,0,"1 - 6",10,0,"Staff","TBA"],[7,0,0,0,"1 - 6",10,0,"Staff","TBA"]]],["ANTH 5500","Cross-Cultural Aspects of Socioeconomic Development","3",0,["Same as ANTH 4500. Requisites: Restricted to graduate students only.",[0,10,750,825,"3",12,0,"Jerry Jacka","HALE 240","Notes: This is a combined section class"]]],["ASEN 5053","Rocket Propulsion","3",0,["An in depth presentation of the theory, analysis, and design of rocket propulsion systems. Liquid and solid propellant systems are emphasized with an introduction to advanced propulsion concepts. Nozzle and fluid flow relationships are reviewed for background. Requisites: Restricted to College of Engineering (ENGR) graduate students or Aerospace Engineering Concurrent Degree (C-ASEN) majors only.",[0,10,930,1005,"3",3,0,"Lakshmi Kantha","ECCS 1B14"],[0,0,0,0,"3",22,0,"Lakshmi Kantha","Distance Section"]]],["ASTR 5835","Seminar in Planetary Science","1",0,["May be repeated up to 4 total credit hours to meet candidacy requirements. Department enforced requisite, senior level undergraduate physics  Same as ATOC 5835 and GEOL 5835. Requisites: Restricted to graduate students only.",[3,2,960,1010,"1",10,0,"Staff","DUAN E126","Notes: This is a combined section class"]]],["APRD 5010","Design Sprint","1",0,["None",[5,0,0,0,"1",29,0,"Russell Bowen","OFF SITE"]]],["ASTR 3830","Astrophysics 2 - Galactic and Extragalactic","3",0,["The second semester of a year-long introduction to astrophysical processes.  The physical processes developed in ASTR 3730 are applied to topics in extragalactic astronomy, including galaxies, supermassive black holes, galaxy clusters and cosmology. Elective for APS major and minor. Requisites: Requires prerequisite or corequisite course of ASTR 3730 and PHYS 2130 or PHYS 2170 and MATH 2400 or APPM 2350 (all minimum grade C-).",[0,10,660,735,"3",28,0,"Philip Armitage","DUAN G131"]]],["ARSC 1710","SASC Coseminar: Mathematics","1",0,["Provides motivated pre-calculus students with more in-depth and more challenging coverage of material assumed in calculus. Students complete advanced problems that cannot be covered in pre-calculus courses due to time constraints. Mastery of material is emphasized. Prereq., proficiency in high school mathematics.",[3,5,810,885,"1",3,0,"Christopher Aquinto","FLMG 150"]]],["APRD 3100","Design for Digital Media","3",0,["Explores how to create and produce effective and engaging designs for dynamic information across a variety of screens while maintaining brand identity. Extending the design principles learned in previous classes, the student will concept for user interfaces (UI) and navigational frameworks that optimize usability, accessibility. Requisites: Requires prerequisite courses of APRD 3000 and APRD 3001 or JOUR 3503 (all minimum grade D-). Restricted to Strategic Communication (STCM) majors only.",[0,21,780,830,"3",8,0,"Jeff Curry","KTCH 1B44"]]],["ASEN 2003","Aerospace 3: Introduction to Dynamics and Systems","5",0,["Introduces the principles of particle and planar rigid body dynamics, systems, and controls. Topics include kinematics, kinetics, momentum and energy methods, system modeling, and simple feedback control. Class includes experimental and design laboratory exercises for aerospace applications of dynamic principles. Offered spring only. Requisites: Requires prerequisite courses of ASEN 2001, ASEN 2012 and APPM 2350 (all minimum  grade C).  Requires corequisite courses of APPM 2360 and ASEN 2004.  Restricted to Aerospace Engineering (ASEN) majors only.",[0,10,660,735,"5",96,0,"Eric Frew, ","CHEM 140"],[2,5,900,1000,"5",35,0,"Eric Frew, ","ITLL 2B10"],[2,5,660,760,"5",13,0,"Eric Frew, ","ITLL 1B10"],[2,10,855,955,"5",48,0,"Eric Frew, ","ITLL 2B10"]]],["ATLS 4900","Undergraduate Independent Study","1 - 3",0,["Provides opportunities for independent study at the upper-division undergraduate level. Students work on research or a creative project guided by faculty. May be repeated up to 9 total credit hours. Department consent required. Requisites: Requires prerequisite courses of ATLS 3010 and 3020 (all minimum grade D-).",[7,0,0,0,"1 - 3",9,0,"Ryan Shapiro","TBA"],[7,0,0,0,"1 - 3",10,0,"Staff","TBA"],[7,0,0,0,"1 - 3",10,0,"Staff","TBA"],[7,0,0,0,"1 - 3",10,0,"Staff","TBA"],[7,0,0,0,"1 - 3",10,0,"Staff","TBA"]]],["AIRR 4020","National Security Forces in Contemporary  American Society 2","3",0,["Two 1 1/2-hour seminars and one 2-hour lab per week. A continuation of AIRR 4010. Includes defense strategy conflict management, formulation/implementation of U.S. defense policy, and organizational factors and case studies in policy making, military law, uniform code of military justice, and communication skills.",[0,10,570,645,"3",29,0,"Staff","STAD 135"],[2,8,930,1130,"3",29,0,"Staff","DUAN G1B30"],[0,10,840,915,"3",29,0,"Staff","STAD 135"],[2,8,930,1130,"3",29,0,"Staff","DUAN G1B30"]]],["ATOC 8990","Doctoral Dissertation","1 - 10",0,["All doctoral students must register for not fewer than 30 hours of dissertation credit as part of the requirements for the degree. For a detailed discussion of doctoral dissertation credit, refer to the Graduate School section.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         Requisites: Restricted to graduate students only.",[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"John Cassano","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Katja Friedrich","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Weiqing Han","SEE DEPT"],[6,0,0,0,"1 - 10",998,0,"Alexandra Jahn","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Kristopher Karnauskas","SEE DEPT"],[6,0,0,0,"1 - 10",998,0,"Jennifer Kay","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Nicole Lovenduski","SEE DEPT"],[6,0,0,0,"1 - 10",998,0,"Julie Lundquist","SEE DEPT"],[6,0,0,0,"1 - 10",998,0,"Peter Pilewskie","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Cora Randall","SEE DEPT"],[6,0,0,0,"1 - 10",998,0,"Sebastian Schmidt","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Darin Toohey","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Owen Toon","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Jeffrey Weiss","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Mary Alexander","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"David Noone","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Matthew Shupe","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Julienne Stroeve","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Rainer Volkamer","SEE DEPT"],[6,0,0,0,"1 - 10",998,0,"Melville Nicholls","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"],[6,0,0,0,"1 - 10",999,0,"Staff","SEE DEPT"]]],["BADM 4900","Independent Study","1 - 3",0,["Intended only for exceptionally well qualified business seniors. Department form required. Requisites: Restricted to Business (BUSN) majors only.",[7,0,0,0,"1 - 3",5,0,"Staff","TBA"]]],["ASTR 3720","Planets and Their Atmospheres","3",0,["Explores the physics and chemistry of the atmospheres of Mars, Venus, Jupiter, Saturn, and Titan. Examines evolution of the atmospheres of Earth, Venus, and Mars; and the escape of gases from the Galilean satellites, Titan and Mars; the orbital characteristics of moons, planets, and comets. Uses recent results of space exploration. Elective for APS major and minor. Same as ATOC 3720. Requisites: Requires prereq or coreq of MATH 2300 or APPM 1360 and ASTR 1010 or 1000 or 1030 and ASTR 1200 or 1020 or 1040 and PHYS 1010 or 1110 or 2010 and PHYS 1020 or 1120 or 2020 (all minimum grade C-).",[0,10,840,915,"3",23,0,"Staff","DUAN G130","Notes: This is a combined section class"]]],["ACCT 4540","Accounting Information Systems","3",0,["Considers the interaction of accountants with information systems and the role of accounting information systems in business processes. Focuses on the tools used by accountants and provides an understanding of accounting as an information system.  Same as ACCT 5540. Requisites: Requires a prerequsite course of ACCT 3220 or ACCT 3225 (minimum grade D-).  Restricted to Accounting (ACCT) majors with 52-180 units completed.",[0,2,1110,1275,"3",8,0,"Staff","KOBL 320","Notes: This is a combined section class"]]],["ASIA 4830","Capstone Seminar in Asian Studies","3",0,["Participates in a discussion seminar on topics in Asian Studies, conducts research and writes a thesis or creates a project on an approved Asian topic, following guidelines established by the program director. Required for an Asian Studies major. Requisites: Restricted to students with 57-180 credits (Junior or Senior) Asian Studies (ASIA) majors only.",[3,5,900,950,"3",23,0,"J Berry","HUMN 145"]]],["ARAB 3230","Islamic Culture and the Iberian Peninsula","3",0,["Examines Islamic, especially Arab, culture and history as it relates to the Iberian Peninsula from 92 Ah/711 Ce to the present. Taught in English. Approved for arts and sciences core curriculum: historical context.",[0,10,660,735,"3",8,0,"Sabahat Adil","KTCH 1B60"]]],["ATOC 4750","Desert Meteorology and Climate","3",0,["Introduces students to the dynamic causes of deserts in the context of atmospheric processes and land-surface physics. Discusses desert severe weather, desert microclimates, human impacts and desertification, inter-annual variability in aridity (drought), the effects of deserts on global climate, and the impact of desert climate on humans. Department enforced prereq., ATOC 1050. Same as ATOC 5750. Approved for arts and sciences core curriculum: natural sciences.",[0,5,765,840,"3",11,0,"Derek Brown","SEEC N128","Notes: This is a combined section class"]]],["ATLS 7900","Doctoral Level Independent Study","1 - 6",0,["Provides opportunities for independent study and research at the Doctoral level. Students perform independent research under faculty supervision. May be repeated up to 6 total credit hours. Requisites: Restricted to Atlas (ATLS) graduate students only.",[7,0,0,0,"1 - 6",10,0,"Staff","TBA"],[7,0,0,0,"1 - 6",10,0,"Staff","TBA"],[7,0,0,0,"1 - 6",10,0,"Staff","TBA"],[7,0,0,0,"1 - 6",10,0,"Staff","TBA"],[7,0,0,0,"1 - 6",10,0,"Staff","TBA"]]],["BADM 4910","VITA-Volunteer Tax Assistance","2",0,["Offers students the opportunity to gain professional work experience in an accounting position while still in school. Provides academically relevant work experience that complements students' studies and enhances their career potential. Requisites: Requires prerequsite courses of BCOR 2000 and ACCT 4440 or 5440 (all minimum grade D-).  Restricted to Business (BUSN) majors with 52-180 units completed.",[7,4,1020,1260,"2",29,0,"Susan Morley","KOBL 375"]]],["ASEN 5148","Spacecraft Design","3",0,["Integrates the design elements and fundamental analyses necessary to complete the conceptual (Phase A) design of an unmanned spacecraft.  Lecture and discussion explore mission design, propulsion, power, structure, thermal, attitude control, communication, command, and data handling and attitude control systems.  The role of project management and systems engineering are examined.  Resource estimating and lessons learned in satellite programs are reviewed. Requisites: Restricted to College of Engineering (ENGR) graduate students or Aerospace Engineering Concurrent Degree (C-ASEN) majors only.",[0,5,570,645,"3",19,0,"Daniel Kubitschek","ECCS 1B12"],[0,0,0,0,"3",90,0,"Daniel Kubitschek","Distance Section"]]],["ARSC 3100","Multicultural Perspective and Academic Discourse","3",0,["Teaches students how to write academic papers related to race, class, gender, sexuality, and other areas of cultural identity. Students acquire expertise on issues through readings, guided discussion, and research and practice oral presentation skills, drafting, and workshopping of papers. Prereq., lower level writing course(s) or waiver. Approved for arts and sciences core curriculum: written communication. Requisites: Restricted to students with 57-180 credits (Juniors or Seniors).",[14,5,660,735,"3",0,0,"Staff","SEE DEPT"],[14,10,660,735,"3",10,0,"Angela Buchanan","FLMG 244"]]],["ASTR 2040","The Search for Life in the Universe","3",0,["Introduces the scientific basis for the possible existence of life elsewhere in the universe.  Includes origin and evolution of life on Earth and the search for evidence of life  in our solar system, including Mars and Jupiter's moon Europa.  Discusses the conditions necessary for life and whether they might arise on planets around other stars.  Credit only for ASTR 2040 or ASTR 3300.  Same as GEOL 2040.  Approved for arts and sciences core curriculum: natural science.",[0,10,930,1005,"3",91,0,"Staff","BESC 180","Notes: This is a combined section class"],[0,10,480,555,"3",28,0,"Stephen Mojzsis","BESC 185","Notes: This is a combined section class"]]],["CAMW 2001","The American West","3",0,["Students tour the cultural, social, and natural features of the American West, based on readings and presentations by guest speakers from the CU faculty and from important professions and positions in the West. Designed as the foundation course in the Western American Studies certificate program.  Approved for GT-HI1.  Approved for arts and sciences core curriculum: United States context. Requisites: Restricted to students with 0-56 credits (Freshmen or Sophomores).",[0,10,660,735,"3",30,0,"Patricia Limerick","HALE 240"]]],["APRD 3300","Crisis Communication in Public Relations","3",1,["Explores theories and research related to public relations communication before, during and after a crisis; examines the fundamentals of organizational communication, crisis management and strategic planning. Requisites: Requires a prerequisite course of APRD 2002 (minimum grade D-). Restricted Strategic Communication (STCM) majors only.",[0,2,1080,1230,"3",0,0,"Dawn Doty","MUEN E118"]]],["AREN 1027","Engineering Drawing","3",0,["Introduces engineering drawing including sections and dimensioning, print readings,computer 3D, and building information modeling (BIM). Requisites: Restricted to students with 0-56 credits (Freshmen or Sophomore) Engineering Physics (EPEN), Architectural (AREN), General Engineering (GEEN) or Civil (CVEN) Engineering majors only.",[0,10,480,555,"3",90,0,"Alexander Gore, ","ECCR 200"],[2,10,555,645,"3",45,0,"Alexander Gore, ","ECCE 141"],[2,10,650,740,"3",45,0,"Alexander Gore, ","ECCE 141"]]],["ARAB 1020","Beginning Arabic 2","5",0,["Continuation of ARAB 1010. Requisites: Requires prerequisite course of ARAB 1010 (minimum grade C).",[0,31,540,590,"5",17,0,"Randa Muhammed","HLMS 152"],[0,31,600,650,"5",17,0,"Randa Muhammed","HLMS 152"],[0,31,660,710,"5",15,0,"Randa Muhammed","HLMS 152"]]],["ATOC 3600","Principles of Climate","3",0,["Describes the basic components of the climate system: the atmosphere, ocean, cryosphere, and lithosphere. Investigates the basic physical processes that determine climate and link the components of the climate system. Covers the hydrological cycle and its role in climate, climate stability, and global change. Includes forecasting climate and its application and human dimensions. Department enforced prereqs., one semester of calculus and ATOC 1050 and ATOC 1060 or ATOC 3300 or GEOG 3301 or GEOG 1001. Same as GEOG 3601/ENVS 3600. Approved for arts and sciences core curriculum: natural science.",[0,10,840,915,"3",1,0,"Peter Blanken","DUAN G2B47","Notes: This is a combined section class"]]],["APRD 3000","Intermediate Creative Concepts","3",0,["Explores both strategic and creative thinking and examines approaches to narrative storytelling as a tool for telling overarching brand stories. Students use the foundation to develop creative briefs and advertising campaigns. Instructor consent required. Similar to JOUR 3503. Requisites: Requires a prerequisite course of APRD 2003 or APRD 2003 (minimum grade D-). Requires a corequisite course of APRD 3001. Restricted to Strategic Communication (STCM) majors only.",[0,21,840,890,"3",9,0,"Jon Ligon","KTCH 1B64"],[0,21,600,650,"3",9,0,"Jeff Curry","MUEN E130"]]],["ANTH 3009","Modern Issues, Ancient Times","3",0,["Considers issues of vital importance to humans, both now and in ancient times. Topics such as food, death, sex, family, literacy, or power are explored to consider how ancient societal norms and attitudes evolved, and how they relate to modern culture. Draws on material and literary evidence to develop an understanding of the complexities of ancient life. Same as CLAS 3009. Formerly ANTH 2009. Approved for arts and sciences core curriculum: historical context.",[0,21,660,710,"3",0,2,"Leigh Baxter","HALE 240","Topic: Archaeology of Death"],[0,21,720,770,"3",0,2,"Leigh Baxter","HALE 240","Topic: Archaeology of Death"],[0,21,780,830,"3",29,0,"Leigh Baxter","HUMN 250","Topic: Archaeology of Death"],[0,21,840,890,"3",42,0,"Leigh Baxter","HLMS 201","Topic: Archaeology of Death"],[0,10,930,1005,"3",0,1,"Dimitri Nakassis","VAC 1B88","Topic: Race and Antiquity"]]],["ARTF 5000","Advanced Digital Postproduction","3",0,["Class explores the advanced practices and aesthetics of computer-based moving-image art editing. Topics include how to edit and manage a postproduction cycle, how to use digital editing systems and capabilities such as compositing, digital audio, and optical effects treatments. Cannot be taken simultaneously with FILM 3400 or 3600. Same as FILM 4000. Requisites: Requires prerequisite courses of FILM 1502, 2000 or 2300, 2500, and 3400 or 3600 (all minimum grade (D-).",[0,16,600,830,"3",4,0,"Christopher Osborn","ATLS 310","Notes: This is a combined section class"]]],["ATLS 5320","Mobile Application Development: Advanced Topics","3",0,["None",[0,2,660,770,"3",3,0,"Aileen Pierce","ATLS 104","Notes: This is a combined section class"],[2,8,660,770,"3",3,0,"Aileen Pierce","ATLS 104","Notes: This is a combined section class"]]],["BSLW 6900","Independent Study","1 - 6",0,["None",[7,0,0,0,"1 - 6",100,0,"Staff","TBA"],[7,0,0,0,"1 - 6",100,0,"Staff","TBA"],[7,0,0,0,"1 - 6",100,0,"Staff","TBA"],[7,0,0,0,"1 - 6",100,0,"Staff","TBA"],[7,0,0,0,"1 - 6",100,0,"Staff","TBA"]]],["ATOC 3070","Introduction to Oceanography","3",0,["Investigates the broad-scale features and dynamics of the Earth's oceans. The course is roughly divided amongst the four major, interrelated disciplines of oceanography: marine geology, marine chemistry, physical oceanography (i.e. circulation), and marine biology. Specific topics include sea floor spreading, marine sediments, salinity, biogeochemical cycles, currents, waves, tides, primary production, marine ecology, marine resources, global warming, and much more. Department enforece prereq., any two-course sequence of natural science courses. Same as GEOL 3070. Approved for arts and sciences core curriculum: natural science.",[0,10,660,735,"3",46,0,"Pamela Stephens","BESC 180","Notes: This is a combined section class"]]],["ANTH 4730","Latin American Politics and Culture through Film and Text","3",0,["Introduces students to the political cultures and societies of Latin America. Through historical and ethnographic text, and documentary and non-documentary cinema, this course will explore class relations, ideology, and resistance from the conquest to the present.  Recommended prereq., ANTH 2100.  Same as ANTH 5730. Requisites: Restricted to students with 57-180 credits (Juniors or Seniors).",[0,10,660,735,"3",19,0,"Donna Goldstein","HALE 260"]]],["ASEN 3300","Aerospace Electronics and Communications","4",0,["Provides the fundamentals of electronics and communications widely used in aerospace engineering. Includes analog instrumentation electronics, data acquisition, digital electronics, and radio communication.  Offered spring only. Requisites: Requires prerequisite courses of ASEN 2003, PHYS 1120 and APPM 2360 (all minimum grade C).  Restricted to Aerospace Engineering (ASEN) majors only.",[0,20,900,950,"4",43,3,"Robert Marshall, ","BESC 180"],[2,10,480,590,"4",43,0,"Robert Marshall, ","ITLL 2B10"],[2,10,600,710,"4",0,3,"Robert Marshall, ","ITLL 2B10"]]],["ACCT 4240","Advanced Financial Accounting","3",0,["Examines advanced financial accounting theory and practice, emphasizing U.S. and international accounting for business combinations, consolidated financial statements, and accounting for partnerships. Same as ACCT 5240. Requisites: Requires prerequiste course of ACCT 3220 and ACCT 3230 or ACCT 3225 (minimum grade D-).  Restricted to Accounting (ACCT) or Finance (FNCE) majors with 52-180 units completed.",[0,10,840,915,"3",5,0,"Randy Johnston","KOBL 235","Notes: This is a combined section class"]]],["ASTR 2010","Modern Cosmology-Origin and Structure of the Universe","3",0,["Introduces modern cosmology to nonscience majors. Covers the Big Bang; the age, size, and structure of the universe; and the origin of the elements and of stars, galaxies, the solar system, and life. Approved for arts and sciences core curriculum: natural science.",[0,10,570,645,"3",111,0,"Michael Shull","DUAN G130"]]],["ANTH 5270","Plains Archaeology","3",0,["Same as ANTH 4270.",[0,10,750,825,"3",4,0,"Douglas Bamforth","HALE 260","Notes: This is a combined section class"]]],["ASEN 1969","Pathway to Space","3",0,["None",[0,10,930,1005,"3",122,0,"Christopher Koehler","MUEN E050"]]],["ATLS 3200","Sound","3",0,["Introduces techniques, technologies and concepts of digital sound through lectures, projects and critiques. Focuses technically on digital sound creation, production, synthesis and interactivity. Explores various approaches to digital sound production through historical and conceptual perspectives. Requisites: Requires prerequisite courses of ATLS 2000 and CSCI 1300 (all minimum grade C). Restricted to Technology, Arts and Media (TMEN) majors or the ATLAS (PATL) student group only.",[0,10,840,915,"3",11,0,"David Schaal","ATLS 104"]]],["ASEN 3128","Aircraft Dynamics","4",0,["Develops the fundamental concepts of aircraft dynamics. Covers flight mechanics, performance, dynamics and control of aircraft, and how they impact aircraft design. Offered spring only. Requisites: Requires prerequisite courses of ASEN 2002, 2003, 2004 and APPM 2360 (all minimum grade C). Restricted to Aerospace Engineering (ASEN) majors only.",[0,10,750,825,"4",13,10,"Dale Lawrence, ","FLMG 155"],[2,1,780,890,"4",13,0,"Dale Lawrence, ","ITLL 1B10"],[2,4,780,890,"4",0,10,"Dale Lawrence, ","ITLL 1B10"]]],["ASEN 3036","Introduction to Human Spaceflight","3",0,["Introduces students to the challenges of human space flight. Historical and current space programs and spacecraft are discussed with emphasis on those systems specific to sustaining human crews. Other topics include space environment with respect to sustaining human life and health, physiological and psychological concerns in a space habitat, astronaut selection and training, anomalies, mission operations motivation, costs rationale for human space exploration, and future program directions.  Not accepted as a Professional Area Elective for ASEN majors.  Approved for upper-division Humanities and Social Science elective for engineering students.",[0,10,570,645,"3",2,0,"James Voss","ECCR 265"]]],["ATOC 1060","Our Changing Environment: El Nino, Ozone, and Climate","3",0,["Discusses the Earth's climate for nonscience majors, focusing on the role of the atmosphere, oceans, and land surface. Describes the water cycle, atmospheric circulations, and ocean currents, and how they influence global climate, El Nino, and the ozone hole. Discusses human impacts from climate change. Department enforced prereq., ATOC 1050. Credit not granted for this course and GEOL 1060. Approved for arts and sciences core curriculum: natural science.",[0,10,750,825,"3",193,0,"Aleya Kaushik","DUAN G1B30"],[0,5,840,890,"3",86,0,"Kristopher Karnauskas","EKLC E1B20"],[1,16,840,890,"3",19,0,"Staff","DUAN G2B41"],[1,16,780,830,"3",23,0,"Staff","RAMY N1B31"],[1,8,1020,1070,"3",25,0,"Staff","MUEN E130"],[1,8,930,980,"3",19,0,"Staff","MUEN E064"]]],["APRD 3500","Story Design II","3",0,["Explores the uses of story and how the design of story must adapt to different platforms and genres, including both short- and long-form narratives, visual narrative, film, personal essay and advertising copy writing. Requisites: Requires a prerequisite course of APRD 2003 (minimum grade D-).",[14,10,750,825,"3",14,0,"David Slayden","ARMR 1B01"]]],["ATOC 5835","Seminar in Planetary Science","1",0,["Studies current research on a topic in planetary science. Subjects may vary each semester. May be repeated up to 4 total credit hours to meet candidacy requirements. Same as ASTR 5835 and GEOL 5835. Requisites: Restricted to graduate students only.",[3,2,960,1010,"1",5,0,"Staff","DUAN E126","Topic: Gravity in Our Solar System"]]],["ARTH 4169","Topics in Ancient and Classical Art and Archaeology","3",1,["In-depth consideration of an aspect of ancient Mediterranean culture. Topics vary; they may include ancient wall painting, Greek sculpture, artists and patrons, the ancient Near East, Egyptian art and archaeology, or Etruscan art and archaeology. Maybe repeated up to 9 total credit hours providing the topics are different. Same as CLAS 4169.",[0,10,660,735,"3",0,3,"Dimitri Nakassis","DUAN G1B35","Topic: Iron Age Greece"]]],["ARTH 5189","City of Rome","3",0,["Explores in detail the architecture, sculptures, coins, frescos, and other material evidence alongside the political and social history of Augustan Rome. Emphasis is on ways in which the textual and archaeological evidence complement and/or contradict one another. Will explore the impact of the early imperial period on later Roman phases of urban design and image making in the capital city. Same as CLAS 5189. Requisites: Restricted to graduate students only.",[0,4,900,1050,"3",9,0,"Diane Conlin","HUMN 370","Notes: This is a combined section class"]]],["ANTH 7030","Seminar: Archaeology","3",0,["Intensive examination of selected theoretical or methodological topics in archaeology. Topics vary with current research emphasis. May be repeated up to 6 total credit hours.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              Requisites: Restricted to graduate students only.",[3,1,600,750,"3",14,0,"Sarah Kurnick","HALE 455","Topic: Space and Power"]]],["ACCT 8900","Independent Study","1 - 3",0,["Instructor consent required and departmental form (taught as doctoral seminar). Requisites: Restricted to Business (BUSN) graduate students only.",[7,0,0,0,"1 - 3",100,0,"Staff","TBA"],[7,0,0,0,"1 - 3",100,0,"Staff","TBA"],[7,0,0,0,"1 - 3",100,0,"Staff","TBA"],[7,0,0,0,"1 - 3",100,0,"Staff","TBA"],[7,0,0,0,"1 - 3",100,0,"Staff","TBA"]]],["ATLS 6910","Information and Communication Technology for Development Practicum","3 - 6",0,["This practicum allows MS-ICTD students to synthesize what they have learned and test their readiness for a career in ICTD.  Practicum assignments are arranged under the supervision of the MS-ICTD Program Director and involve work with a non-governmental organization, development agency or technology/policy entity.  Successful completion is required for graduation from the MS-ICTD Program. Requisites: Requires prerequisite courses of ATLS 5210, 5220, 5230, 5240 and 5250 (all minimum grade D-).",[4,5,480,650,"3 - 6",15,0,"Mustafa Naseem","ATLS 225"]]],["ARSC 2470","MASP Coseminar: Physics 1 and 2","1",0,["Supplements and strengthens student experiences in physics. Allows particularly gifted students an opportunity to extend their understanding of the subjects and to explore possible careers in science. May be repeated up to 2 total credit hours.",[3,10,840,915,"1",11,0,"Staff","FLMG 244","Topic: SASC CO-SEM: Physics"]]],["ATLS 1100","Design Foundations","3",0,["Introduces foundational principles, practices and methods of design. Emphasizes design as an expressive and creative problem solving tool. This course engages with design from a broad perspective including visual, computational, physical and auditory design practices. Through lectures, discussions and creative projects, students will gain a familiarity with the diverse applications of creative technology through design. Requisites: Restricted to Technology, Arts and Media (TMEN) majors only.",[0,21,720,770,"3",69,0,"Annie Bruns","ATLS 100"]]],["ARTH 6959","Master's Thesis (Art History)","1 - 6",0,["None",[6,0,0,0,"1 - 6",100,0,"Albert Alhadeff","TBA"],[6,0,0,0,"1 - 6",100,0,"Kirk Ambrose","TBA"],[6,0,0,0,"1 - 6",100,0,"Staff","TBA"],[6,0,0,0,"1 - 6",100,0,"Robert Nauman","TBA"]]],["ATLS 3100","Form","3",0,["Teaches the fundamentals of 3D modeling, 3D animation and 3D printing / rapid prototyping from a conceptual and sculptural perspective. Through topical lectures, technical demonstrations and creative projects the course will introduce students to the potentials of thinking and working within 3-dimensional spaces. Requisites: Requires a prerequisite courses of ATLS 2000 (minimum grade C) and CSCI 1300 (minimum grade C-). Restricted to Technology, Arts and Media (TMEN) majors or the PATL student group only.",[0,5,660,735,"3",12,0,"Staff","ATLS 104"],[0,5,540,615,"3",14,0,"Staff","ATLS 104"]]],["AREN 6950","Master's Thesis","1 - 6",0,["None",[6,0,720,720,"1 - 6",20,0,"Staff","TBA"]]],["APRD 4100","Brands and Culture","3",1,["Explores the intersection between culture and marketing communication. Students will examine brand communities, brand and category culture as well as popular culture and the impact on and within marketing communication. The goal is for students to become more aware of the importance of culture in the ability of communication to disrupt the status quo within a market. Requisites: Requires a prerequisite course of APRD 2000 (minimum grade D-). Restricted Strategic Communication (STCM) majors only with a minimum of 80 hours.",[0,1,1080,1230,"3",0,1,"Kristina Ford","ENVD 122"],[0,2,1080,1230,"3",0,5,"Staff","HUMN 190"]]],["APRD 5008","RE: Studio 2","3",0,["None",[5,8,1050,1230,"3",30,0,"Andrew Baker, ","OFF SITE"]]],["ARTH 4909","Independent Study---Art History","1 - 3",0,["May be repeated up to 7 total credit hours.",[7,0,0,0,"1 - 3",50,0,"Robert Nauman","TBA"],[7,0,0,0,"1 - 3",50,0,"Staff","TBA"],[7,0,0,0,"1 - 3",50,0,"Annette de Stecher","TBA"],[7,0,0,0,"1 - 3",50,0,"George Rivera","TBA"],[7,0,0,0,"1 - 3",50,0,"Albert Alhadeff","TBA"],[7,0,0,0,"1 - 3",50,0,"Kirk Ambrose","TBA"],[7,0,0,0,"1 - 3",50,0,"Staff","TBA"],[7,0,0,0,"1 - 3",50,0,"James Cordova","TBA"],[7,0,0,0,"1 - 3",50,0,"Staff","TBA"],[7,0,0,0,"1 - 3",50,0,"Staff","TBA"]]],["ACCT 5540","Accounting Information Systems","3",1,["Same as ACCT 4540. Requisites: Requires prerequisite course of ACCT 3220 or 3225 (minimum grade D-).  Restricted to Acct (ACCT), Accounting Taxation (ACTX) or Business Administration (BUAD) graduate students or Finance/Acct (FNCEACCT) or ACCT Concurrent Degree students only.",[0,2,1110,1275,"3",0,2,"Staff","KOBL 320","Notes: This is a combined section class"]]],["ASTR 6630","Earth and Planetary Physics 3","3",0,["Examines the solar system, emphasizing theories of its origin and meteorites. Highlights distribution of radioactive materials, age dating, heat flow through continents and the ocean floor, internal temperature distribution in the Earth, and mantle convection. Also covers the origin of the oceans and atmosphere. Same as GEOL 6630 and PHYS 6630. Requisites: Restricted to graduate students only.",[0,10,840,915,"3",6,0,"Shijie Zhong","DUAN G2B41","Notes: This is a combined section class"]]],["ACCT 3230","Corporate Financial Reporting 2","3",0,["Second in a two-course sequence building and extending detailed knowledge of preparation, analysis, and use of financial statements. Requisites: Requires a prerequisite course of ACCT 3220 (minimum grade D-).  Restricted to Business (BUSN) majors with 52-180 units completed.",[0,10,480,555,"3",10,0,"Steven Rock","KOBL 230"],[0,10,570,645,"3",0,1,"Steven Rock","KOBL 230"],[0,10,660,735,"3",0,10,"Steven Rock","KOBL 230"]]],["ANTH 2020","Introduction to Biological Anthropology 2","3",0,["Continuation of ANTH 2010. Emphasizes genetics, human variation, and microevolution. Recommended prereq., ANTH 2010. Credit not granted for this course and ANTH 2060. Approved for GT-SC1. Approved for arts and sciences core curriculum: natural science.",[0,21,660,710,"3",318,0,"Robin Bernstein","MUEN E050"]]],["ATLS 5210","Global Development I","3",0,["Introduces students to the theories and policy of international development. The course will examine the role of multilateral agencies, foundations, aid organizations, corporate entities and academia in development as both an industry and a research field. The course will focus on development movements and their outcomes, the inter-related nature of development and its effect on policies and programs, and critiques. Requisites: Restricted to graduate students only.",[3,4,990,1140,"3",18,0,"Mustafa Naseem","ATLS 225"]]],["ACCT 3320","Cost Management","3",0,["Provides cost analysis for the support of management decision making. Analyzes activities, cost behavior, role of accounting in planning, financial modeling,and managerial uses of cost data. Requisites: Requires prerequisite courses of BCOR 2000 and BCOR 2200 or BCOR 2002 (all minimum grade D-). Restricted to Business (BUSN) majors with 52-180 units completed.",[0,5,480,555,"3",26,0,"John Ballantine","KOBL 302"],[0,5,570,645,"3",0,7,"John Ballantine","KOBL 302"]]],["ATOC 4770","Wind Energy Meteorology","3",0,["Explores the complex interactions of the atmosphere and wind energy generation. Surveys wind turbine designs. Explores planetary boundary layer dynamics, traditional and novel wind measurement methods, forecasting methods, wind turbine and wind far wakes, wind far optimization, sound propagation from wind plants, climate change impacts on wind resources, and the impacts of wind plants on local environments. Department enforced prereq., ATOC 1050. Same as ATOC 5770. Approved for arts and sciences core curriculum: natural science.",[0,5,855,930,"3",16,0,"Julie Lundquist","SEEC S125","Notes: This is a combined section class"]]],["ATOC 5000","Critical Issues in Climate and the Environment","3",0,["Discusses current issues such as ozone depletion, global warming, and air quality for graduate students in nonscientific fields. Provides the scientific background necessary to understand, follow scientific developments, and critically evaluate these issues. Same as ENVS 5830. Credit not granted for this course and ATOC 4800. Requisites: Restricted to graduate students only.",[0,5,945,1020,"3",5,0,"Weiqing Han","SEEC N126","Notes: This is a combined section class"]]],["BSLW 4120","Advanced Business Law","3",0,["Continuation of BCORr 3000. Covers sales and lease transactions, negotiable instruments, creditor rights and bankruptcy, secured transactions, agency, business organizations, protection of property, and other advanced topics in legal and regulatory environments. BCOR 3000 and BSLW 4120/5120 together cover the business law topics tested on the CPA exam.  Same as BSLW 5120. Requisites: Requires prerequisite course of BCOR 2003 or BCOR 3000 (minimum grade D-).  Restricted to Business (BUSN) majors with 52-180 units completed.",[0,10,930,1005,"3",20,0,"John Ballantine","KOBL 255","Notes: This is a combined section class"]]],["ARSC 2000","Ways of Knowing: Constructions of Knowledge in the Academy and Beyond","3",0,["Explores different ways of knowing from interdisciplinary, cross-cultural perspectives. Course begins with personal interrogations of students' primary learning modes. It goes on to examine cultural assumptions about schooling, learning and knowledge, juxtaposing western and eastern philosophies of knowing and looking at how gender, race, class, and other categories of identity shape and interpret concepts of knowledge.   Restricted to Norlin Scholars only; department consent required. Same as NRLN 2000. Approved for arts and sciences core curriculum: ideals and values.",[3,10,570,645,"3",14,0,"Catherine Altman","FLMG 150"]]],["ASTR 1000","The Solar System","3",0,["Introduction to the night sky, planets, moons, and the life in our solar system.  Highlights the latest discoveries from space.  For non-science majors.  Some lectures may be held at Fiske Planetarium.  Offers opportunities for nighttime observations at Sommers-Bausch Observatory.  Similar to ASTR 1010, but without lab.  Credit for only one of ASTR 1000, 1110, 1010, or 1030.  Meets MAPS requirement for natural science: nonlab.  Approved for arts and sciences core curriculum: natural science (sequence).",[0,10,750,825,"3",201,0,"Nicholas Schneider","DUAN G1B20"],[0,10,840,915,"3",204,0,"Robert Ergun","DUAN G1B30"]]],["AREN 8990","Doctoral Thesis","1 - 10",0,["A minimum of 30 credit hours is required.",[6,0,720,720,"1 - 10",20,0,"Staff","TBA"]]]]}